<!DOCTYPE HTML>
<html lang="zh-tw" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>最好的防御 | XSS 蠕虫 &amp; 病毒</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        <meta name="author" content="wizardforcel">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-comment/plugin.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="./10.html" />
    
    
    <link rel="prev" href="./8.html" />
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="10"
        data-chapter-title="最好的防御"
        data-filepath="9.md"
        data-basepath="."
        data-revision="Mon Apr 18 2016 03:23:11 GMT+0000 (UTC)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
                
                <li>
                    <a href="https://www.gitbook.com/book/wizardforcel/xss-worms-and-viruses" target="blank" class="custom-link">XSS 蠕虫 &amp; 病毒</a>
                </li>
            
            

            
            <li class="divider"></li>
            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        介紹
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="0.html">
            
                
                    <a href="./0.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        XSS 蠕虫 &amp; 病毒 即将发生的威胁与最好的防御
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="1.html">
            
                
                    <a href="./1.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        介绍
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="2.html">
            
                
                    <a href="./2.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        关于 XSS 蠕虫和病毒的 10 条快速介绍_你现在需要知道的:
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="3.html">
            
                
                    <a href="./3.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        XSS 的概述
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="4.html">
            
                
                    <a href="./4.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        他们是怎么做的:传播的方法
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="5.html">
            
                
                    <a href="./5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        第一个 XSS 蠕虫: Samy
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="7" data-path="6.html">
            
                
                    <a href="./6.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        第一个 24 小时的传播：Samy 创下的纪录
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="7.html">
            
                
                    <a href="./7.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        对比分析
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="9" data-path="8.html">
            
                
                    <a href="./8.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>9.</b>
                        
                        最坏的情况
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="10" data-path="9.html">
            
                
                    <a href="./9.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>10.</b>
                        
                        最好的防御
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="11" data-path="10.html">
            
                
                    <a href="./10.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>11.</b>
                        
                        结论
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="12" data-path="11.html">
            
                
                    <a href="./11.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>12.</b>
                        
                        附录
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="13" data-path="12.html">
            
                
                    <a href="./12.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>13.</b>
                        
                        Samy 蠕虫代码
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="14" data-path="13.html">
            
                
                    <a href="./13.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>14.</b>
                        
                        Notes
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="15" data-path="14.html">
            
                
                    <a href="./14.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>15.</b>
                        
                        WhiteHat 的 Sentinel 服务 - 完整的网站漏洞管理
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="16" data-path="15.html">
            
                
                    <a href="./15.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>16.</b>
                        
                        关于
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    本書使用 GitBook 釋出
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >XSS 蠕虫 &amp; 病毒</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x6700;&#x597D;&#x7684;&#x9632;&#x5FA1;">&#x6700;&#x597D;&#x7684;&#x9632;&#x5FA1;</h1>
<p>&#x5728;&#x8FC7;&#x53BB;&#x8D85;&#x8FC7;&#x5341;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x53CD;&#x75C5;&#x6BD2;&#x754C;&#x4E00;&#x76F4;&#x4F9D;&#x8D56;&#x4E8E;&#x5FEB;&#x901F;&#x7684;&#x53CD;&#x5E94;&#x65F6;&#x95F4;&#x6765;&#x9650;&#x5236;&#x8815;&#x866B;&#x548C;&#x75C5;&#x6BD2;&#x6240;&#x9020;&#x6210;&#x7684;&#x635F;&#x5BB3;&#x3002;&#x968F;&#x7740;&#x65B0;&#x4E00;&#x4EE3; &#x7684;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x7684;&#x98DE;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x5728;&#x4E8B;&#x4EF6;&#x88AB;&#x7A33;&#x5B9A;&#x524D;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x635F;&#x5931;&#x6570;&#x767E;&#x4E07;&#xFF0C;&#x751A;&#x81F3;&#x6570;&#x5341;&#x4EBF;&#x7F8E;&#x5143;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x5C06;&#x91C7;&#x53D6;&#x6B65;&#x9AA4;&#xFF0C; &#x786E;&#x5B9A;&#x75AB;&#x60C5;&#x7684;&#x53D1;&#x751F;&#x548C;&#x9632;&#x6B62;&#x95EE;&#x9898;&#x7684;&#x53D1;&#x751F;&#x653E;&#x5728;&#x7B2C;&#x4E00;&#x4F4D;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x4E3A;&#x4E86;&#x9650;&#x5236;&#x8FD9;&#x4E9B;&#x65B0;&#x54C1;&#x79CD;&#x7684;&#x75C5;&#x6BD2;&#x548C;&#x8815;&#x866B;&#x7684;&#x5F71;&#x54CD;&#x800C;&#x4E3A;&#x7528;&#x6237;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA; &#x5458;&#xFF0C;&#x5B89;&#x5168;&#x4E13;&#x5BB6;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x5382;&#x5546;&#x63D0;&#x4F9B;&#x7684;&#x660E;&#x786E;&#x7684;&#x6B65;&#x9AA4;&#xFF1A;</p>
<h2 id="&#x7528;&#x6237;">&#x7528;&#x6237;</h2>
<p>1\&#xFF0E; &#x70B9;&#x51FB;&#x94FE;&#x63A5;&#x53D1;&#x9001;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x6216;&#x5373;&#x65F6;&#x6D88;&#x606F;&#x65F6;&#x4E00;&#x5B9A;&#x8981;&#x8C28;&#x614E;&#x3002;&#x53EF;&#x7591;&#x7684;&#x8FC7;&#x957F;&#x94FE;&#x63A5;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x90A3;&#x4E9B;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x5305;&#x542B; HTML &#x4EE3;&#x7801; &#x7684;&#x94FE;&#x63A5;&#x3002;&#x5982;&#x679C;&#x6709;&#x7591;&#x95EE;&#xFF0C;&#x624B;&#x52A8;&#x8F93;&#x5165;&#x7F51;&#x5740;&#x5230;&#x60A8;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x5730;&#x5740;&#x680F;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#x3002;</p>
<p>2\&#xFF0E; &#x5BF9;&#x4E8E; XSS &#x6F0F;&#x6D1E;&#xFF0C;&#x6CA1;&#x6709;&#x7F51;&#x7EDC;&#x6D4F;&#x89C8;&#x5668;&#x6709;&#x4E00;&#x4E2A;&#x660E;&#x663E;&#x7684;&#x5B89;&#x5168;&#x4F18;&#x52BF;&#x3002;&#x8BDD;&#x867D;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x4F5C;&#x8005;&#x559C;&#x6B22; Firefox &#x6D4F;&#x89C8;&#x5668;&#x3002;&#x4E3A;&#x4E86;&#x83B7;&#x5F97; &#x989D;&#x5916;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5B89;&#x88C5;&#x4E00;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x63D2;&#x4EF6;&#xFF0C;&#x5982; NoScript25&#xFF08;Firefox &#x6269;&#x5C55;&#x63D2;&#x4EF6;&#xFF09;&#x6216; Netcraft &#x5DE5;&#x5177;&#x680F; 26&#x3002;</p>
<p>3\&#xFF0E; &#x867D;&#x7136;&#x4E0D;&#x662F; 100&#xFF05;&#x6709;&#x6548;&#xFF0C;&#x4F46;&#x662F;&#x907F;&#x5F00;&#x53EF;&#x7591;&#x7F51;&#x7AD9;&#xFF0C;&#x5982;&#x90A3;&#x4E9B;&#x63D0;&#x4F9B;&#x9ED1;&#x5BA2;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#xFF0C;warez&#xFF0C;&#x6216;&#x8272;&#x60C5;&#x7684;&#x7F51;&#x7AD9;&#x662F;&#x660E;&#x667A;&#x7684;&#x3002;</p>
<h2 id="&#x5F00;&#x53D1;&#x8005;">&#x5F00;&#x53D1;&#x8005;</h2>
<p>1. &#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x5E94;&#x8BE5;&#x5BF9;&#x6240;&#x6709;&#x7528;&#x6237;&#x63D0;&#x4EA4;&#x7684;&#x5185;&#x5BB9;&#x6267;&#x884C;&#x575A;&#x5982;&#x78D0;&#x77F3;&#x8F93;&#x5165;&#x9A8C;&#x8BC1;&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x7F51;&#x5740;&#xFF0C;&#x67E5; &#x8BE2;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;header&#xFF0C;POST &#x6570;&#x636E;&#x7B49;&#x6240;&#x6709;&#x7528;&#x6237;&#x63D0;&#x4EA4;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x53EA;&#x63A5;&#x53D7;&#x60A8;&#x6240;&#x5E0C;&#x671B;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x5728;&#x60A8;&#x6307;&#x5B9A;&#x7684;&#x957F;&#x5EA6;&#x5185;&#xFF0C;&#x548C;&#x6307;&#x5B9A; &#x7684;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x636E;&#x7684;&#x683C;&#x5F0F;&#x3002;&#x7EC4;&#x7EC7;&#xFF0C;&#x8FC7;&#x6EE4;&#xFF0C;&#x6216;&#x5FFD;&#x7565;&#x4E00;&#x5207;&#x3002;</p>
<p>2. &#x4FDD;&#x62A4;&#x88AB;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x6216;&#x6765;&#x81EA;&#x7B2C;&#x4E09;&#x65B9;&#x7F51;&#x7AD9;&#x6267;&#x884C;&#x7684;&#x6240;&#x6709;&#x654F;&#x611F;&#x529F;&#x80FD;&#x3002;&#x5728;&#x9002;&#x5F53;&#x7684;&#x60C5;&#x51B5;&#x4F7F;&#x7528;&#x4F1A;&#x8BDD;&#x4EE4;&#x724C; 27&#x3001;&#x9A8C;&#x8BC1;&#x7801; 28 &#x7CFB;&#x7EDF;&#x6216;&#x8005; HTTP &#x5F15;&#x7528;&#x5934;&#x68C0;&#x67E5;&#x3002;</p>
<p>3. &#x5982;&#x679C;&#x60A8;&#x7684;&#x7F51;&#x7AD9;&#x5FC5;&#x987B;&#x652F;&#x6301;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684; HTML&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x662F;&#x5904;&#x5728;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x660E;&#x667A;&#x7684;&#x4E0B;&#x6ED1;&#x5761;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x53EF;&#x4EE5; &#x505A;&#xFF0C;&#x6765;&#x4FDD;&#x62A4;&#x60A8;&#x7684;&#x7F51;&#x7AD9;&#x3002;&#x8BF7;&#x786E;&#x4FDD;&#x60A8;&#x6536;&#x5230;&#x7684; HTML &#x5185;&#x5BB9;&#x662F;&#x826F;&#x597D;&#x7684;&#xFF0C;&#x53EA;&#x5305;&#x542B;&#x6700;&#x5C11;&#x7684;&#x4E00;&#x7EC4;&#x5B89;&#x5168;&#x6807;&#x7B7E;&#xFF08;&#x7EDD;&#x5BF9;&#x6CA1;&#x6709; JavaScript&#xFF09;&#xFF0C; &#x6CA1;&#x6709;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x5F15;&#x7528;&#x8FDC;&#x7A0B;&#x7684;&#x5185;&#x5BB9;&#xFF08;&#x5C24;&#x5176;&#x662F;&#x6837;&#x5F0F;&#x8868;&#x548C; JavaScript&#xFF09;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x4E3A;&#x4E86;&#x591A;&#x4E00;&#x70B9;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x8BF7;&#x5C06; httpOnly29 &#x6DFB; &#x52A0;&#x5230;&#x60A8;&#x7684; cookie</p>
<h2 id="&#x5B89;&#x5168;&#x4E13;&#x5BB6;">&#x5B89;&#x5168;&#x4E13;&#x5BB6;</h2>
<p>1. &#x53EA;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x624D;&#x80FD;&#x786E;&#x5B9A;&#x60A8;&#x7684;&#x5B89;&#x5168;&#x505A;&#x6CD5;&#x63D0;&#x4F9B;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x4FDD;&#x969C;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x7ECF;&#x5E38;&#x6D4B;&#x8BD5;&#x4ED6;&#x4EEC;&#x3002;&#x5728;&#x9ED1;&#x5BA2;&#x653B;&#x51FB;&#x7F51;&#x7AD9;&#x524D;&#x4E86;&#x89E3;&#x4F60;&#x7684; &#x6F0F;&#x6D1E;&#x662F;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;&#x8981;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x7F51;&#x7AD9;&#x7684;&#x8106;&#x5F31;&#x6027;&#x8BC4;&#x4F30;&#x662F;&#x8981;&#x8FDB;&#x884C;&#x7684;&#x3002;&#x62A5;&#x544A;&#x5E94;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5BF9;&#x60A8;&#x7684;&#x7F51;&#x7AD9;&#x7684;&#x5B89;&#x5168;&#x7684; &#x5168;&#x9762;&#x7684;&#x5BA1;&#x89C6;&#xFF0C;&#x5E76;&#x63CF;&#x8FF0;&#x4ED6;&#x4EEC;&#x5982;&#x4F55;&#x5E94;&#x5BF9;&#x548C;&#x8FDB;&#x884C;&#x6A21;&#x62DF;&#x653B;&#x51FB;&#x3002;WhiteHat Security &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x4EE5; Web &#x5B89;&#x5168;&#x5A01;&#x80C1;&#x5206;&#x7C7B;&#xFF08;WASC&#xFF09; &#x4E3A;&#x6D4B;&#x8BD5;&#x6807;&#x51C6;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x6F0F;&#x6D1E;&#x626B;&#x63CF;&#x4E0E;&#x4E13;&#x5BB6;&#x9A71;&#x52A8;&#x5206;&#x6790;&#x7684;&#x7EC4;&#x5408;&#x65B9;&#x6CD5;&#x3002;</p>
<p>2. &#x6B63;&#x786E;&#x5730;&#x8BC4;&#x4F30;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x7684;&#x5B89;&#x5168;&#x6027;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x51E0;&#x5341;&#x4E2A;&#xFF0C;&#x6570;&#x4EE5;&#x767E;&#x8BA1;&#xFF0C;&#x6570;&#x4EE5;&#x5343;&#x8BA1;&#x7684;&#x5B89;&#x5168;&#x6D4B;&#x8BD5;&#x3002;&#x8BB8;&#x591A;&#x9700;&#x8981;&#x624B;&#x5DE5;&#x5B8C;&#x6210;&#x3002;&#x8FD9;&#x5C31; &#x662F;&#x4E3A;&#x4EC0;&#x4E48; WhiteHat &#x7684; Sentinel &#x5728;&#x8FD9;&#x6837;&#x7684;&#x670D;&#x52A1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;&#x6E90;&#x4EE3;&#x7801;&#x548C;&#x9ED1;&#x76D2;&#x5B50;&#x626B;&#x63CF;&#x4EA7;&#x54C1;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x4EBA;&#x5458;&#x5728;&#x5F00;&#x53D1;&#x9636;&#x6BB5;&#x4E2D;&#x6D4B;&#x8BD5; Web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>3. &#x5F53;&#x60A8;&#x7684;&#x7F51;&#x7AD9;&#x7EDD;&#x5BF9;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x8003;&#x8651; Web &#x5E94;&#x7528;&#x9632;&#x706B;&#x5899;&#xFF08;WAF&#xFF09;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x9632;&#x5FA1;&#x5C42;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x914D;&#x7F6E; &#x7528;&#x60A8;&#x7684;&#x7F51;&#x7AD9;&#x7684;&#x89C4;&#x5219;&#x5E76;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x6267;&#x884C;&#x3002;&#x4EFB;&#x4F55;&#x8D85;&#x51FA;&#x89C4;&#x5219;&#x5916;&#x7684;&#x884C;&#x4E3A;&#x5C06;&#x88AB;&#x963B;&#x6B62;&#x6216;&#x8005;&#x8BB0;&#x5F55;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x5927;&#x591A;&#x662F;&#x9AD8;&#x5EA6;&#x591A; &#x6837;&#x5316;&#x548C;&#x590D;&#x6742;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528; Web &#x5E94;&#x7528;&#x9632;&#x706B;&#x5899;&#x8BC4;&#x4EF7;&#x6807;&#x51C6;&#xFF08;WAFEC&#xFF09;&#x4F5C;&#x4E3A;&#x6BD4;&#x8F83;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<h2 id="&#x6D4F;&#x89C8;&#x5668;&#x5382;&#x5546;">&#x6D4F;&#x89C8;&#x5668;&#x5382;&#x5546;</h2>
<p>1. Mozilla&#xFF08;&#x706B;&#x72D0;&#xFF09;&#xFF0C;&#x5FAE;&#x8F6F;&#x548C; Opera &#x5F00;&#x53D1;&#x56E2;&#x961F;&#x5FC5;&#x987B;&#x5F00;&#x59CB;&#x6B63;&#x5F0F;&#x5B9E;&#x65BD;&#x5185;&#x5BB9;&#x9650;&#x5236;&#x3002;&#x73B0;&#x5B9E;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x7B49;&#x5F85; Web &#x5E94;&#x7528;&#x8F6F;&#x4EF6;&#x51CF; &#x5C11; XSS &#x6F0F;&#x6D1E;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x662F;&#x662F;&#x4E0D;&#x73B0;&#x5B9E;&#x7684;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;&#x51CF;&#x5C11;&#x4E86; 100&#xFF05;&#x3002;</p>
<p>2. Mozilla(Firefox)&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x8BF7;&#x6267;&#x884C; httpOnly&#xFF0C;&#x5B83;&#x5DF2;&#x7ECF;&#x51FA;&#x73B0;&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#x4E86;&#x3002;</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="./8.html" class="navigation navigation-prev " aria-label="Previous page: 最坏的情况"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="./10.html" class="navigation navigation-next " aria-label="Next page: 结论"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-comment/plugin.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"comment":{"highlightCommented":true},"autocover":{},"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
