<!DOCTYPE HTML>
<html lang="zh-tw" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>第1章  SQLite介绍 | SQLite 权威指南</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        <meta name="author" content="wizardforcel">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-comment/plugin.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="./4.html" />
    
    
    <link rel="prev" href="./2.html" />
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="3"
        data-chapter-title="第1章  SQLite介绍"
        data-filepath="3.md"
        data-basepath="."
        data-revision="Tue May 17 2016 11:53:33 GMT+0000 (UTC)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
                
                <li>
                    <a href="https://www.gitbook.com/book/wizardforcel/the-definitive-guide-to-sqlite" target="blank" class="custom-link">SQLite 权威指南</a>
                </li>
            
            

            
            <li class="divider"></li>
            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        SQLite权威指南
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="1.html">
            
                
                    <a href="./1.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        推荐者的话
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="2.html">
            
                
                    <a href="./2.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        前言
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="3" data-path="3.html">
            
                
                    <a href="./3.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        第1章  SQLite介绍
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="4.html">
            
                
                    <a href="./4.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        第2章 入门
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="5.html">
            
                
                    <a href="./5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        第3章  关系模型
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="6.html">
            
                
                    <a href="./6.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        第4章  SQL
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="7" data-path="7.html">
            
                
                    <a href="./7.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        第5章  设计和概念
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="8.html">
            
                
                    <a href="./8.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        第6章  核心C API
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="9" data-path="9.html">
            
                
                    <a href="./9.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>9.</b>
                        
                        第7章  扩充C API
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="10" data-path="10.html">
            
                
                    <a href="./10.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>10.</b>
                        
                        第8章  语言扩展
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="11" data-path="11.html">
            
                
                    <a href="./11.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>11.</b>
                        
                        第9章  SQLite内核
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    本書使用 GitBook 釋出
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >SQLite 权威指南</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x7B2C;1&#x7AE0;--sqlite&#x4ECB;&#x7ECD;">&#x7B2C;1&#x7AE0;  SQLite&#x4ECB;&#x7ECD;</h1>
<p>SQLite&#x662F;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#x3001;&#x5185;&#x5D4C;&#x5F0F;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x3002;&#x5B83;&#x6700;&#x521D;&#x53D1;&#x5E03;&#x4E8E;2000&#x5E74;&#xFF0C;&#x5728;&#x4FBF;&#x643A;&#x6027;&#x3001;&#x6613;&#x7528;&#x6027;&#x3001;&#x7D27;&#x51D1;&#x6027;&#x3001;&#x6709;&#x6548;&#x6027;&#x548C;&#x53EF;&#x9760;&#x6027;&#x65B9;&#x9762;&#x6709;&#x7A81;&#x51FA;&#x7684;&#x8868;&#x73B0;&#x3002;</p>
<h2 id="&#x5185;&#x5D4C;&#x5F0F;&#x6570;&#x636E;&#x5E93;">&#x5185;&#x5D4C;&#x5F0F;&#x6570;&#x636E;&#x5E93;</h2>
<p>SQLite&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x5D4C;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<p>&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x5728;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x5176;&#x597D;&#x5904;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x7F51;&#x7EDC;&#x914D;&#x7F6E;&#x548C;&#x7BA1;&#x7406;&#x3002;&#x6570;&#x636E;&#x5E93;&#x7684;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x8FD0;&#x884C;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x7F51;&#x7EDC;&#x8BBF;&#x95EE;&#x7684;&#x6D88;&#x8017;&#xFF0C;&#x7B80;&#x5316;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#xFF0C;&#x4F7F;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x8D77;&#x6765;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x6240;&#x6709;&#x9700;&#x8981;&#x4F60;&#x505A;&#x7684;&#x90FD;&#x5DF2;&#x7ECF;&#x548C;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x4E00;&#x8D77;&#x7F16;&#x8BD1;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x56FE;1-1&#x6240;&#x793A;&#x3002;&#x4E00;&#x4E2A;Perl&#x811A;&#x672C;&#x3001;&#x4E00;&#x4E2A;&#x6807;&#x51C6;C/C++&#x7A0B;&#x5E8F;&#x548C;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;PHP&#x7F16;&#x5199;&#x7684;Apache&#x8FDB;&#x7A0B;&#x90FD;&#x4F7F;&#x7528;SQLite&#x3002;Perl&#x811A;&#x672C;&#x5BFC;&#x5165;DBI::SQLite&#x6A21;&#x677F;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x5B83;&#x6765;&#x8BBF;&#x95EE;C API&#x3002;PHP&#x91C7;&#x7528;&#x4E0E;C&#x76F8;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x8BBF;&#x95EE;C API&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x9700;&#x8981;&#x8BBF;&#x95EE;C API&#x3002;&#x5C3D;&#x7BA1;&#x5B83;&#x4EEC;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x90FD;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x64CD;&#x4F5C;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x3002;SQLite&#x5229;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x529F;&#x80FD;&#x6765;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x7684;&#x540C;&#x6B65;&#x548C;&#x52A0;&#x9501;&#x3002;</p>
<p><img src="img/image001.jpg" alt=""></p>
<p>&#x56FE;1-1 &#x5185;&#x5D4C;&#x7684;&#x4E3B;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;SQLite</p>
<p>&#x76EE;&#x524D;&#x5E02;&#x573A;&#x4E0A;&#x6709;&#x591A;&#x79CD;&#x4E3A;&#x5185;&#x5D4C;&#x5E94;&#x7528;&#x6240;&#x8BBE;&#x8BA1;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4EA7;&#x54C1;&#xFF0C;&#x5982;Sybase SQL Anywhere&#x3001;InterSystems Cach&#xE9;&#x3001;Pervasive PSQL&#x548C;&#x5FAE;&#x8F6F;&#x7684;Jet Engine&#x3002;&#x6709;&#x4E9B;&#x5382;&#x5BB6;&#x4ECE;&#x4ED6;&#x4EEC;&#x7684;&#x5927;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4EA7;&#x54C1;&#x7FFB;&#x65B0;&#x51FA;&#x5185;&#x5D4C;&#x5F0F;&#x7684;&#x53D8;&#x79CD;&#xFF0C;&#x5982;IBM&#x7684;DB2 Everyplace&#x3001;Oracle&#x7684;10g&#x548C;&#x5FAE;&#x8F6F;&#x7684;SQL Server Desktop Engine&#x3002;&#x5F00;&#x6E90;&#x7684;&#x6570;&#x636E;&#x5E93;MySQL&#x548C;Firebird&#x90FD;&#x63D0;&#x4F9B;&#x5185;&#x5D4C;&#x5F0F;&#x7684;&#x7248;&#x672C;&#x3002;&#x5728;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4EA7;&#x54C1;&#x4E2D;&#xFF0C;&#x4EC5;&#x6709;&#x4E24;&#x4E2A;&#x662F;&#x5B8C;&#x5168;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;&#x7684;&#x4E14;&#x4E0D;&#x6536;&#x8BB8;&#x53EF;&#x8BC1;&#x8D39;&#x7528;&#x2014;&#x2014;Firebird&#x548C;SQLite&#x3002;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x5F53;&#x4E2D;&#xFF0C;&#x4EC5;&#x6709;&#x4E00;&#x4E2A;&#x662F;&#x4E13;&#x95E8;&#x4E3A;&#x5185;&#x5D4C;&#x5F0F;&#x5E94;&#x7528;&#x8BBE;&#x8BA1;&#x7684;&#x2014;&#x2014;SQLite&#x3002;</p>
<h2 id="&#x5F00;&#x53D1;&#x8005;&#x7684;&#x6570;&#x636E;&#x5E93;">&#x5F00;&#x53D1;&#x8005;&#x7684;&#x6570;&#x636E;&#x5E93;</h2>
<p>SQLite&#x5177;&#x6709;&#x591A;&#x65B9;&#x9762;&#x7684;&#x7279;&#x6027;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5E93;&#xFF0C;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5F88;&#x597D;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x786E;&#x5B9E;&#x6709;&#x5F88;&#x591A;&#x9014;&#x5F84;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x2014;&#x2014;&#x5185;&#x5D4C;&#x73AF;&#x5883;&#x3001;&#x7F51;&#x7AD9;&#x3001;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#x3001;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;SQLite&#x5C31;&#x8C61;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4F20;&#x9001;&#x5E26;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x65B9;&#x4FBF;&#x7684;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7ED1;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5C31;&#x8C61;&#x4F20;&#x9001;&#x5E26;&#x4E00;&#x6837;&#xFF0C;&#x5BF9;SQLite&#x7684;&#x4F7F;&#x7528;&#x6CA1;&#x6709;&#x7EC8;&#x70B9;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x4EC5;&#x4EC5;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x5BB9;&#x5668;&#xFF0C;SQLite&#x8FD8;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x7EAF;&#x7684;&#x6570;&#x636E;&#x5904;&#x7406;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x5982;&#x679C;&#x5927;&#x5C0F;&#x548C;&#x590D;&#x6742;&#x6027;&#x5408;&#x9002;&#xFF0C;&#x4F7F;&#x7528;SQLite&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8F6C;&#x5316;&#x4E3A;&#x8868;&#xFF0C;&#x5E76;&#x4FDD;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5185;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x7528;&#x6B64;&#x65B9;&#x6CD5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x64CD;&#x4F5C;&#x4E92;&#x76F8;&#x5173;&#x8054;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x5F88;&#x7E41;&#x91CD;&#x7684;&#x4EFB;&#x52A1;&#x9875;&#x4E0D;&#x5FC5;&#x5199;&#x81EA;&#x5DF1;&#x7684;&#x7B97;&#x6CD5;&#x6765;&#x5BF9;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x64CD;&#x4F5C;&#x548C;&#x6392;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x60F3;&#x50CF;&#x4E00;&#x4E0B;&#x5728;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x81EA;&#x884C;&#x5B8C;&#x6210;&#x4E0B;&#x9762;SQL&#x8BED;&#x53E5;&#x6240;&#x4EE3;&#x8868;&#x7684;&#x5DE5;&#x4F5C;&#x9700;&#x8981;&#x591A;&#x5C11;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>SELECT AVG(z-y) FROM table GROUP BY x
    HAVING x &gt; MIN(z) OR x &lt; MAX(y)
    ORDER BY y DESC LIMIT 10 OFFSET 3;
</code></pre><p>SQLite&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5B66;&#x4E60;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x901A;&#x8FC7;&#x5B83;&#x53EF;&#x4EE5;&#x7814;&#x7A76;&#x5F88;&#x591A;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x8BFE;&#x9898;&#x3002;&#x5206;&#x6790;&#x5668;&#x3001;&#x5206;&#x8BCD;&#x5668;&#x3001;&#x865A;&#x62DF;&#x673A;&#x3001;Btree&#x7B97;&#x6CD5;&#x3001;&#x9AD8;&#x6574;&#x7F13;&#x5B58;&#x3001;&#x7A0B;&#x5E8F;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x53EF;&#x4EE5;&#x641E;&#x6E05;&#x695A;&#x5F88;&#x591A;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x7ECF;&#x5178;&#x6982;&#x5FF5;&#x3002;SQLite&#x7684;&#x6A21;&#x5757;&#x5316;&#x3001;&#x5C0F;&#x578B;&#x5316;&#x548C;&#x7B80;&#x6613;&#x6027;&#xFF0C;&#x4F7F;&#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x4E13;&#x95E8;&#x7814;&#x7A76;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x7BA1;&#x7406;&#x5458;&#x7684;&#x6570;&#x636E;&#x5E93;">&#x7BA1;&#x7406;&#x5458;&#x7684;&#x6570;&#x636E;&#x5E93;</h2>
<p>SQLite&#x4E0D;&#x4EC5;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5B83;&#x5BF9;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x4E5F;&#x5F88;&#x6709;&#x7528;&#x3002;&#x5B83;&#x5F88;&#x5C0F;&#x3001;&#x7D27;&#x51D1;&#x800C;&#x7CBE;&#x81F4;&#xFF0C;&#x5C31;&#x50CF;&#x4E00;&#x4E9B;Unix&#x7684;&#x5E38;&#x7528;&#x5DE5;&#x5177;&#xFF0C;&#x5982;find&#x3001;rsync&#x6216;grep&#x3002;SQLite&#x63D0;&#x4F9B;&#x4E86;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#x4F9B;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x521D;&#x5B66;&#x8005;&#x6765;&#x8BF4;&#xFF0C;SQLite&#x662F;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x5404;&#x79CD;&#x5173;&#x7CFB;&#x76F8;&#x5173;&#x6982;&#x5FF5;&#x7684;&#x65B9;&#x4FBF;&#x7684;&#x5B66;&#x4E60;&#x5DE5;&#x5177;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x5F88;&#x5FEB;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x5B89;&#x88C5;&#x5728;&#x5404;&#x7C7B;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5B83;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5171;&#x4EAB;&#x9875;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x8F6C;&#x6362;&#x3002;&#x5B83;&#x5177;&#x6709;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5404;&#x79CD;&#x7279;&#x8272;&#x800C;&#x53C8;&#x4E0D;&#x4EE4;&#x4EBA;&#x751F;&#x754F;&#x3002;&#x5B83;&#x7684;&#x7A0B;&#x5E8F;&#x548C;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x4EC5;&#x7528;U&#x76D8;&#x5C31;&#x80FD;&#x4F20;&#x9012;&#x3002;</p>
<h2 id="sqlite-&#x7684;&#x5386;&#x53F2;">SQLite &#x7684;&#x5386;&#x53F2;</h2>
<p>&#x4ECE;&#x67D0;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;SQLite&#x6700;&#x521D;&#x7684;&#x6784;&#x601D;&#x662F;&#x5728;&#x4E00;&#x6761;&#x519B;&#x8230;&#x4E0A;&#x8FDB;&#x884C;&#x7684;&#x3002;SQLite&#x7684;&#x4F5C;&#x8005;D. Richard Hipp&#x5F53;&#x65F6;&#x6B63;&#x5728;&#x4E3A;&#x7F8E;&#x56FD;&#x6D77;&#x519B;&#x7F16;&#x5236;&#x4E00;&#x79CD;&#x4F7F;&#x7528;&#x5728;&#x5BFC;&#x5F39;&#x9A71;&#x9010;&#x8230;&#x4E0A;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x90A3;&#x4E2A;&#x7A0B;&#x5E8F;&#x6700;&#x521D;&#x662F;&#x8FD0;&#x884C;&#x5728;Hewlett-Packard Unix (HPUX)&#x4E0A;&#xFF0C;&#x540E;&#x53F0;&#x4F7F;&#x7528;Informix&#x6570;&#x636E;&#x5E93;&#x3002;&#x5BF9;&#x90A3;&#x4E2A;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#xFF0C;Informix&#x6709;&#x70B9;&#x513F;&#x592A;&#x5F3A;&#x5927;&#x4E86;&#x3002;&#x4E00;&#x4E2A;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x5458;(DBA)&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E00;&#x6574;&#x5929;&#x6765;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x5B89;&#x88C5;&#x548C;&#x5347;&#x7EA7;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x7ECF;&#x9A8C;&#xFF0C;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x5C31;&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x4E5F;&#x505A;&#x4E0D;&#x5B8C;&#x4E86;&#x3002;</p>
<p>2000&#x5E74;&#x4E00;&#x6708;&#xFF0C;Hipp&#x5F00;&#x59CB;&#x548C;&#x4E00;&#x4E2A;&#x540C;&#x4E8B;&#x8BA8;&#x8BBA;&#x5173;&#x4E8E;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5185;&#x5D4C;&#x5F0F;SQL&#x6570;&#x636E;&#x5E93;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x4F7F;&#x7528;GNU DBM B-Tree library (gdbm)&#x505A;&#x540E;&#x53F0;&#xFF0C;&#x540C;&#x65F6;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x4E0D;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x548C;&#x7BA1;&#x7406;&#x652F;&#x6301;&#x3002;&#x540E;&#x6765;&#xFF0C;&#x5F53;&#x6709;&#x4E9B;&#x7A7A;&#x95F2;&#x65F6;&#x95F4;&#x65F6;&#xFF0C;Hipp&#x5C31;&#x5F00;&#x59CB;&#x5B9E;&#x65BD;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x5728;2000&#x5E74;&#x7684;&#x516B;&#x6708;&#x4EFD;&#x53D1;&#x5E03;&#x4E86;SQLite&#x7684;1.0&#x7248;&#x3002;</p>
<p>&#x6309;&#x7167;&#x539F;&#x5B9A;&#x8BA1;&#x5212;&#xFF0C;SQLite 1.0&#x7528;gdbm&#x6765;&#x505A;&#x5B58;&#x50A8;&#x7BA1;&#x7406;&#x3002;&#x4F46;&#x540E;&#x6765;&#xFF0C;Hipp&#x5F88;&#x5FEB;&#x5C31;&#x6362;&#x6210;&#x4E86;&#x81EA;&#x5DF1;&#x7684;B-tree&#xFF0C;&#x4EE5;&#x652F;&#x6301;&#x4E8B;&#x52A1;&#x548C;&#x8BB0;&#x5F55;&#x6309;&#x4E3B;&#x952E;&#x7684;&#x5B58;&#x50A8;&#x3002;&#x968F;&#x7740;&#x6700;&#x521D;&#x7684;&#x5347;&#x7EA7;&#xFF0C;SQLite&#x5728;&#x529F;&#x80FD;&#x548C;&#x7528;&#x6237;&#x6570;&#x4E0A;&#x90FD;&#x5F97;&#x5230;&#x4E86;&#x7A33;&#x6B65;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x5728;2001&#x5E74;&#x4E2D;&#x671F;&#xFF0C;&#x5F88;&#x591A;&#x9879;&#x76EE;&#x2014;&#x2014;&#x5F00;&#x6E90;&#x7684;&#x6216;&#x5546;&#x4E1A;&#x7684;&#x2014;&#x2014;&#x90FD;&#x5F00;&#x59CB;&#x4F7F;&#x7528;SQLite&#x3002;&#x5728;&#x90A3;&#x4EE5;&#x540E;&#x7684;&#x51E0;&#x5E74;&#x4E2D;&#xFF0C;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x5176;&#x4ED6;&#x6210;&#x5458;&#x5F00;&#x59CB;&#x4E3A;&#x4ED6;&#x4EEC;&#x559C;&#x6B22;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x7F16;&#x5199;SQLite&#x6269;&#x5C55;&#x3002;SQLite&#x7684;ODBC&#x63A5;&#x53E3;&#x53EF;&#x4EE5;&#x4E3A;Perl&#x3001;Python&#x3001;Ruby&#x3001;Java&#x548C;&#x5176;&#x5B83;&#x4E3B;&#x6D41;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#xFF0C;&#x8FD9;&#x8BC1;&#x660E;&#x4E86;SQLite&#x6709;&#x5E7F;&#x9614;&#x7684;&#x5E94;&#x7528;&#x524D;&#x666F;&#x3002;</p>
<p>2004&#x5E74;&#xFF0C;SQLite&#x4ECE;&#x7248;&#x672C;2&#x5347;&#x7EA7;&#x5230;&#x7248;&#x672C;3&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x6B21;&#x5927;&#x5347;&#x7EA7;&#x3002;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x589E;&#x52A0;&#x5185;&#x7F6E;&#x7684;&#x5BF9;UTF-8&#x3001;UTF-16&#x53CA;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x5B57;&#x7B26;&#x96C6;&#x7684;&#x652F;&#x6301;&#x3002;While 3.0 was originally slated for release in summer 2005, America Online provided the necessary funding to see that it was completed by July 2004. &#x9664;&#x56FD;&#x9645;&#x5316;&#x529F;&#x80FD;&#x5916;&#xFF0C;&#x7248;&#x672C;3&#x7684;&#x5176;&#x5B83;&#x65B0;&#x7279;&#x6027;&#x5305;&#x62EC;&#xFF1A;&#x7ECF;&#x8FC7;&#x4FEE;&#x8865;&#x7684;C API&#xFF0C;&#x66F4;&#x7D27;&#x51D1;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x683C;&#x5F0F;(&#x6BD4;&#x539F;&#x6765;&#x8282;&#x7701;25%&#x7684;&#x7A7A;&#x95F4;)&#xFF0C;&#x5F31;&#x7C7B;&#x578B;&#xFF0C;&#x5927;&#x4E8C;&#x8FDB;&#x5236;&#x5BF9;&#x8C61;(BLOB)&#x7684;&#x652F;&#x6301;&#xFF0C;64-bit&#x7684;ROWID&#xFF0C;autovacuum&#x548C;&#x6539;&#x8FDB;&#x4E86;&#x7684;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x3002;&#x5C3D;&#x7BA1;&#x589E;&#x52A0;&#x4E86;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x7248;&#x672C;3&#x7684;&#x8FD0;&#x884C;&#x5E93;&#x4ECD;&#x7136;&#x5C0F;&#x4E8E;240K&#x5B57;&#x8282;&#x3002;Another improvement in version 3 was a good code cleanup&#x2014;revisiting and rewriting, or otherwise throwing out extraneous stuff accumulated in the 2.x series.</p>
<p>SQLite&#x6301;&#x7EED;&#x589E;&#x957F;&#x5E76;&#x59CB;&#x7EC8;&#x575A;&#x6301;&#x5176;&#x6700;&#x521D;&#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#xFF1A;&#x7B80;&#x5355;&#x3001;&#x5F39;&#x6027;&#x3001;&#x7D27;&#x51D1;&#x3001;&#x901F;&#x5EA6;&#x548C;&#x5F7B;&#x5E95;&#x7684;&#x6613;&#x7528;&#x3002;&#x672C;&#x4E66;&#x51FA;&#x7248;&#x65F6;&#xFF0C;SQLite&#x5DF2;&#x7ECF;&#x589E;&#x52A0;&#x4E86;CHECK&#x7EA6;&#x675F;&#xFF0C;&#x4E0B;&#x9762;&#x5C31;&#x8981;&#x589E;&#x52A0;&#x5916;&#x952E;&#x7EA6;&#x675F;&#xFF0C;&#x518D;&#x4E0B;&#x9762;&#x5462;&#xFF1F;</p>
<h2 id="&#x8C01;&#x4F7F;&#x7528;sqlite">&#x8C01;&#x4F7F;&#x7528;SQLite</h2>
<p>&#x5F53;&#x524D;&#xFF0C;SQLite&#x5DF2;&#x7ECF;&#x88AB;&#x591A;&#x79CD;&#x8F6F;&#x4EF6;&#x548C;&#x4EA7;&#x54C1;&#x6240;&#x4F7F;&#x7528;&#x3002;&#x5B83;&#x88AB;&#x7528;&#x5728;Apple&#x7684;Mac OS X&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x88AB;&#x7528;&#x4F5C;&#x5176;CoreData&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x67B6;&#x6784;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5B83;&#x8FD8;&#x5E94;&#x7528;&#x4E8E;Safari&#x7684;Web&#x6D4F;&#x89C8;&#x5668;&#x3001;Mail.app&#x7684;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x7A0B;&#x5E8F;&#x3001;RSS&#x7684;&#x7BA1;&#x7406;&#x3001;Apple&#x7684;Aperture&#x7167;&#x7247;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;SQLite&#x5F88;&#x5C11;&#x505A;&#x5E7F;&#x544A;&#xFF0C;&#x4F46;&#x5B83;&#x8FD8;&#x662F;&#x88AB;&#x7528;&#x5728;&#x4E86;&#x591A;&#x79CD;&#x6D88;&#x8D39;&#x7C7B;&#x4EA7;&#x54C1;&#x4E2D;&#x3002;</p>
<h2 id="&#x4F53;&#x7CFB;&#x7ED3;&#x6784;">&#x4F53;&#x7CFB;&#x7ED3;&#x6784;</h2>
<p>SQLite&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x7CBE;&#x81F4;&#x7684;&#x3001;&#x6A21;&#x5757;&#x5316;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x5E76;&#x5F15;&#x8FDB;&#x4E86;&#x4E00;&#x4E9B;&#x72EC;&#x7279;&#x7684;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7BA1;&#x7406;&#x3002;&#x5B83;&#x7531;&#x88AB;&#x7EC4;&#x7EC7;&#x5728;3&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;8&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x6A21;&#x5757;&#x7EC4;&#x6210;&#xFF0C;&#x5982;&#x56FE;1-2&#x6240;&#x793A;&#x3002;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x5C06;&#x67E5;&#x8BE2;&#x8FC7;&#x7A0B;&#x5212;&#x5206;&#x4E3A;&#x51E0;&#x4E2A;&#x4E0D;&#x8FDE;&#x7EED;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5C31;&#x50CF;&#x5728;&#x6D41;&#x6C34;&#x7EBF;&#x4E0A;&#x5DE5;&#x4F5C;&#x4E00;&#x6837;&#x3002;&#x5728;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x6808;&#x7684;&#x9876;&#x90E8;&#x7F16;&#x8BD1;&#x67E5;&#x8BE2;&#x8BED;&#x53E5;&#xFF0C;&#x5728;&#x4E2D;&#x90E8;&#x6267;&#x884C;&#x5B83;&#xFF0C;&#x5728;&#x5E95;&#x90E8;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x5B58;&#x50A8;&#x548C;&#x63A5;&#x53E3;&#x3002;</p>
<p><img src="img/image002.jpg" alt=""></p>
<p>&#x56FE;1-2 SQLite&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;</p>
<h2 id="&#x63A5;&#x53E3;interface">&#x63A5;&#x53E3;(Interface)</h2>
<p>&#x63A5;&#x53E3;&#x7531;SQLite C API&#x7EC4;&#x6210;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4E0D;&#x7BA1;&#x662F;&#x7A0B;&#x5E8F;&#x3001;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x8FD8;&#x662F;&#x5E93;&#x6587;&#x4EF6;&#xFF0C;&#x6700;&#x7EC8;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x5B83;&#x4E0E;SQLite&#x4EA4;&#x4E92;&#x7684;(&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;ODBC/JDBC&#x6700;&#x540E;&#x4E5F;&#x4F1A;&#x8F6C;&#x5316;&#x4E3A;&#x76F8;&#x5E94;C API&#x7684;&#x8C03;&#x7528;)&#x3002;</p>
<h2 id="&#x7F16;&#x8BD1;&#x5668;compiler">&#x7F16;&#x8BD1;&#x5668;(Compiler)</h2>
<p>&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4ECE;&#x5206;&#x8BCD;&#x5668;(Tokenizer)&#x548C;&#x5206;&#x6790;&#x5668;(Parser)&#x5F00;&#x59CB;&#x3002;&#x5B83;&#x4EEC;&#x534F;&#x4F5C;&#x5904;&#x7406;&#x6587;&#x672C;&#x5F62;&#x5F0F;&#x7684;&#x7ED3;&#x6784;&#x5316;&#x67E5;&#x8BE2;(Structured Query Language, SQL)&#x8BED;&#x53E5;&#xFF0C;&#x5206;&#x6790;&#x5176;&#x8BED;&#x6CD5;&#x6709;&#x6548;&#x6027;&#xFF0C;&#x8F6C;&#x5316;&#x4E3A;&#x5E95;&#x5C42;&#x80FD;&#x66F4;&#x65B9;&#x4FBF;&#x5904;&#x7406;&#x7684;&#x5C42;&#x6B21;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x2014;&#x2014;&#x8BED;&#x6CD5;&#x6811;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8BED;&#x6CD5;&#x6811;&#x4F20;&#x7ED9;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x5668;(code generator)&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;SQLite&#x5206;&#x8BCD;&#x5668;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x624B;&#x5DE5;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x5206;&#x6790;&#x5668;&#x4EE3;&#x7801;&#x662F;&#x7531;SQLite&#x5B9A;&#x5236;&#x7684;&#x5206;&#x6790;&#x5668;&#x751F;&#x6210;&#x5668;(&#x79F0;&#x4E3A;Lemon)&#x751F;&#x6210;&#x7684;&#x3002;The Lemon parser generator is designed for high performance and takes special precautions to guard against memory leaks. &#x4E00;&#x65E6;SQL&#x8BED;&#x53E5;&#x88AB;&#x5206;&#x89E3;&#x4E3A;&#x4E32;&#x503C;&#x5E76;&#x7EC4;&#x7EC7;&#x5230;&#x8BED;&#x6CD5;&#x6811;&#x4E2D;&#xFF0C;&#x5206;&#x6790;&#x5668;&#x5C31;&#x5C06;&#x8BE5;&#x6811;&#x4E0B;&#x4F20;&#x7ED9;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x5668;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x800C;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x5668;&#x6839;&#x636E;&#x5B83;&#x751F;&#x6210;&#x4E00;&#x79CD;SQLite&#x4E13;&#x7528;&#x7684;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#xFF0C;&#x6700;&#x540E;&#x7531;&#x865A;&#x62DF;&#x673A;(Virtual Machine)&#x6267;&#x884C;&#x3002;</p>
<h2 id="&#x865A;&#x62DF;&#x673A;virtual-machine">&#x865A;&#x62DF;&#x673A;(Virtual Machine)</h2>
<p>&#x67B6;&#x6784;&#x4E2D;&#x6700;&#x6838;&#x5FC3;&#x7684;&#x90E8;&#x5206;&#x662F;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x6216;&#x8005;&#x53EB;&#x505A;&#x865A;&#x62DF;&#x6570;&#x636E;&#x5E93;&#x5F15;&#x64CE;(Virtual DataBase Engine,VDBE)&#x3002;&#x5B83;&#x548C;Java&#x865A;&#x62DF;&#x673A;&#x76F8;&#x4F3C;&#xFF0C;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x5B57;&#x8282;&#x4EE3;&#x7801;&#x3002;VDBE&#x7684;&#x5B57;&#x8282;&#x4EE3;&#x7801;(&#x79F0;&#x4E3A;&#x865A;&#x62DF;&#x673A;&#x8BED;&#x8A00;)&#x7531;128&#x4E2A;&#x64CD;&#x4F5C;&#x7801;(opcodes)&#x6784;&#x6210;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#x3002;&#x5B83;&#x7684;&#x6BCF;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x6216;&#x8005;&#x7528;&#x6765;&#x5B8C;&#x6210;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;(&#x6BD4;&#x5982;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x8868;&#x7684;&#x6E38;&#x6807;&#x3001;&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7B49;)&#xFF0C;&#x6216;&#x8005;&#x4E3A;&#x5B8C;&#x6210;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x505A;&#x51C6;&#x5907;&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;SQL&#x547D;&#x4EE4;&#x7684;&#x8981;&#x6C42;&#x3002;VDBE&#x7684;&#x6307;&#x4EE4;&#x96C6;&#x80FD;&#x6EE1;&#x8DB3;&#x4EFB;&#x4F55;&#x590D;&#x6742;SQL&#x547D;&#x4EE4;&#x7684;&#x8981;&#x6C42;&#x3002;&#x6240;&#x6709;&#x7684;SQLite SQL&#x8BED;&#x53E5;&#x2014;&#x2014;&#x4ECE;&#x9009;&#x62E9;&#x548C;&#x4FEE;&#x6539;&#x8BB0;&#x5F55;&#x5230;&#x521B;&#x5EFA;&#x8868;&#x3001;&#x89C6;&#x56FE;&#x548C;&#x7D22;&#x5F15;&#x2014;&#x2014;&#x90FD;&#x662F;&#x9996;&#x5148;&#x7F16;&#x8BD1;&#x6210;&#x6B64;&#x79CD;&#x865A;&#x62DF;&#x673A;&#x8BED;&#x8A00;&#xFF0C;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B9A;&#x4E49;&#x5982;&#x4F55;&#x5B8C;&#x6210;&#x7ED9;&#x5B9A;&#x7684;&#x547D;&#x4EE4;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;SQLite&#x7684;CLP&#x4E2D;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x8BED;&#x53E5;&#xFF1A;</p>
<pre><code>sqlite&gt; .m col
sqlite&gt; .h on
sqlite&gt; .w 4 15 3 3 3 10 3
sqlite&gt; explain SELECT name FROM episodes LIMIT 10;
SQLite&#x4F1A;&#x663E;&#x793A;&#x7F16;&#x8BD1;&#x540E;&#x7684;VDBE&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#xFF0C;&#x5982;&#x5217;&#x8868;1-1&#x6240;&#x793A;&#x3002;
&#x5217;&#x8868;1-1 VDBE&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;
addr  opcode           p1   p2   p3   p4               p5    comment
----  ---------------  ---  ---  ---  ---------------  ----  ----------
0     Trace            0    0    0                     00
1     Integer          10   1    0                     00
2     MustBeInt        1    0    0                     00
3     IfZero           1    13   0                     00
4     Goto             0    14   0                     00
5     OpenRead         0    2    0    3                00
6     Rewind           0    12   0                     00
7     Column           0    2    2                     00
8     ResultRow        2    1    0                     00
9     AddImm           1    -1   0                     00
10    IfZero           1    12   0                     00
11    Next             0    7    0                     01
12    Close            0    0    0                     00
13    Halt             0    0    0                     00
14    Transaction      0    0    0                     00
15    VerifyCookie     0    40   0                     00
16    TableLock        0    2    0    episodes         00
17    Goto             0    5    0                     00
</code></pre><p>&#x7A0B;&#x5E8F;&#x7531;17&#x6761;&#x6307;&#x4EE4;&#x7EC4;&#x6210;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x7ED9;&#x5B9A;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x5B8C;&#x6210;&#x7279;&#x522B;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x5C06;&#x4F1A;&#x8FD4;&#x56DE;episodes&#x8868;&#x524D;10&#x4E2A;&#x8BB0;&#x5F55;&#x7684;name&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x3002;episodes&#x8868;&#x662F;&#x672C;&#x4E66;&#x793A;&#x4F8B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x4ECE;&#x591A;&#x4E2A;&#x65B9;&#x9762;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;VDBE&#x662F;SQLite&#x7684;&#x6838;&#x5FC3;&#xFF1A;&#x5B83;&#x4E0A;&#x9762;&#x7684;&#x5404;&#x6A21;&#x5757;&#x90FD;&#x662F;&#x7528;&#x4E8E;&#x521B;&#x5EFA;VDBE&#x7A0B;&#x5E8F;&#xFF0C;&#x5B83;&#x4E0B;&#x9762;&#x7684;&#x5404;&#x6A21;&#x5757;&#x90FD;&#x662F;&#x7528;&#x4E8E;&#x6267;&#x884C;VDBE&#x7A0B;&#x5E8F;&#xFF0C;&#x6BCF;&#x6B21;&#x6267;&#x884C;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x3002;</p>
<h2 id="&#x540E;&#x7AEF;backend">&#x540E;&#x7AEF;(Back-end)</h2>
<p>&#x540E;&#x7AEF;&#x7531;B-tree&#x3001;&#x9875;&#x7F13;&#x51B2;(page cache&#xFF0C;pager)&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x63A5;&#x53E3;(&#x5373;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;)&#x6784;&#x6210;&#x3002;B-tree&#x548C;page cache&#x5171;&#x540C;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#x3002;&#x5B83;&#x4EEC;&#x64CD;&#x4F5C;&#x7684;&#x662F;&#x6570;&#x636E;&#x5E93;&#x9875;&#xFF0C;&#x8FD9;&#x4E9B;&#x9875;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5C31;&#x50CF;&#x96C6;&#x88C5;&#x7BB1;&#x3002;&#x9875;&#x91CC;&#x9762;&#x7684;&#x201C;&#x8D27;&#x7269;&#x201D;&#x662F;&#x8868;&#x793A;&#x4FE1;&#x606F;&#x7684;&#x5927;&#x91CF;bit&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5305;&#x62EC;&#x8BB0;&#x5F55;&#x3001;&#x5B57;&#x6BB5;&#x548C;&#x7D22;&#x5F15;&#x5165;&#x53E3;&#x7B49;&#x3002;B-tree&#x548C;pager&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x4FE1;&#x606F;&#x7684;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#xFF0C;&#x5B83;&#x4EEC;&#x53EA;&#x8D1F;&#x8D23;&#x201C;&#x8FD0;&#x8F93;&#x201D;&#x8FD9;&#x4E9B;&#x9875;&#xFF0C;&#x9875;&#x4E0D;&#x5173;&#x5FC3;&#x8FD9;&#x4E9B;&#x201C;&#x96C6;&#x88C5;&#x7BB1;&#x201D;&#x91CC;&#x9762;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
<p>B-tree&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x5C31;&#x662F;&#x7D22;&#x5F15;&#xFF0C;&#x5B83;&#x7EF4;&#x62A4;&#x7740;&#x5404;&#x4E2A;&#x9875;&#x4E4B;&#x95F4;&#x7684;&#x590D;&#x6742;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4FBF;&#x4E8E;&#x5FEB;&#x901F;&#x627E;&#x5230;&#x6240;&#x9700;&#x6570;&#x636E;&#x3002;&#x5B83;&#x628A;&#x9875;&#x7EC4;&#x7EC7;&#x6210;&#x6811;&#x578B;&#x7684;&#x7ED3;&#x6784;(&#x8FD9;&#x662F;&#x5B83;&#x540D;&#x79F0;&#x7684;&#x7531;&#x6765;)&#xFF0C;&#x8FD9;&#x79CD;&#x6811;&#x662F;&#x4E3A;&#x67E5;&#x8BE2;&#x800C;&#x9AD8;&#x5EA6;&#x4F18;&#x5316;&#x4E86;&#x7684;&#x3002;Page&#x4E3A;B-tree&#x670D;&#x52A1;&#xFF0C;&#x4E3A;&#x5B83;&#x63D0;&#x4F9B;&#x9875;&#x3002;Pager&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x901A;&#x8FC7;OS&#x63A5;&#x53E3;&#x5728;B-tree&#x548C;&#x78C1;&#x76D8;&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x9875;&#x3002;&#x78C1;&#x76D8;&#x64CD;&#x4F5C;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6240;&#x5FC5;&#x987B;&#x505A;&#x7684;&#x6700;&#x6162;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6240;&#x4EE5;&#xFF0C;pager &#x5C3D;&#x529B;&#x63D0;&#x9AD8;&#x901F;&#x5EA6;&#xFF0C;&#x5176;&#x65B9;&#x6CD5;&#x662F;&#x628A;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x9875;&#x5B58;&#x653E;&#x5230;&#x5185;&#x5B58;&#x5F53;&#x4E2D;&#x7684;&#x9875;&#x7F13;&#x51B2;&#x533A;&#x91CC;&#xFF0C;&#x4ECE;&#x800C;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x64CD;&#x4F5C;&#x78C1;&#x76D8;&#x7684;&#x6B21;&#x6570;&#x3002;&#x5B83;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x7684;&#x7B97;&#x6CD5;&#x6765;&#x9884;&#x6D4B;&#x4E0B;&#x9762;&#x8981;&#x4F7F;&#x7528;&#x54EA;&#x4E9B;&#x9875;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;B-tree&#x80FD;&#x591F;&#x66F4;&#x5FEB;&#x5730;&#x5DE5;&#x4F5C;&#x3002;</p>
<h2 id="&#x5DE5;&#x5177;&#x548C;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;utilities-and-test-code">&#x5DE5;&#x5177;&#x548C;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;(Utilities and Test Code)</h2>
<p>&#x5DE5;&#x5177;&#x6A21;&#x5757;&#x4E2D;&#x5305;&#x542B;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5B9E;&#x7528;&#x529F;&#x80FD;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5982;&#x5185;&#x5B58;&#x5206;&#x914D;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x6BD4;&#x8F83;&#x3001;Unicode&#x8F6C;&#x6362;&#x4E4B;&#x7C7B;&#x7684;&#x516C;&#x5171;&#x670D;&#x52A1;&#x4E5F;&#x5728;&#x5DE5;&#x5177;&#x6A21;&#x5757;&#x4E2D;&#x3002;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5305;&#x7F57;&#x4E07;&#x8C61;&#x7684;&#x5DE5;&#x5177;&#x7BB1;&#xFF0C;&#x5F88;&#x591A;&#x5176;&#x5B83;&#x6A21;&#x5757;&#x90FD;&#x9700;&#x8981;&#x8C03;&#x7528;&#x548C;&#x5171;&#x4EAB;&#x5B83;&#x3002;</p>
<p>&#x6D4B;&#x8BD5;&#x6A21;&#x5757;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x65E0;&#x6570;&#x7684;&#x56DE;&#x5F52;&#x6D4B;&#x8BD5;&#x8BED;&#x53E5;&#xFF0C;&#x7528;&#x6765;&#x68C0;&#x67E5;&#x6570;&#x636E;&#x5E93;&#x4EE3;&#x7801;&#x7684;&#x6BCF;&#x4E2A;&#x7EC6;&#x5FAE;&#x89D2;&#x843D;&#x3002;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x662F;SQLite&#x6027;&#x80FD;&#x5982;&#x6B64;&#x53EF;&#x9760;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;</p>
<h2 id="sqlite-&#x7684;&#x7279;&#x8272;">SQLite &#x7684;&#x7279;&#x8272;</h2>
<p>&#x5C3D;&#x7BA1;SQLite&#x662F;&#x5982;&#x6B64;&#x4E4B;&#x5C0F;&#xFF0C;&#x5374;&#x63D0;&#x4F9B;&#x4E86;&#x5982;&#x6B64;&#x4E4B;&#x591A;&#x7684;&#x7279;&#x8272;&#x548C;&#x6027;&#x80FD;&#x3002;&#x5B83;&#x652F;&#x6301;ANSI SQL92&#x7684;&#x4E00;&#x4E2A;&#x5927;&#x5B50;&#x96C6;(&#x5305;&#x62EC;&#x4E8B;&#x52A1;&#x3001;&#x89C6;&#x56FE;&#x3001;&#x68C0;&#x67E5;&#x7EA6;&#x675F;&#x3001;&#x5173;&#x8054;&#x5B50;&#x67E5;&#x8BE2;&#x548C;&#x590D;&#x5408;&#x67E5;&#x8BE2;&#x7B49;)&#xFF0C;&#x8FD8;&#x652F;&#x6301;&#x5176;&#x5B83;&#x5F88;&#x591A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7279;&#x8272;&#xFF0C;&#x5982;&#x89E6;&#x53D1;&#x5668;&#x3001;&#x7D22;&#x5F15;&#x3001;&#x81EA;&#x52A8;&#x589E;&#x957F;&#x5B57;&#x6BB5;&#x548C;LIMIT/OFFSET&#x5B50;&#x53E5;&#x7B49;&#x3002;SQLite&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x72EC;&#x7279;&#x7684;&#x7279;&#x8272;&#xFF0C;&#x5982;&#x5185;&#x5728;&#x6570;&#x636E;&#x5E93;&#x3001;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x548C;&#x51B2;&#x7A81;&#x89E3;&#x51B3;(&#x4E0B;&#x9762;&#x89E3;&#x91CA;)&#x3002;</p>
<p>&#x5982;&#x672C;&#x7AE0;&#x5F00;&#x59CB;&#x65F6;&#x6240;&#x8FF0;&#xFF0C;&#x5728;SQLite&#x7684;&#x89C2;&#x5FF5;&#x548C;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x90FD;&#x9075;&#x5FAA;&#x7740;&#x4E00;&#x7CFB;&#x5217;&#x6307;&#x5BFC;&#x539F;&#x5219;&#x3002;&#x4E0B;&#x9762;&#x5C31;&#x6765;&#x8BE6;&#x8FF0;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#x3002;</p>
<h2 id="&#x96F6;&#x914D;&#x7F6E;">&#x96F6;&#x914D;&#x7F6E;</h2>
<p>&#x4ECE;SQLite&#x7684;&#x8BBE;&#x8BA1;&#x4E4B;&#x59CB;&#xFF0C;&#x5C31;&#x6CA1;&#x51C6;&#x5907;&#x5728;&#x5E94;&#x7528;&#x65F6;&#x4F7F;&#x7528;DBA&#x3002;&#x914D;&#x7F6E;&#x548C;&#x7BA1;&#x7406;SQLite&#x5C31;&#x50CF;&#x5F97;&#x5230;&#x5B83;&#x4E00;&#x6837;&#x7B80;&#x5355;&#x3002;SQLite&#x5305;&#x542B;&#x4E86;&#x6B63;&#x597D;&#x9002;&#x5408;&#x4E8E;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x8111;&#x7B4B;&#x7684;&#x7279;&#x8272;&#x3002;</p>
<h2 id="&#x517C;&#x5BB9;&#x6027;">&#x517C;&#x5BB9;&#x6027;</h2>
<p>SQLite&#x5728;&#x8BBE;&#x8BA1;&#x65F6;&#x7279;&#x522B;&#x6CE8;&#x610F;&#x4E86;&#x517C;&#x5BB9;&#x6027;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x7F16;&#x8BD1;&#x8FD0;&#x884C;&#x5728;Windows&#x3001;Linux&#x3001;BSD&#x3001;Mac OS X&#x53CA;&#x5546;&#x7528;&#x7684;Unix &#x7CFB;&#x7EDF;&#x5982;Solaris&#x3001;HPUX&#x548C;AIX&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x5F88;&#x591A;&#x5D4C;&#x5165;&#x5F0F;&#x5E73;&#x53F0;&#x5982;QNX&#x3001;VxWorks&#x3001;Symbian&#x3001;Palm OS&#x548C;Windows CE&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x65E0;&#x7F1D;&#x5730;&#x5DE5;&#x4F5C;&#x5728;16-bit&#x3001;32-bit&#x548C;64-bit&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4E2D;&#x5E76;&#x4E14;&#x80FD;&#x540C;&#x65F6;&#x9002;&#x5E94;&#x5B57;&#x8282;&#x7684;&#x5927;&#x7AEF;&#x683C;&#x5F0F;&#x548C;&#x5C0F;&#x7AEF;&#x683C;&#x5F0F;&#x3002;SQLite&#x7684;&#x517C;&#x5BB9;&#x6027;&#x5E76;&#x4E0D;&#x53EA;&#x8868;&#x73B0;&#x5728;&#x4EE3;&#x7801;&#x4E0A;&#xFF0C;&#x8FD8;&#x8868;&#x73B0;&#x5728;&#x5176;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x4E0A;&#x3002;SQLite&#x7684;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x5728;&#x5176;&#x6240;&#x652F;&#x6301;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x786C;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x548C;&#x5B57;&#x8282;&#x987A;&#x5E8F;&#x4E0A;&#x90FD;&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728;Sun SPARC&#x5DE5;&#x4F5C;&#x7AD9;&#x4E0A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;SQLite&#x6570;&#x636E;&#x5E93;&#x7136;&#x540E;&#x5728;Mac&#x6216;Windows&#x7684;&#x673A;&#x5668;&#x4E0A;&#x2014;&#x2014;&#x751A;&#x81F3;&#x79FB;&#x52A8;&#x7535;&#x8BDD;&#x4E0A;&#x2014;&#x2014;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x4EFB;&#x4F55;&#x8F6C;&#x6362;&#x548C;&#x4FEE;&#x6539;&#x3002;&#x6B64;&#x5916;&#xFF0C;SQLite&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x652F;&#x6491;2TB&#x7684;&#x6570;&#x636E;&#x91CF;(&#x53D7;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x9650;&#x5236;)&#xFF0C;&#x8FD8;&#x5185;&#x7F6E;&#x5730;&#x540C;&#x65F6;&#x652F;&#x6301;UTF-8&#x548C;UTF-16&#x7F16;&#x7801;&#x3002;</p>
<h2 id="&#x7D27;&#x51D1;&#x6027;">&#x7D27;&#x51D1;&#x6027;</h2>
<p>SQLite&#x7684;&#x8BBE;&#x8BA1;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x529F;&#x80FD;&#x9F50;&#x5168;&#x4F46;&#x4F53;&#x79EF;&#x5F88;&#x5C0F;&#xFF1A;1&#x4E2A;&#x5934;&#x6587;&#x4EF6;&#xFF0C;1&#x4E2A;&#x5E93;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6269;&#x5C55;&#x7684;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x3002;&#x6240;&#x6709;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5305;&#x62EC;&#x5BA2;&#x6237;&#x7AEF;&#x3001;&#x670D;&#x52A1;&#x5668;&#x548C;&#x865A;&#x62DF;&#x673A;&#x7B49;&#xFF0C;&#x90FD;&#x88AB;&#x6253;&#x5305;&#x5728;1/4&#x5146;&#x5927;&#x5C0F;&#x4E4B;&#x5185;&#x3002;&#x5982;&#x679C;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x53BB;&#x6389;&#x4E00;&#x4E9B;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x7A0B;&#x5E8F;&#x5E93;&#x53EF;&#x4EE5;&#x7F29;&#x5C0F;&#x81F3;170KB (&#x5728;x86&#x786C;&#x4EF6;&#x5E73;&#x53F0;&#x4E0A;&#x4F7F;&#x7528;GNU C&#x8FDB;&#x884C;&#x7F16;&#x8BD1;)&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;SQLite&#x7684;&#x79C1;&#x6709;&#x7248;&#x672C;&#xFF0C;&#x5927;&#x5C0F;&#x662F;69KB&#xFF0C;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5728;&#x667A;&#x80FD;&#x5361;&#x4E0A;(&#x53C2;&#x201C;&#x9644;&#x52A0;&#x4FE1;&#x606F;&#x201D;&#x4E00;&#x8282;)&#x3002;</p>
<p>&#x7A7A;&#x6CE8;&#xFF1A;&#x6211;&#x4E0B;&#x8F7D;&#x7684;DLL&#x6709;500&#x591A;KB&#x3002;</p>
<h2 id="&#x7B80;&#x5355;">&#x7B80;&#x5355;</h2>
<p>&#x4F5C;&#x4E3A;&#x7A0B;&#x5E8F;&#x5E93;&#xFF0C;SQLite&#x7684;API&#x53EF;&#x4EE5;&#x7B97;&#x662F;&#x6700;&#x7B80;&#x5355;&#x6700;&#x6613;&#x7528;&#x7684;&#x4E86;&#x3002;SQLite&#x65E2;&#x6709;&#x5F88;&#x597D;&#x7684;&#x6587;&#x6863;&#x53C8;&#x5F88;&#x5BB9;&#x6613;&#x671B;&#x6587;&#x77E5;&#x610F;&#x3002;</p>
<h2 id="&#x9002;&#x5E94;&#x6027;">&#x9002;&#x5E94;&#x6027;</h2>
<p>SQLite&#x7684;&#x51E0;&#x4E2A;&#x7279;&#x6027;&#x4F7F;&#x5176;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x9002;&#x5E94;&#x6027;&#x6781;&#x5F3A;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5185;&#x5D4C;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;SQLite&#x5728;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#x90FD;&#x505A;&#x5F97;&#x6700;&#x597D;&#xFF1A;&#x5F3A;&#x6709;&#x529B;&#x800C;&#x53EF;&#x4F38;&#x7F29;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x524D;&#x7AEF;&#xFF0C;&#x7B80;&#x5355;&#x800C;&#x7D27;&#x51D1;&#x7684;B-tree&#x540E;&#x7AEF;&#x3002;</p>
<h2 id="&#x4E0D;&#x53D7;&#x62D8;&#x675F;&#x7684;&#x6388;&#x6743;">&#x4E0D;&#x53D7;&#x62D8;&#x675F;&#x7684;&#x6388;&#x6743;</h2>
<p>SQLite&#x7684;&#x5168;&#x90E8;&#x4EE3;&#x7801;&#x90FD;&#x5728;&#x516C;&#x5171;&#x57DF;&#x4E2D;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6388;&#x6743;&#x3002;SQLite&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x90E8;&#x5206;&#x90FD;&#x6CA1;&#x6709;&#x9644;&#x52A0;&#x7248;&#x6743;&#x8981;&#x6C42;&#x3002;&#x6240;&#x6709;&#x66FE;&#x7ECF;&#x4E3A;SQLite&#x9879;&#x76EE;&#x8D21;&#x732E;&#x8FC7;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x90FD;&#x7B7E;&#x7F72;&#x8FC7;&#x4E00;&#x4E2A;&#x5BA3;&#x8A93;&#x4E66;&#x5C06;&#x4ED6;&#x4EEC;&#x7684;&#x8D21;&#x732E;&#x53D1;&#x5E03;&#x5230;&#x516C;&#x5171;&#x57DF;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x65E0;&#x8BBA;&#x4F60;&#x5982;&#x4F55;&#x4F7F;&#x7528;SQLite&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x4E0D;&#x4F1A;&#x6709;&#x6CD5;&#x5F8B;&#x65B9;&#x9762;&#x7684;&#x9650;&#x5236;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x3001;&#x5408;&#x5E76;&#x3001;&#x53D1;&#x5E03;&#x3001;&#x51FA;&#x552E;&#x6216;&#x5C06;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x7528;&#x4E8E;&#x4EFB;&#x4F55;&#x76EE;&#x7684;&#xFF0C;&#x5546;&#x4E1A;&#x548C;&#x4E2D;&#x975E;&#x5546;&#x4E1A;&#x7684;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x652F;&#x4ED8;&#x4EFB;&#x4F55;&#x8D39;&#x7528;&#xFF0C;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;&#x4EFB;&#x4F55;&#x9650;&#x5236;&#x3002;</p>
<h2 id="&#x53EF;&#x9760;&#x6027;">&#x53EF;&#x9760;&#x6027;</h2>
<p>SQLite&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x4E0D;&#x4F46;&#x514D;&#x8D39;&#xFF0C;&#x8FD8;&#x7F16;&#x5199;&#x5F97;&#x5F88;&#x597D;&#x3002;SQLite&#x6E90;&#x4EE3;&#x7801;&#x5305;&#x542B;&#x5927;&#x7EA6;30000&#x884C;&#x6807;&#x51C6;C&#x4EE3;&#x7801;&#xFF0C;&#x5B83;&#x662F;&#x5E72;&#x51C0;&#x7684;&#x3001;&#x6A21;&#x5757;&#x5316;&#x7684;&#x548C;&#x5B8C;&#x597D;&#x6CE8;&#x91CA;&#x7684;&#x3002;SQLite&#x6E90;&#x4EE3;&#x7801;&#x6613;&#x7406;&#x89E3;&#x3001;&#x6613;&#x5B9A;&#x5236;&#x3002;</p>
<p>SQLite&#x7684;&#x6838;&#x5FC3;&#x8F6F;&#x4EF6;(&#x5E93;&#x548C;&#x5DE5;&#x5177;)&#x7531;&#x7EA6;30000&#x884C;&#x4EE3;&#x7801;&#x7EC4;&#x6210;&#xFF0C;&#x4F46;&#x5206;&#x53D1;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x8FD8;&#x5305;&#x542B;&#x6709;&#x8D85;&#x8FC7;30000&#x884C;&#x7684;&#x56DE;&#x5F52;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#xFF0C;&#x5B83;&#x4EEC;&#x8986;&#x76D6;&#x4E86;97%&#x7684;&#x6838;&#x5FC3;&#x4EE3;&#x7801;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8D85;&#x8FC7;&#x4E00;&#x534A;&#x7684;SQLite&#x9879;&#x76EE;&#x4EE3;&#x7801;&#x662F;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x56DE;&#x5F52;&#x6D4B;&#x8BD5;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5DEE;&#x4E0D;&#x591A;&#x6BCF;&#x5199;&#x4E00;&#x884C;&#x529F;&#x80FD;&#x4EE3;&#x7801;&#xFF0C;&#x90FD;&#x8981;&#x5199;&#x4E00;&#x884C;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;</p>
<h2 id="&#x6613;&#x7528;&#x6027;">&#x6613;&#x7528;&#x6027;</h2>
<p>SQLite&#x8FD8;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x72EC;&#x7279;&#x7684;&#x529F;&#x80FD;&#x6765;&#x63D0;&#x9AD8;&#x6613;&#x7528;&#x6027;&#xFF0C;&#x5305;&#x62EC;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x3001;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x548C;&#x201C;&#x9644;&#x52A0;&#x201D;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5230;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<h2 id="&#x6027;&#x80FD;&#x548C;&#x9650;&#x5236;">&#x6027;&#x80FD;&#x548C;&#x9650;&#x5236;</h2>
<p>SQLite&#x662F;&#x4E00;&#x4E2A;&#x5FEB;&#x901F;&#x6570;&#x636E;&#x5E93;&#x3002;&#x4F46;&#x201C;&#x5FEB;&#x901F;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x672C;&#x8EAB;&#x662F;&#x4E00;&#x4E2A;&#x4E3B;&#x89C2;&#x7684;&#x548C;&#x4E0D;&#x660E;&#x786E;&#x7684;&#x8BCD;&#x3002;&#x8BDA;&#x5B9E;&#x5730;&#x8BB2;&#xFF0C;&#x6709;&#x4E9B;&#x4E8B;&#x60C5;SQLite&#x80FD;&#x6BD4;&#x5176;&#x5B83;&#x6570;&#x636E;&#x5E93;&#x505A;&#x5F97;&#x5FEB;&#xFF0C;&#x4E5F;&#x6709;&#x4E9B;&#x4E8B;&#x60C5;&#x4E0D;&#x80FD;&#x3002;&#x8FD9;&#x4E48;&#x8BF4;&#x5427;&#xFF0C;&#x5229;&#x7528;SQLite&#x63D0;&#x4F9B;&#x7684;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#xFF0C;SQLite&#x662F;&#x8DB3;&#x591F;&#x5FEB;&#x901F;&#x548C;&#x9AD8;&#x6548;&#x7684;&#x3002;&#x8DDF;&#x5927;&#x591A;&#x6570;&#x5176;&#x5B83;&#x6570;&#x636E;&#x5E93;&#x4E00;&#x6837;&#xFF0C;SQLite&#x4F7F;&#x7528;B-tree&#x5904;&#x7406;&#x7D22;&#x5F15;&#xFF0C;&#x4F7F;&#x7528;B+tree&#x5904;&#x7406;&#x8868;&#x6570;&#x636E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5BF9;&#x5355;&#x8868;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x65F6;&#xFF0C;SQLite&#x8981;&#x5FEB;&#x4E8E;(&#x6216;&#x81F3;&#x5C11;&#x76F8;&#x5F53;&#x4E8E;)&#x5176;&#x5B83;&#x6570;&#x636E;&#x5E93;&#x7684;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;SQLite&#x53EF;&#x80FD;&#x4E0D;&#x5982;&#x5927;&#x578B;&#x6570;&#x636E;&#x5E93;&#x5FEB;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x662F;&#x53EF;&#x7406;&#x89E3;&#x7684;&#x3002;SQLite&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x5D4C;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8BBE;&#x8BA1;&#x7528;&#x4E8E;&#x4E2D;&#x5C0F;&#x89C4;&#x6A21;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E9B;&#x9650;&#x5236;&#x662F;&#x7B26;&#x5408;&#x8BBE;&#x8BA1;&#x76EE;&#x7684;&#x7684;&#x3002;&#x5F88;&#x591A;&#x65B0;&#x7528;&#x6237;&#x9519;&#x8BEF;&#x5730;&#x5047;&#x8BBE;&#x4F7F;&#x7528;SQLite&#x53EF;&#x4EE5;&#x4EE3;&#x66FF;&#x5927;&#x578B;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8FD9;&#x6709;&#x65F6;&#x884C;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x4E0D;&#x884C;&#xFF0C;&#x4F9D;&#x8D56;&#x4E8E;&#x4F60;&#x51C6;&#x5907;&#x7528;SQLite&#x6765;&#x505A;&#x4EC0;&#x4E48;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;SQLite&#x5728;&#x4E09;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x65B9;&#x9762;&#x5177;&#x6709;&#x5C40;&#x9650;&#x6027;&#xFF1A;</p>
<ul>
<li><p>&#x5E76;&#x53D1;&#x3002;</p>
</li>
<li><p>&#x6570;&#x636E;&#x5E93;&#x5927;&#x5C0F;&#x3002;</p>
</li>
<li><p>&#x7F51;&#x7EDC;&#x3002;</p>
</li>
</ul>
<p>&#x5C3D;&#x7BA1;SQLite&#x505A;&#x5F97;&#x5DF2;&#x7ECF;&#x5F88;&#x597D;&#x4E86;&#xFF0C;&#x4F46;&#x4ECD;&#x6709;&#x90E8;&#x5206;&#x7279;&#x6027;&#x672A;&#x80FD;&#x5B9E;&#x73B0;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li><p>&#x5916;&#x952E;&#x7EA6;&#x675F;
&#x7A7A;&#x6CE8;&#xFF1A;SQLite&#x7684;&#x6700;&#x65B0;&#x7248;&#x672C;3.6.19&#x597D;&#x50CF;&#x5DF2;&#x7ECF;&#x652F;&#x6301;&#x4E86;&#x3002;</p>
</li>
<li><p>&#x5B8C;&#x6574;&#x7684;&#x89E6;&#x53D1;&#x5668;&#x652F;&#x6301;&#x3002;</p>
</li>
<li><p>&#x5B8C;&#x6574;&#x7684;ALTER TABLE&#x652F;&#x6301;&#x3002;</p>
</li>
<li><p>&#x4E8B;&#x52A1;&#x5D4C;&#x5957;&#x3002;</p>
</li>
<li><p>RIGHT&#x548C;FULL OUTER JOIN&#x3002;</p>
</li>
<li><p>&#x53EF;&#x4FEE;&#x6539;&#x89C6;&#x56FE;&#x3002;</p>
</li>
<li><p>GRANT&#x548C;REVOKE&#x3002;</p>
</li>
</ul>
<h2 id="&#x9644;&#x52A0;&#x4FE1;&#x606F;">&#x9644;&#x52A0;&#x4FE1;&#x606F;</h2>
<p>SQLite&#x7F51;&#x7AD9;&#x6709;&#x4E30;&#x5BCC;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x5B98;&#x65B9;&#x6587;&#x6863;&#x3001;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x3001;Wiki&#x548C;&#x5176;&#x5B83;&#x7684;&#x4E00;&#x822C;&#x4FE1;&#x606F;&#xFF0C;&#x5B83;&#x7684;&#x7F51;&#x5740;&#x662F;www.sqlite.org&#x3002;SQLite&#x793E;&#x533A;&#x4E5F;&#x662F;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4ECE;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x4E2D;&#x627E;&#x5230;&#x4EFB;&#x4F55;&#x4F60;&#x6240;&#x9700;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x53E6;&#x5916;&#xFF0C;SQLite&#x7684;&#x4F5C;&#x8005;&#x63D0;&#x4F9B;&#x4E86;SQLite&#x7684;&#x4E13;&#x4E1A;&#x57F9;&#x8BAD;&#x548C;&#x652F;&#x6301;&#xFF0C;&#x5305;&#x62EC;&#x5B9A;&#x5236;&#x7A0B;&#x5E8F;(&#x5982;&#x79FB;&#x690D;&#x5230;&#x5D4C;&#x5165;&#x5F0F;&#x5E73;&#x53F0;)&#x548C;&#x589E;&#x5F3A;&#x7684;SQLite&#x7248;&#x672C;&#xFF0C;&#x8FD9;&#x4E9B;&#x7248;&#x672C;&#x5305;&#x62EC;&#x5185;&#x7F6E;&#x4E86;&#x52A0;&#x5BC6;&#x529F;&#x80FD;&#x7684;&#x7248;&#x672C;&#x548C;&#x4E3A;&#x5D4C;&#x5165;&#x5F0F;&#x5E94;&#x7528;&#x4F18;&#x5316;&#x7684;&#x6781;&#x5C0F;&#x5316;&#x7248;&#x672C;&#x3002;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x4ECE;www.hwaci.com/sw/sqlite/prosupport.html&#x4E2D;&#x627E;&#x5230;&#x3002;</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="./2.html" class="navigation navigation-prev " aria-label="Previous page: 前言"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="./4.html" class="navigation navigation-next " aria-label="Next page: 第2章 入门"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-comment/plugin.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"comment":{"highlightCommented":true},"autocover":{},"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
