<!DOCTYPE HTML>
<html lang="zh-tw" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>第5章  设计和概念 | SQLite 权威指南</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        <meta name="author" content="wizardforcel">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-comment/plugin.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="./8.html" />
    
    
    <link rel="prev" href="./6.html" />
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="7"
        data-chapter-title="第5章  设计和概念"
        data-filepath="7.md"
        data-basepath="."
        data-revision="Tue May 17 2016 11:53:33 GMT+0000 (UTC)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
                
                <li>
                    <a href="https://www.gitbook.com/book/wizardforcel/the-definitive-guide-to-sqlite" target="blank" class="custom-link">SQLite 权威指南</a>
                </li>
            
            

            
            <li class="divider"></li>
            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        SQLite权威指南
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="1.html">
            
                
                    <a href="./1.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        推荐者的话
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="2.html">
            
                
                    <a href="./2.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        前言
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="3.html">
            
                
                    <a href="./3.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        第1章  SQLite介绍
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="4.html">
            
                
                    <a href="./4.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        第2章 入门
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="5.html">
            
                
                    <a href="./5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        第3章  关系模型
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="6.html">
            
                
                    <a href="./6.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        第4章  SQL
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="7" data-path="7.html">
            
                
                    <a href="./7.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        第5章  设计和概念
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="8.html">
            
                
                    <a href="./8.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        第6章  核心C API
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="9" data-path="9.html">
            
                
                    <a href="./9.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>9.</b>
                        
                        第7章  扩充C API
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="10" data-path="10.html">
            
                
                    <a href="./10.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>10.</b>
                        
                        第8章  语言扩展
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="11" data-path="11.html">
            
                
                    <a href="./11.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>11.</b>
                        
                        第9章  SQLite内核
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    本書使用 GitBook 釋出
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >SQLite 权威指南</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x7B2C;5&#x7AE0;--&#x8BBE;&#x8BA1;&#x548C;&#x6982;&#x5FF5;">&#x7B2C;5&#x7AE0;  &#x8BBE;&#x8BA1;&#x548C;&#x6982;&#x5FF5;</h1>
<p>&#x672C;&#x7AE0;&#x4E3A;&#x540E;&#x9762;&#x7684;3&#x7AE0;&#x6253;&#x4E0B;&#x57FA;&#x7840;&#xFF0C;&#x8FD9;&#x51E0;&#x7AE0;&#x4E13;&#x6CE8;&#x4E8E;SQLite&#x7F16;&#x7A0B;&#x3002;&#x8FD9;&#x51E0;&#x7AE0;&#x4E13;&#x6CE8;&#x4E8E;&#x4F5C;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5728;&#x7F16;&#x7801;&#x65F6;&#x4F60;&#x6240;&#x5E94;&#x8BE5;&#x4E86;&#x89E3;&#x7684;&#x6709;&#x5173;SQLite&#x7684;&#x4E1C;&#x897F;&#x3002;&#x65E0;&#x8BBA;&#x4F60;&#x662F;&#x7528;C&#x8BED;&#x8A00;&#x5BF9;SQLite&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#xFF0C;&#x8FD8;&#x662F;&#x7528;&#x5176;&#x5B83;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5B83;&#x4E0D;&#x4EC5;&#x5E2E;&#x52A9;&#x4F60;&#x4E86;&#x89E3;API&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x90E8;&#x5206;&#x6709;&#x5173;SQLite&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x548C;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5177;&#x5907;&#x4E86;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x7F16;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x5F97;&#x66F4;&#x5FEB;&#xFF0C;&#x4E14;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x6B7B;&#x9501;&#x3001;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#x9519;&#x8BEF;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x4F60;&#x4F1A;&#x770B;&#x5230;SQLite&#x5982;&#x4F55;&#x5904;&#x7406;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x8FD8;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x81EA;&#x4FE1;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x6B63;&#x524D;&#x8FDB;&#x5728;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x6B63;&#x786E;&#x65B9;&#x5411;&#x4E0A;&#x3002;</p>
<p>&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x5730;&#x8BFB;&#x5185;&#x90E8;&#x4EE3;&#x7801;&#x624D;&#x80FD;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#xFF0C;&#x4F60;&#x4E5F;&#x4E0D;&#x5FC5;&#x662F;&#x4E00;&#x4E2A;C&#x7A0B;&#x5E8F;&#x5458;&#x3002;SQLite&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x6982;&#x5FF5;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x76F4;&#x89C2;&#x548C;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x7684;&#x3002;&#x53EA;&#x6709;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x4F60;&#x9700;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x672C;&#x7AE0;&#x5C31;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x3002;</p>
<p>1&#xFF0E;&#x660E;&#x663E;&#x5730;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x77E5;&#x9053;API&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002;&#x4E8E;&#x662F;&#x672C;&#x7AE0;&#x4ECE;&#x4E00;&#x4E2A;&#x5BF9;API&#x6982;&#x5FF5;&#x6027;&#x7684;&#x4ECB;&#x7ECD;&#x5F00;&#x59CB;&#xFF0C;&#x56FE;&#x793A;&#x4E86;&#x4E3B;&#x8981;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;API&#x7684;&#x4E00;&#x822C;&#x8BBE;&#x8BA1;&#x548C;&#x5B83;&#x4E3B;&#x8981;&#x7684;&#x51FD;&#x6570;&#x3002;&#x8FD8;&#x53EF;&#x4EE5;&#x770B;&#x5230;SQLite&#x7684;&#x4E00;&#x4E9B;&#x4E3B;&#x8981;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B50;&#x7CFB;&#x7EDF;&#x5728;&#x67E5;&#x8BE2;&#x7684;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x4E2D;&#x8D77;&#x7740;&#x91CD;&#x8981;&#x4F5C;&#x7528;&#x3002;</p>
<p>2&#xFF0E;&#x9664;&#x4E86;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x51FD;&#x6570;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x8FD8;&#x9700;&#x8981;&#x4ECE;&#x6BD4;API&#x9AD8;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#x95EE;&#x9898;&#xFF0C;&#x770B;&#x770B;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x5728;&#x4E8B;&#x52A1;(transactions)&#x4E2D;&#x662F;&#x5982;&#x4F55;&#x64CD;&#x4F5C;&#x7684;&#x3002;SQLite&#x7684;&#x6240;&#x6709;&#x7684;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x5728;&#x4E8B;&#x52A1;&#x4E2D;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5728;API&#x4E4B;&#x4E0B;&#xFF0C;&#x4E8B;&#x52A1;&#x5982;&#x4F55;&#x6309;&#x7167;&#x9501;&#x7684;&#x7EA6;&#x675F;&#x6765;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x9501;&#x662F;&#x5982;&#x4F55;&#x64CD;&#x4F5C;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x9501;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x95EE;&#x9898;&#x3002;&#x5F53;&#x5BF9;&#x9501;&#x6709;&#x6240;&#x4E86;&#x89E3;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x6F5C;&#x5728;&#x7684;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F16;&#x7A0B;&#x63A7;&#x5236;&#x5B83;&#x4EEC;&#x6765;&#x4F18;&#x5316;&#x4F60;&#x7684;&#x67E5;&#x8BE2;&#x3002;</p>
<p>3&#xFF0E;&#x6700;&#x540E;&#xFF0C;&#x4F60;&#x8FD8;&#x5FC5;&#x987B;&#x7406;&#x89E3;&#x5982;&#x4F55;&#x5C06;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x5E94;&#x7528;&#x4E8E;&#x7F16;&#x7801;&#x3002;&#x672C;&#x7AE0;&#x7684;&#x6700;&#x540E;&#x90E8;&#x5206;&#x4F1A;&#x5C06;3&#x4E2A;&#x4E3B;&#x9898;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x2014;&#x2014;API&#x3001;&#x4E8B;&#x52A1;&#x548C;&#x9501;&#xFF0C;&#x5E76;&#x4E14;&#x770B;&#x4E00;&#x770B;&#x597D;&#x4EE3;&#x7801;&#x4E0E;&#x574F;&#x4EE3;&#x7801;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<p>&#x7A7A;&#x6CE8;&#xFF1A;&#x672C;&#x7AE0;&#x770B;&#x5F97;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x4ED4;&#x7EC6;&#x7684;&#xFF0C;&#x7FFB;&#x8BD1;&#x7684;&#x4E5F;&#x6BD4;&#x8F83;&#x5168;&#x3002;</p>
<h2 id="api">API</h2>
<p>&#x4ECE;&#x529F;&#x80FD;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x533A;&#x5206;&#xFF0C;SQLite&#x7684;API&#x53EF;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF1A;&#x6838;&#x5FC3;API&#x7684;&#x6269;&#x5145;API&#x3002;&#x6838;&#x5FC3;API&#x7531;&#x6240;&#x6709;&#x5B8C;&#x6210;&#x57FA;&#x672C;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#x7684;&#x51FD;&#x6570;&#x6784;&#x6210;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;&#x8FDE;&#x63A5;&#x6570;&#x636E;&#x5E93;&#x3001;&#x6267;&#x884C;SQL&#x548C;&#x904D;&#x5386;&#x7ED3;&#x679C;&#x96C6;&#x3002;&#x5B83;&#x8FD8;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#x51FD;&#x6570;&#xFF0C;&#x7528;&#x6765;&#x5B8C;&#x6210;&#x5B57;&#x7B26;&#x4E32;&#x683C;&#x5F0F;&#x5316;&#x3001;&#x64CD;&#x4F5C;&#x63A7;&#x5236;&#x3001;&#x8C03;&#x8BD5;&#x548C;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x7B49;&#x4EFB;&#x52A1;&#x3002;&#x6269;&#x5145;API&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x6269;&#x5C55;SQLite&#xFF0C;&#x5B83;&#x4F7F;&#x4F60;&#x80FD;&#x591F;&#x521B;&#x5EFA;&#x81EA;&#x5B9A;&#x4E49;&#x7684;SQL&#x6269;&#x5C55;&#xFF0C;&#x5E76;&#x4E0E;SQLite&#x672C;&#x8EAB;&#x7684;SQL&#x76F8;&#x96C6;&#x6210;&#x3002;</p>
<h2 id="sqlite&#x7248;&#x672C;3&#x7684;&#x65B0;&#x7279;&#x6027;">SQLite&#x7248;&#x672C;3&#x7684;&#x65B0;&#x7279;&#x6027;</h2>
<p>&#x5728;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;SQLite&#x7248;&#x672C;3&#x7684;&#x65B0;&#x7279;&#x8272;&#xFF1A;</p>
<p>&#x4E00;&#x3001;&#x9996;&#x5148;&#xFF0C;SQLite&#x7684;API&#x88AB;&#x5F7B;&#x5E95;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x4E86;&#xFF0C;&#x5E76;&#x5177;&#x6709;&#x4E86;&#x8BB8;&#x591A;&#x65B0;&#x7279;&#x6027;&#x3002;&#x7531;&#x7B2C;&#x4E8C;&#x7248;&#x7684;15&#x4E2A;&#x51FD;&#x6570;&#x589E;&#x52A0;&#x5230;88&#x4E2A;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x5305;&#x62EC;&#x652F;&#x6301;UTF-8&#x548C;UTF-16&#x7F16;&#x7801;&#x7684;&#x529F;&#x80FD;&#x51FD;&#x6570;&#x3002;SQLite3&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x65B9;&#x4FBF;&#x7684;&#x67E5;&#x8BE2;&#x6A21;&#x5F0F;&#xFF0C;&#x4F7F;&#x67E5;&#x8BE2;&#x7684;&#x9884;&#x5904;&#x7406;&#x66F4;&#x5BB9;&#x6613;&#x5E76;&#x4E14;&#x652F;&#x6301;&#x65B0;&#x7684;&#x53C2;&#x6570;&#x7ED1;&#x5B9A;&#x65B9;&#x6CD5;&#x3002;SQLite3&#x8FD8;&#x589E;&#x52A0;&#x4E86;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x6392;&#x5E8F;&#x5E8F;&#x5217;&#x3001;CHECK&#x7EA6;&#x675F;&#x3001;64&#x4F4D;&#x7684;&#x952E;&#x503C;&#x548C;&#x65B0;&#x7684;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x5728;&#x540E;&#x7AEF;&#x5927;&#x5927;&#x5730;&#x6539;&#x8FDB;&#x4E86;&#x5E76;&#x53D1;&#x6027;&#x80FD;&#x3002;&#x52A0;&#x9501;&#x5B50;&#x7CFB;&#x7EDF;&#x5F15;&#x8FDB;&#x4E86;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x9501;&#x5347;&#x7EA7;&#x6A21;&#x578B;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x7B2C;&#x4E8C;&#x7248;&#x4E2D;&#x7684;&#x5199;&#x8FDB;&#x7A0B;&#x997F;&#x6B7B;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x79CD;&#x6A21;&#x578B;&#x4FDD;&#x8BC1;&#x5199;&#x8FDB;&#x7A0B;&#x6309;&#x7167;&#x5148;&#x6765;&#x5148;&#x670D;&#x52A1;&#x7684;&#x7B97;&#x6CD5;&#x5F97;&#x5230;&#x6392;&#x5B83;&#x9501;(Exclusive Lock)&#x3002;&#x751A;&#x81F3;&#xFF0C;&#x5199;&#x8FDB;&#x7A0B;&#x901A;&#x8FC7;&#x628A;&#x7ED3;&#x679C;&#x5199;&#x5165;&#x4E34;&#x65F6;&#x7F13;&#x51B2;&#x533A;(Temporary Buffer)&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5F97;&#x5230;&#x6392;&#x5B83;&#x9501;&#x4E4B;&#x524D;&#x5C31;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x5199;&#x8981;&#x6C42;&#x8F83;&#x9AD8;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x6027;&#x80FD;&#x53EF;&#x63D0;&#x9AD8;400%&#x3002;</p>
<p>&#x4E09;&#x3001;SQLite 3&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6539;&#x8FDB;&#x4E86;&#x7684;B-tree&#x6A21;&#x578B;&#x3002;&#x73B0;&#x5728;&#x5BF9;&#x5E93;&#x8868;&#x4F7F;&#x7528;B+tree&#xFF0C;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#xFF0C;&#x5B58;&#x50A8;&#x5927;&#x6570;&#x636E;&#x5B57;&#x6BB5;&#x66F4;&#x6709;&#x6548;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x4ECE;&#x78C1;&#x76D8;&#x4E0A;&#x5220;&#x9664;&#x4E0D;&#x7528;&#x4E86;&#x7684;&#x5B57;&#x6BB5;&#x3002;&#x5176;&#x7ED3;&#x679C;&#x662F;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x7684;&#x4F53;&#x79EF;&#x51CF;&#x5C0F;&#x4E86;25&#x2013;35%&#x5E76;&#x6539;&#x5584;&#x4E86;&#x5168;&#x9762;&#x6027;&#x80FD;&#x3002;B+tree&#x5C06;&#x5728;&#x7B2C;9&#x7AE0;&#x4ECB;&#x7ECD;&#x3002;</p>
<p>&#x56DB;&#x3001;SQLite 3&#x6700;&#x91CD;&#x8981;&#x7684;&#x6539;&#x53D8;&#x662F;&#x5B83;&#x7684;&#x5B58;&#x50A8;&#x6A21;&#x578B;&#x3002;&#x7531;&#x7B2C;&#x4E8C;&#x7248;&#x53EA;&#x652F;&#x6301;&#x6587;&#x672C;&#x6A21;&#x578B;&#xFF0C;&#x6269;&#x5C55;&#x5230;&#x652F;&#x6301;5&#x79CD;&#x672C;&#x5730;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x5982;&#x7B2C;4&#x7AE0;&#x6240;&#x4ECB;&#x7ECD;&#x7684;&#xFF0C;&#x8FD8;&#x589E;&#x5F3A;&#x4E86;&#x5F31;&#x7C7B;&#x578B;&#x548C;&#x7C7B;&#x578B;&#x4EB2;&#x548C;&#x6027;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x90FD;&#x88AB;&#x4F18;&#x5316;&#xFF0C;&#x4EE5;&#x5F97;&#x5230;&#x66F4;&#x9AD8;&#x7684;&#x67E5;&#x8BE2;&#x6027;&#x80FD;&#x5E76;&#x6218;&#x7528;&#x66F4;&#x5C11;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6574;&#x6570;&#x548C;&#x6D6E;&#x70B9;&#x6570;&#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#xFF0C;&#x800C;&#x4E0D;&#x518D;&#x662F;&#x4EE5;ASCII&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x5C31;&#x4E0D;&#x5FC5;&#x518D;&#x5BF9;WHERE&#x5B50;&#x53E5;&#x4E2D;&#x7684;&#x503C;&#x8FDB;&#x884C;&#x8F6C;&#x6362;(&#x50CF;&#x7B2C;2&#x7248;&#x90A3;&#x6837;)&#x3002;&#x5F31;&#x7C7B;&#x578B;&#x4F7F;&#x4F60;&#x80FD;&#x591F;&#x5728;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x65F6;&#x9009;&#x62E9;&#x662F;&#x5426;&#x9884;&#x58F0;&#x660E;&#x7C7B;&#x578B;&#x3002;&#x4EB2;&#x548C;&#x6027;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x503C;&#x5B58;&#x50A8;&#x4E8E;&#x5B57;&#x6BB5;&#x7684;&#x683C;&#x5F0F;&#x2014;&#x2014;&#x57FA;&#x4E8E;&#x503C;&#x7684;&#x8868;&#x793A;&#x6CD5;&#x548C;&#x5217;&#x7684;&#x4EB2;&#x548C;&#x6027;&#x3002;&#x7C7B;&#x578B;&#x4EB2;&#x548C;&#x6027;&#x4E0E;&#x5F31;&#x7C7B;&#x578B;&#x7D27;&#x5BC6;&#x5173;&#x8054;&#x2014;&#x2014;&#x5217;&#x7684;&#x4EB2;&#x548C;&#x6027;&#x7531;&#x5176;&#x7C7B;&#x578B;&#x7684;&#x58F0;&#x660E;&#x786E;&#x5B9A;&#x3002;</p>
<p>&#x5728;&#x5F88;&#x591A;&#x65B9;&#x9762;&#xFF0C;SQLite 3&#x662F;&#x4E00;&#x4E2A;&#x4E0E;SQLite 2&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x5728;&#x9002;&#x5E94;&#x6027;&#x3001;&#x7279;&#x8272;&#x548C;&#x6027;&#x80FD;&#x65B9;&#x9762;&#x7684;&#x6539;&#x8FDB;&#x3002;</p>
<h2 id="&#x4E3B;&#x8981;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;">&#x4E3B;&#x8981;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;</h2>
<p>&#x5728;&#x7B2C;1&#x7AE0;&#x4F60;&#x770B;&#x5230;&#x4E86;&#x5F88;&#x591A;SQLite&#x7EC4;&#x4EF6;&#x2014;&#x2014;&#x5206;&#x8BCD;&#x5668;&#x3001;&#x5206;&#x6790;&#x5668;&#x548C;&#x865A;&#x62DF;&#x673A;&#x7B49;&#x7B49;&#x3002;&#x4F46;&#x662F;&#x4ECE;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x6700;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7684;&#x662F;&#xFF1A;connection&#x3001;statements&#x3001;B-tree&#x548C;pager&#x3002;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5982;&#x56FE;5-1&#x6240;&#x793A;&#x3002;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x6784;&#x6210;&#x4E86;&#x7F16;&#x5199;&#x4F18;&#x79C0;&#x4EE3;&#x7801;&#x6240;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x7684;3&#x4E2A;&#x9996;&#x8981;&#x5185;&#x5BB9;&#xFF1A;API&#x3001;&#x4E8B;&#x52A1;&#x548C;&#x9501;&#x3002;</p>
<p><img src="img/image007.jpg" alt=""></p>
<p>&#x56FE;5-1 SQLite C API&#x5BF9;&#x8C61;&#x6A21;&#x578B;</p>
<p>&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;B-tree&#x548C;pager&#x4E0D;&#x662F;API&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x5374;&#x5728;&#x4E8B;&#x52A1;&#x548C;&#x9501;&#x4E0A;&#x8D77;&#x7740;&#x5173;&#x952E;&#x4F5C;&#x7528;&#x3002;&#x8FD9;&#x91CC;&#x53EA;&#x4ECB;&#x7ECD;&#x5173;&#x8054;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8BE6;&#x7EC6;&#x5185;&#x5BB9;&#x5C06;&#x5728;&#x201C;&#x4E8B;&#x52A1;&#x201D;&#x4E00;&#x8282;&#x4ECB;&#x7ECD;&#x3002;</p>
<h3 id="&#x8FDE;&#x63A5;connection&#x548C;&#x8BED;&#x53E5;statement">&#x8FDE;&#x63A5;(Connection)&#x548C;&#x8BED;&#x53E5;(Statement)</h3>
<p>&#x8FDE;&#x63A5;(Connection)&#x548C;&#x8BED;&#x53E5;(Statement)&#x662F;&#x6267;&#x884C;SQL&#x547D;&#x4EE4;&#x6D89;&#x53CA;&#x7684;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x901A;&#x8FC7;API&#x8FDB;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x8981;&#x7528;&#x5230;&#x5B83;&#x4EEC;&#x3002;&#x8FDE;&#x63A5;&#x4EE3;&#x8868;&#x5728;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4E8B;&#x52A1;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x3002;&#x6BCF;&#x4E2A;&#x8BED;&#x53E5;&#x90FD;&#x548C;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x5173;&#x8054;&#xFF0C;&#x901A;&#x5E38;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x8FC7;&#x7684;SQL&#x8BED;&#x53E5;&#x3002;&#x5728;&#x5185;&#x90E8;&#xFF0C;&#x5B83;&#x4EE5;VDBE&#x5B57;&#x8282;&#x7801;&#x8868;&#x793A;&#x3002;&#x8BED;&#x53E5;&#x5305;&#x62EC;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x6240;&#x9700;&#x8981;&#x4E00;&#x5207;&#xFF0C;&#x5305;&#x62EC;&#x4FDD;&#x5B58;VDBE&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x72B6;&#x6001;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x6307;&#x5411;&#x786C;&#x76D8;&#x8BB0;&#x5F55;&#x7684;B-tree&#x6E38;&#x6807;&#xFF0C;&#x4EE5;&#x53CA;&#x53C2;&#x6570;&#x7B49;&#x7B49;&#x3002;</p>
<h3 id="btree&#x548C;pager">B-tree&#x548C;Pager</h3>
<p>&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;database&#x5BF9;&#x8C61;&#x2014;&#x2014;&#x4E00;&#x4E2A;&#x4E3B;&#x6570;&#x636E;&#x5E93;&#x548C;&#x9644;&#x52A0;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5BF9;&#x8C61;&#x6709;&#x4E00;&#x4E2A;B-tree&#x5BF9;&#x8C61;&#xFF0C;&#x4E00;&#x4E2A;B-tree&#x6709;&#x4E00;&#x4E2A;pager&#x5BF9;&#x8C61;(&#x8FD9;&#x91CC;&#x7684;&#x5BF9;&#x8C61;&#x4E0D;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x201C;&#x5BF9;&#x8C61;&#x201D;&#xFF0C;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x8BF4;&#x6E05;&#x695A;&#x95EE;&#x9898;)&#x3002;</p>
<p>&#x8BED;&#x53E5;&#x6700;&#x7EC8;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x8FDE;&#x63A5;&#x7684;B-tree&#x548C;pager&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x6216;&#x8005;&#x5199;&#x6570;&#x636E;&#xFF0C;&#x901A;&#x8FC7;B-tree&#x7684;&#x6E38;&#x6807;(cursor)&#x904D;&#x5386;&#x5B58;&#x50A8;&#x5728;&#x9875;(page)&#x4E2D;&#x7684;&#x8BB0;&#x5F55;&#x3002;&#x5728;&#x6E38;&#x6807;&#x8BBF;&#x95EE;&#x9875;&#x4E4B;&#x524D;&#xFF0C;&#x9875;&#x5FC5;&#x987B;&#x4ECE;&#x78C1;&#x76D8;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#xFF0C;&#x800C;&#x8FD9;&#x5C31;&#x662F;pager&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;B-tree&#x9700;&#x8981;&#x9875;&#xFF0C;&#x5B83;&#x90FD;&#x4F1A;&#x8BF7;&#x6C42;pager&#x4ECE;&#x78C1;&#x76D8;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;pager&#x628A;&#x9875;&#x52A0;&#x8F7D;&#x5230;&#x9875;&#x7F13;&#x51B2;&#x533A;(page cache)&#x3002;&#x4E4B;&#x540E;&#xFF0C;B-tree&#x548C;&#x4E0E;&#x4E4B;&#x5173;&#x8054;&#x7684;&#x6E38;&#x6807;&#x5C31;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x4F4D;&#x4E8E;&#x9875;&#x4E2D;&#x7684;&#x8BB0;&#x5F55;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6E38;&#x6807;&#x6539;&#x53D8;&#x4E86;&#x9875;&#xFF0C;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x4E8B;&#x52A1;&#x56DE;&#x6EDA;&#xFF0C;pager&#x5FC5;&#x987B;&#x91C7;&#x53D6;&#x7279;&#x6B8A;&#x7684;&#x65B9;&#x5F0F;&#x4FDD;&#x5B58;&#x539F;&#x6765;&#x7684;&#x9875;&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;pager&#x8D1F;&#x8D23;&#x8BFB;&#x5199;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#x7F13;&#x5B58;&#x548C;&#x9875;&#xFF0C;&#x4EE5;&#x53CA;&#x7BA1;&#x7406;&#x4E8B;&#x52A1;&#x3001;&#x9501;&#x548C;&#x5D29;&#x6E83;&#x6062;&#x590D;(&#x8FD9;&#x4E9B;&#x5728;&#x201C;&#x4E8B;&#x52A1;&#x201D;&#x4E00;&#x8282;&#x4F1A;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;)&#x3002;</p>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x5173;&#x4E8E;&#x8FDE;&#x63A5;&#x548C;&#x4E8B;&#x52A1;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x4E24;&#x4EF6;&#x4E8B;&#xFF1A;(1)&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x5B58;&#x5728;&#x4E8E;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E4B;&#x4E0B;&#x3002;(2)&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x7EDD;&#x4E0D;&#x4F1A;&#x540C;&#x65F6;&#x5B58;&#x5728;&#x4E8E;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x4E4B;&#x4E0B;&#x3002;&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x5728;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x505A;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x90FD;&#x603B;&#x662F;&#x5728;&#x6070;&#x597D;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E4B;&#x4E0B;&#xFF0C;&#x4E0D;&#x4F1A;&#x591A;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x5C11;&#x3002;</p>
<h2 id="&#x6838;&#x5FC3;api">&#x6838;&#x5FC3;API</h2>
<p>&#x6838;&#x5FC3;API&#x4E3B;&#x8981;&#x4E0E;&#x6267;&#x884C;SQL&#x547D;&#x4EE4;&#x6709;&#x5173;&#x3002;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x6267;&#x884C;SQL&#x8BED;&#x53E5;&#xFF1A;&#x9884;&#x7F16;&#x8BD1;&#x67E5;&#x8BE2;&#x548C;&#x5C01;&#x88C5;&#x67E5;&#x8BE2;&#x3002;&#x9884;&#x7F16;&#x8BD1;&#x67E5;&#x8BE2;&#x7531;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#x6784;&#x6210;&#xFF1A;&#x51C6;&#x5907;(preparation)&#x3001;&#x6267;&#x884C;(execution)&#x548C;&#x5B9A;&#x6848;(finalization)&#x3002;&#x5176;&#x5B9E;&#x5C01;&#x95ED;&#x88C5;&#x67E5;&#x8BE2;&#x53EA;&#x662F;&#x5BF9;&#x9884;&#x7F16;&#x8BD1;&#x67E5;&#x8BE2;&#x7684;&#x4E09;&#x4E2A;&#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x4E86;&#x5305;&#x88C5;&#x800C;&#x5DF2;&#xFF0C;&#x6700;&#x7EC8;&#x4E5F;&#x4F1A;&#x8F6C;&#x5316;&#x4E3A;&#x9884;&#x7F16;&#x8BD1;&#x67E5;&#x8BE2;&#x6765;&#x6267;&#x884C;&#x3002;</p>
<h3 id="&#x8FDE;&#x63A5;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;the-connection-lifecycle">&#x8FDE;&#x63A5;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;(The Connection Lifecycle)</h3>
<p>&#x548C;&#x5927;&#x591A;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x76F8;&#x540C;&#xFF0C;&#x5176;&#x751F;&#x547D;&#x5468;&#x671F;&#x7531;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#x6784;&#x6210;&#xFF1A;</p>
<p>1. &#x8FDE;&#x63A5;&#x6570;&#x636E;&#x5E93;(Connect to the database)&#x3002;</p>
<p>2. &#x5904;&#x7406;&#x4E8B;&#x52A1;(Perform transactions)&#xFF1A;&#x5982;&#x4F60;&#x6240;&#x77E5;&#xFF0C;&#x4EFB;&#x4F55;&#x547D;&#x4EE4;&#x90FD;&#x5728;&#x4E8B;&#x52A1;&#x4E0B;&#x6267;&#x884C;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E8B;&#x52A1;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6BCF;&#x4E00;&#x4E2A;SQL&#x8BED;&#x53E5;&#x90FD;&#x5728;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4E8B;&#x52A1;&#x4E0B;&#x8FD0;&#x884C;&#x3002;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;BEGIN..COMMIT&#x624B;&#x52A8;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x3002;</p>
<p>3. &#x65AD;&#x5F00;&#x8FDE;&#x63A5;(Disconnect from the database)&#xFF1A;&#x5173;&#x95ED;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x3002;&#x8FD8;&#x8981;&#x5173;&#x95ED;&#x6240;&#x6709;&#x9644;&#x52A0;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x5728;&#x67E5;&#x8BE2;&#x7684;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x4E2D;&#x8FD8;&#x5305;&#x62EC;&#x5176;&#x5B83;&#x4E00;&#x4E9B;&#x884C;&#x4E3A;&#xFF0C;&#x5982;&#x5904;&#x7406;&#x9519;&#x8BEF;&#x3001;&#x201C;&#x5FD9;&#x201D;&#x53E5;&#x67C4;&#x548C;schema&#x6539;&#x53D8;&#x7B49;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x5C06;&#x5728;utility functions&#x4E00;&#x8282;&#x4E2D;&#x4ECB;&#x7ECD;&#x3002;</p>
<p>&#x8FDE;&#x63A5;&#x6570;&#x636E;&#x5E93;(Connect to the database)&#xFF1A;</p>
<p>&#x8FDE;&#x63A5;&#x6570;&#x636E;&#x5E93;&#x4E0D;&#x53EA;&#x662F;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x6BCF;&#x4E2A;SQLite&#x6570;&#x636E;&#x5E93;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x5355;&#x72EC;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6587;&#x4EF6;&#x4E2D;&#x2014;&#x2014;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x6587;&#x4EF6;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x3002;&#x8FDE;&#x63A5;&#x3001;&#x6253;&#x5F00;&#x6570;&#x636E;&#x5E93;&#x7684;C API&#x4E3A;sqlite3_open()&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x6765;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x7684;&#x5B9E;&#x73B0;&#x4F4D;&#x4E8E;main.c&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
<p>SQLite&#x8FD8;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x5185;&#x5B58;&#x6570;&#x636E;&#x5E93;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;:memory:&#x6216;&#x4E00;&#x4E2A;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x505A;&#x6570;&#x636E;&#x5E93;&#x540D;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x5728;RAM&#x4E2D;&#x521B;&#x5EFA;&#x3002;&#x5185;&#x5B58;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x53EA;&#x80FD;&#x88AB;&#x521B;&#x5EFA;&#x5B83;&#x7684;&#x8FDE;&#x63A5;&#x6240;&#x5B58;&#x53D6;&#xFF0C;&#x4E0D;&#x80FD;&#x4E0E;&#x5176;&#x5B83;&#x8FDE;&#x63A5;&#x5171;&#x4EAB;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5185;&#x5B58;&#x6570;&#x636E;&#x5E93;&#x53EA;&#x80FD;&#x5B58;&#x6D3B;&#x4E8E;&#x8FDE;&#x63A5;&#x671F;&#x95F4;&#xFF0C;&#x4E00;&#x65E6;&#x8FDE;&#x63A5;&#x5173;&#x95ED;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5C31;&#x5C06;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x88AB;&#x5220;&#x9664;&#x3002;</p>
<p>&#x5F53;&#x8FDE;&#x63A5;&#x4E00;&#x4E2A;&#x4F4D;&#x4E8E;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x6253;&#x5F00;&#x8BE5;&#x6587;&#x4EF6;&#xFF1B;&#x5982;&#x679C;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;SQLite&#x4F1A;&#x5047;&#x5B9A;&#x4F60;&#x60F3;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;SQLite&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x4F60;&#x5411;&#x6570;&#x636E;&#x5E93;&#x5199;&#x5165;&#x6570;&#x636E;&#x65F6;&#x624D;&#x4F1A;&#x521B;&#x5EFA;&#x6587;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x521B;&#x5EFA;&#x8868;&#x3001;&#x89C6;&#x56FE;&#x6216;&#x8005;&#x5176;&#x5B83;&#x6570;&#x636E;&#x5E93;&#x5BF9;&#x8C61;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4E0D;&#x505A;&#x4EFB;&#x4F55;&#x4E8B;&#xFF0C;&#x7136;&#x540E;&#x5173;&#x95ED;&#x5B83;&#xFF0C;SQLite&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;0&#x7684;&#x7A7A;&#x6587;&#x4EF6;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4E0D;&#x7ACB;&#x5373;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x4EF6;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x7F16;&#x7801;&#xFF0C;&#x9875;&#x5927;&#x5C0F;&#x7B49;&#xFF0C;&#x53EA;&#x80FD;&#x5728;&#x6570;&#x636E;&#x5E93;&#x521B;&#x5EFA;&#x4E4B;&#x524D;&#x8BBE;&#x7F6E;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9875;&#x5927;&#x5C0F;&#x4E3A;1024&#x5B57;&#x8282;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;512-32768&#x5B57;&#x8282;&#x4E4B;&#x95F4;&#x4E3A; 2&#x5E42;&#x6570;&#x7684;&#x6570;&#x5B57;&#x3002;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x8F83;&#x5927;&#x7684;&#x9875;&#x80FD;&#x66F4;&#x6709;&#x6548;&#x5730;&#x5904;&#x7406;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;page_size pragma&#x6765;&#x8BBE;&#x7F6E;&#x6570;&#x636E;&#x5E93;&#x9875;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x5B57;&#x7B26;&#x7F16;&#x7801;&#x662F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x6C38;&#x4E45;&#x8BBE;&#x7F6E;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;encoding pragma&#x6765;&#x8BBE;&#x7F6E;&#x5B57;&#x7B26;&#x7F16;&#x7801;&#xFF0C;&#x5176;&#x503C;&#x53EF;&#x4EE5;&#x662F;UTF-8&#x3001;UTF-16&#x3001;UTF-16le (little endian)&#x548C;UTF-16be (big endian)&#x3002;</p>
<h3 id="&#x6267;&#x884C;&#x9884;&#x5904;&#x7406;&#x67E5;&#x8BE2;">&#x6267;&#x884C;&#x9884;&#x5904;&#x7406;&#x67E5;&#x8BE2;</h3>
<p>&#x524D;&#x9762;&#x63D0;&#x5230;&#xFF0C;&#x9884;&#x5904;&#x7406;&#x67E5;&#x8BE2;(Prepared Query)&#x662F;SQLite&#x6267;&#x884C;&#x6240;&#x6709;SQL&#x547D;&#x4EE4;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x6B65;&#x805A;&#xFF1A;</p>
<p>(1) &#x51C6;&#x5907;(preparation)&#xFF1A;</p>
<p>&#x5206;&#x8BCD;&#x5668;(tokenizer) &#x3001;&#x5206;&#x6790;&#x5668;(parser)&#x548C;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x5668;(code generator)&#x628A;SQL&#x8BED;&#x53E5;&#x7F16;&#x8BD1;&#x6210;VDBE&#x5B57;&#x8282;&#x7801;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x53E5;&#x67C4;(sqlite3_stmt)&#xFF0C;&#x5B83;&#x5305;&#x62EC;&#x5B57;&#x8282;&#x7801;&#x4EE5;&#x53CA;&#x5176;&#x5B83;&#x6267;&#x884C;&#x547D;&#x4EE4;&#x548C;&#x904D;&#x5386;&#x7ED3;&#x679C;&#x96C6;&#x6240;&#x9700;&#x7684;&#x5168;&#x90E8;&#x8D44;&#x6E90;&#x3002;&#x76F8;&#x5E94;&#x7684;C API&#x4E3A;sqlite3_prepare()&#xFF0C;&#x4F4D;&#x4E8E;prepare.c&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
<p>(2) &#x6267;&#x884C;(execution)&#xFF1A;</p>
<p>&#x865A;&#x62DF;&#x673A;&#x6267;&#x884C;&#x5B57;&#x8282;&#x7801;&#xFF0C;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x6B65;&#x8FDB;(stepwise)&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E00;&#x6B65;(step)&#x7531;sqlite3_step()&#x542F;&#x52A8;&#xFF0C;&#x5E76;&#x7531;VDBE&#x6267;&#x884C;&#x4E00;&#x6BB5;&#x5B57;&#x8282;&#x7801;&#x3002;&#x5F53;&#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528;sqlite3_step()&#x65F6;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x83B7;&#x5F97;&#x4E00;&#x79CD;&#x9501;&#xFF0C;&#x9501;&#x7684;&#x79CD;&#x7C7B;&#x7531;&#x547D;&#x4EE4;&#x8981;&#x505A;&#x4EC0;&#x4E48;(&#x8BFB;&#x6216;&#x5199;)&#x51B3;&#x5B9A;&#x3002;&#x5BF9;&#x4E8E;SELECT&#x8BED;&#x53E5;&#xFF0C;&#x6BCF;&#x6B21;&#x8C03;&#x7528;sqlite3_step()&#x4F7F;&#x7528;&#x8BED;&#x53E5;&#x53E5;&#x67C4;&#x7684;&#x6E38;&#x6807;&#x79FB;&#x5230;&#x7ED3;&#x679C;&#x96C6;&#x7684;&#x4E0B;&#x4E00;&#x884C;&#x3002;&#x5BF9;&#x4E8E;&#x7ED3;&#x679C;&#x96C6;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;SQLITE_ROW&#xFF0C;&#x5F53;&#x5230;&#x8FBE;&#x7ED3;&#x679C;&#x672B;&#x5C3E;&#x65F6;&#xFF0C;&#x8FD4;&#x56DE;SQLITE_DONE&#x3002;&#x5BF9;&#x4E8E;&#x5176;&#x5B83;SQL&#x8BED;&#x53E5;(INSERT&#x3001;UPDATE&#x3001;DELETE&#x7B49;)&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528;sqlite3_step()&#x5C31;&#x5BFC;&#x81F4;VDBE&#x6267;&#x884C;&#x6574;&#x4E2A;&#x547D;&#x4EE4;&#x3002;</p>
<p>(3) &#x5B9A;&#x6848;(finalization)&#xFF1A;</p>
<p>VDBE&#x5173;&#x95ED;&#x8BED;&#x53E5;&#xFF0C;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#x3002;&#x76F8;&#x5E94;&#x7684;C API&#x4E3A;sqlite3_finalize()&#xFF0C;&#x5B83;&#x5BFC;&#x81F4;VDBE&#x7ED3;&#x675F;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x5E76;&#x5173;&#x95ED;&#x8BED;&#x53E5;&#x53E5;&#x67C4;&#x3002;&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x662F;&#x7531;&#x4EBA;&#x5DE5;&#x63A7;&#x5236;&#x5F00;&#x59CB;&#x7684;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x7531;&#x4EBA;&#x5DE5;&#x63A7;&#x5236;&#x8FDB;&#x884C;&#x63D0;&#x4EA4;&#x6216;&#x56DE;&#x5377;&#xFF0C;&#x5426;&#x5219;sqlite3_finalize()&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x3002;&#x5F53;sqlite3_finalize()&#x6267;&#x884C;&#x6210;&#x529F;&#xFF0C;&#x6240;&#x6709;&#x4E0E;&#x8BED;&#x53E5;&#x5BF9;&#x8C61;&#x5173;&#x8054;&#x7684;&#x8D44;&#x6E90;&#x90FD;&#x5C06;&#x88AB;&#x91CA;&#x653E;&#x3002;&#x5728;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x8FD8;&#x4F1A;&#x91CA;&#x653E;&#x5173;&#x8054;&#x7684;&#x6570;&#x636E;&#x5E93;&#x9501;&#x3002;</p>
<p>&#x6BCF;&#x4E00;&#x6B65;(preparation&#x3001;execution&#x548C;finalization)&#x90FD;&#x5173;&#x8054;&#x4E8E;&#x8BED;&#x53E5;&#x53E5;&#x67C4;&#x7684;&#x4E00;&#x79CD;&#x72B6;&#x6001;(prepared&#x3001;active&#x548C;finalized)&#x3002;Pepared&#x8868;&#x793A;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x90FD;&#x5DF2;&#x5206;&#x914D;&#xFF0C;&#x8BED;&#x53E5;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x8FD8;&#x6CA1;&#x6709;&#x6267;&#x884C;&#x3002;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x7533;&#x8BF7;&#x9501;&#xFF0C;&#x4E00;&#x76F4;&#x5230;&#x8C03;&#x7528;sqlite3_step()&#x65F6;&#x624D;&#x4F1A;&#x7533;&#x8BF7;&#x9501;&#x3002;Active&#x72B6;&#x6001;&#x5F00;&#x59CB;&#x4E8E;&#x5BF9;sqlite3_step()&#x7684;&#x8C03;&#x7528;&#xFF0C;&#x6B64;&#x65F6;&#x8BED;&#x53E5;&#x6B63;&#x5728;&#x88AB;&#x6267;&#x884C;&#x5E76;&#x62E5;&#x6709;&#x67D0;&#x79CD;&#x9501;&#x3002;Finalized&#x610F;&#x5473;&#x7740;&#x8BED;&#x53E5;&#x5DF2;&#x7ECF;&#x88AB;&#x5173;&#x95ED;&#x4E14;&#x6240;&#x6709;&#x76F8;&#x5173;&#x8D44;&#x6E90;&#x5DF2;&#x7ECF;&#x88AB;&#x91CA;&#x653E;&#x3002;&#x901A;&#x8FC7;&#x56FE;5-2&#x53EF;&#x4EE5;&#x66F4;&#x5BB9;&#x6613;&#x5730;&#x7406;&#x89E3;&#x8BE5;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img src="img/image008.jpg" alt=""></p>
<p>&#x56FE;5-2 &#x8BED;&#x53E5;&#x5904;&#x7406;</p>
<p>&#x4E0B;&#x9762;&#x4EE3;&#x7801;&#x4F8B;&#x793A;&#x4E86;&#x5728;SQLite&#x4E0A;&#x6267;&#x884C;&#x4E00;&#x4E2A;query&#x7684;&#x4E00;&#x822C;&#x8FC7;&#x7A0B;&#x3002;</p>
<pre><code>#include&lt;stdio.h&gt;
#include&lt;stdlib.h&gt;
#include&quot;sqlite3.h&quot;
#include&lt;string.h&gt;
#pragma comment(lib, &quot;sqlite3.lib&quot;)
int main(int argc,char **argv)
{
       int rc,i,ncols;
       sqlite3 *db;
       sqlite3_stmt *stmt;
       char *sql;
       const char*tail;
       //&#x6253;&#x5F00;&#x6570;&#x636E;
       rc=sqlite3_open(&quot;foods.db&quot;,&amp;db);
       if(rc){
              fprintf(stderr,&quot;Can&apos;topendatabase:%sn&quot;,sqlite3_errmsg(db));
              sqlite3_close(db);
              exit(1);
       }
       sql=&quot;select * from episodes&quot;;
       //&#x9884;&#x5904;&#x7406;
       rc=sqlite3_prepare(db,sql,(int)strlen(sql),&amp;stmt,&amp;tail);
       if(rc!=SQLITE_OK){
              fprintf(stderr,&quot;SQLerror:%sn&quot;,sqlite3_errmsg(db));
       }
       rc=sqlite3_step(stmt);
       ncols=sqlite3_column_count(stmt);
       while(rc==SQLITE_ROW){
              for(i=0;i&lt;ncols;i++){
                     fprintf(stderr,&quot;&apos;%s&apos;&quot;,sqlite3_column_text(stmt,i));
              }
              fprintf(stderr,&quot;\n&quot;);
              rc=sqlite3_step(stmt);
       }
       //&#x91CA;&#x653E;statement
       sqlite3_finalize(stmt);
       //&#x5173;&#x95ED;&#x6570;&#x636E;&#x5E93;
       sqlite3_close(db);
       printf(&quot;\n&quot;);
       return(0);
}
</code></pre><p>&#x7A7A;&#x6CE8;&#xFF1A;</p>
<p>&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x5728;VC6++&#x4E0B;&#x8C03;&#x8BD5;&#x901A;&#x8FC7;&#xFF0C;&#x5176;&#x6B65;&#x9AA4;&#x4E3A;&#xFF1A;</p>
<p>&#x5C06;&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x505A;&#x6210;&#x4E00;&#x4E2A;.cpp&#x6587;&#x4EF6;&#x5E76;&#x4E3A;&#x5B83;&#x521B;&#x5EFA;&#x5DE5;&#x4F5C;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x5C06;sqlite3.def&#x548C;sqlite3.dll&#x6587;&#x4EF6;&#x590D;&#x5236;&#x5230;&#x5DE5;&#x4F5C;&#x7A7A;&#x95F4;&#x6240;&#x5728;&#x76EE;&#x5F55;&#x3002;(&#x8FD9;&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#x53EF;&#x7531;sqlitedll-3_6_18.zip&#x6587;&#x4EF6;&#x89E3;&#x538B;&#x800C;&#x5F97;)</p>
<p>&#x8FDB;&#x5165;DOS&#x547D;&#x4EE4;&#x884C;&#x72B6;&#x6001;&#xFF0C;&#x8FDB;&#x5165;&#x5DE5;&#x4F5C;&#x7A7A;&#x95F4;&#x6240;&#x5728;&#x76EE;&#x5F55;&#xFF0C;&#x6267;&#x884C;&#x5982;&#x4E0B;3&#x6761;&#x547D;&#x4EE4;&#xFF1A;</p>
<pre><code>PATH = D:\Program Files\Microsoft Visual Studio 9.0\VC\bin;%PATH%
PATH = D:\Program Files\Microsoft Visual Studio 9.0\Common7\IDE;%PATH%
LIB /DEF:sqlite3.def /machine:IX86
</code></pre><p>&#x6CE8;&#xFF1A;&#x4E0A;&#x8FF0;&#x547D;&#x4EE4;&#x7528;&#x4E8E;&#x5236;&#x4F5C;.lib&#x6587;&#x4EF6;&#xFF0C;&#x7528;&#x4E8E;&#x9879;&#x76EE;&#x7684;&#x94FE;&#x63A5;&#x3002;&#x5982;&#x679C;PATH&#x5DF2;&#x7ECF;&#x8BBE;&#x597D;&#xFF0C;&#x524D;&#x4E24;&#x6761;&#x547D;&#x4EE4;&#x53EF;&#x80FD;&#x4E0D;&#x9700;&#x8981;&#x6267;&#x884C;&#xFF1B;&#x5982;&#x679C;&#x6267;&#x884C;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x6839;&#x636E;VC&#x7684;&#x5B89;&#x88C5;&#x60C5;&#x51B5;&#x6709;&#x6240;&#x6539;&#x52A8;&#x3002;</p>
<p>&#x4E34;&#x65F6;&#x5B58;&#x50A8;&#x5668;&#xFF1A;</p>
<p>&#x4E34;&#x65F6;&#x5B58;&#x50A8;&#x5668;&#x662F;&#x67E5;&#x8BE2;&#x5904;&#x7406;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;SQLite&#x6709;&#x65F6;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x547D;&#x4EE4;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x4EA7;&#x751F;&#x7684;&#x4E2D;&#x95F4;&#x7ED3;&#x679C;&#x2014;&#x2014;&#x5982;&#x7ED3;&#x679C;&#x96C6;&#x7531;ORDER BY&#x5B50;&#x53E5;&#x6307;&#x5B9A;&#x9700;&#x8981;&#x6392;&#x5E8F;&#xFF0C;&#x6216;&#x8FDB;&#x884C;&#x591A;&#x8868;&#x4EA4;&#x53C9;&#x67E5;&#x8BE2;&#x65F6;&#x3002;&#x4E2D;&#x95F4;&#x7ED3;&#x679C;&#x5B58;&#x50A8;&#x5728;&#x4E34;&#x65F6;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x3002;&#x4E34;&#x65F6;&#x5B58;&#x50A8;&#x5668;&#x6216;&#x8005;&#x5728;&#x5185;&#x5B58;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
<h3 id="&#x4F7F;&#x7528;&#x53C2;&#x6570;&#x5316;&#x7684;sql">&#x4F7F;&#x7528;&#x53C2;&#x6570;&#x5316;&#x7684;SQL</h3>
<p>SQL&#x8BED;&#x53E5;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x53C2;&#x6570;&#x3002;&#x53C2;&#x6570;&#x662F;SQL&#x547D;&#x4EE4;&#x4E2D;&#x7684;&#x5360;&#x4F4D;&#x7B26;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x503C;&#x4F1A;&#x5728;&#x7F16;&#x8BD1;&#x4E4B;&#x540E;&#x63D0;&#x4F9B;(&#x79F0;&#x4E3A;&#x201C;&#x7ED1;&#x5B9A;&#x201D;)&#x3002;&#x4E0B;&#x9762;&#x662F;&#x5E26;&#x53C2;&#x6570;&#x7684;SQL&#x793A;&#x4F8B;&#x8BED;&#x53E5;&#xFF1A;</p>
<pre><code>INSERT INTO foods (id, name) VALUES (?,?);
INSERT INTO episodes (id, name) (:id, :name);
</code></pre><p>&#x4E0A;&#x8FF0;&#x8BED;&#x53E5;&#x8868;&#x73B0;&#x4E86;&#x53C2;&#x6570;&#x7684;&#x4E24;&#x79CD;&#x7ED1;&#x5B9A;&#x65B9;&#x5F0F;&#xFF1A;&#x6309;&#x4F4D;&#x7F6E;&#x548C;&#x6309;&#x540D;&#x79F0;&#x3002;&#x7B2C;1&#x6761;&#x547D;&#x4EE4;&#x91C7;&#x7528;&#x4E86;&#x4F4D;&#x7F6E;&#x53C2;&#x6570;&#xFF0C;&#x7B2C;2&#x6761;&#x547D;&#x4EE4;&#x91C7;&#x7528;&#x4E86;&#x540D;&#x79F0;&#x53C2;&#x6570;&#x3002;</p>
<p>Positional parameters are defined by the position of the question mark in the statement. The first question mark has position 1, the second 2, and so on. Named parameters use actual variable names, which are prefixed with a colon. When sqlite3_prepare() compiles a statement with parameters, it allocates placeholders for the parameters in the resulting statement handle. It then expects values to be provided for these parameters before the statement is</p>
<p>executed. &#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x4E3A;&#x53C2;&#x6570;&#x7ED1;&#x5B9A;&#x503C;&#xFF0C;&#x5728;&#x8BED;&#x53E5;&#x6267;&#x884C;&#x65F6;&#xFF0C;SQLite &#x9ED8;&#x8BA4;&#x4E3A;&#x5404;&#x53C2;&#x6570;&#x8D4B;NULL&#x503C;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x53C2;&#x6570;&#x7ED1;&#x5B9A;&#x7684;&#x597D;&#x5904;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x591A;&#x6B21;&#x6267;&#x884C;&#x76F8;&#x540C;&#x7684;&#x8BED;&#x53E5;&#x800C;&#x4E0D;&#x5FC5;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x5B83;&#x4EEC;&#x3002;You just reset the statement, bind a new set of values, and reexecute. This is where resetting rather than finalizing a statement comes in handy: it avoids the overhead of SQL compilation. By resetting a statement, you are reusing the compiled SQL code. You completely avoid the tokenizing, parsing, and code generation overhead. Resetting a statement is implemented in the API by the sqlite3_reset() function.</p>
<p>&#x4F7F;&#x7528;&#x53C2;&#x6570;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x662F;&#xFF1A;SQLite&#x53EF;&#x4EE5;&#x5BF9;&#x4F60;&#x7ED1;&#x5B9A;&#x5230;&#x53C2;&#x6570;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x505A;&#x4E00;&#x5B9A;&#x7684;&#x5904;&#x7406;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x503C;&apos;Kenny&apos;s Chicken&apos;&#xFF0C;&#x53C2;&#x6570;&#x7ED1;&#x5B9A;&#x8FC7;&#x7A0B;&#x4F1A;&#x81EA;&#x52A8;&#x5730;&#x5C06;&#x5176;&#x8F6C;&#x5316;&#x4E3A;&apos;Kenny&apos;&apos;s Chicken&apos;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4F2A;&#x4EE3;&#x7801;&#x8BF4;&#x660E;&#x4E86;&#x7ED1;&#x5B9A;&#x53C2;&#x6570;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#xFF1A;</p>
<pre><code>db = open(&apos;foods.db&apos;)
stmt = db.prepare(&apos;INSERT INTO episodes (id, name) VALUES (:id, :name)&apos;)
stmt.bind(&apos;id&apos;, &apos;1&apos;)
stmt.bind(&apos;name&apos;, &apos;Soup Nazi&apos;)
stmt.step()
# Reset and use again
stmt.reset()
stmt.bind(&apos;id&apos;, &apos;2&apos;)
stmt.bind(&apos;name&apos;, &apos;The Junior Mint&apos;)
# Done
stmt.finalize()
db.close()
</code></pre><h3 id="&#x6267;&#x884C;&#x5C01;&#x88C5;&#x7684;query">&#x6267;&#x884C;&#x5C01;&#x88C5;&#x7684;Query</h3>
<p>&#x5982;&#x524D;&#x6587;&#x6240;&#x8FF0;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x5F88;&#x6709;&#x7528;&#x7684;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x5C01;&#x88C5;&#x67E5;&#x8BE2;&#x7684;&#x9884;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#xFF0C;&#x5141;&#x8BB8;&#x4F60;&#x5728;&#x5355;&#x4E00;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4E2D;&#x6267;&#x884C;SQL&#x547D;&#x4EE4;&#x3002;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x662F;sqlite3_exec()&#xFF0C;&#x7279;&#x522B;&#x9002;&#x5408;&#x6267;&#x884C;&#x4E0D;&#x9700;&#x8981;&#x8FD4;&#x56DE;&#x6570;&#x636E;&#x7684;&#x67E5;&#x8BE2;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x662F;sqlite3_get_table()&#xFF0C;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x8868;&#x683C;&#x5316;&#x7684;&#x7ED3;&#x679C;&#x96C6;&#x3002;In many language extensions you will see analogs to both functions. Most extensions refer to the first method simply as exec(), and the second as just get_table().</p>
<p>sqlite3_get_table()&#x7684;&#x51FD;&#x6570;&#x540D;&#x8D77;&#x5F97;&#x4E0D;&#x592A;&#x5408;&#x9002;&#xFF0C;&#x542C;&#x8D77;&#x6765;&#x597D;&#x8C61;&#x662F;&#x8981;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x8868;&#x7684;&#x5168;&#x90E8;&#x6570;&#x636E;&#x3002;&#x5176;&#x5B9E;&#x5B83;&#x7684;&#x547D;&#x540D;&#x53EA;&#x662F;&#x8868;&#x793A;&#x5C06;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x8868;&#x683C;&#x5316;&#x7684;&#x7ED3;&#x679C;&#x96C6;&#x3002;</p>
<pre><code>db = open(&apos;foods.db&apos;)
table = db.get_table(&quot;SELECT * FROM episodes LIMIT 10&quot;)
for i=0; i &lt; table.rows; i++
  for j=0; j &lt; table.cols; j++
    print table[i][j]
  end
end
db.close()
</code></pre><h3 id="&#x9519;&#x8BEF;&#x5904;&#x7406;">&#x9519;&#x8BEF;&#x5904;&#x7406;</h3>
<p>&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x90FD;&#x662F;&#x6781;&#x5EA6;&#x7B80;&#x5316;&#x4E86;&#x7684;&#xFF0C;&#x53EA;&#x5173;&#x6CE8;&#x67E5;&#x8BE2;&#x7684;&#x6267;&#x884C;&#x3002;&#x800C;&#x5728;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x603B;&#x5F97;&#x5173;&#x6CE8;&#x51FA;&#x9519;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x4F60;&#x524D;&#x9762;&#x6240;&#x770B;&#x5230;&#x7684;&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x53EF;&#x80FD;&#x5F15;&#x53D1;&#x9519;&#x8BEF;&#x3002;&#x901A;&#x5E38;&#x4F60;&#x9700;&#x8981;&#x5BF9;&#x9519;&#x8BEF;&#x4EE3;&#x7801;SQLITE_ERROR&#x3001;SQLITE_BUSY&#x548C;SQLITE_SCHEMA&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;SQLITE_BUSY&#x5728;&#x5F53;&#x524D;&#x8FDE;&#x63A5;&#x4E0D;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x9501;&#x65F6;&#x89E6;&#x53D1;&#xFF0C;SQLITE_SCHEMA&#x5728;&#x8BED;&#x53E5;&#x7684;&#x7F16;&#x8BD1;&#x4E0E;&#x6267;&#x884C;&#x4E4B;&#x95F4;schema&#x53D1;&#x751F;&#x4E86;&#x6539;&#x53D8;&#x65F6;&#x89E6;&#x53D1;&#x3002;&#x201C;&#x5FD9;&#x201D;&#x72B6;&#x6001;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x7684;&#x4E8B;&#x52A1;&#x4E00;&#x8282;&#x4E2D;&#x4ECB;&#x7ECD;&#x3002;Schema&#x9519;&#x8BEF;&#x5C06;&#x5728;&#x7B2C;6&#x7AE0;&#x4ECB;&#x7ECD;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x6269;&#x5C55;&#x96BE;&#x4E8E;&#x5904;&#x7406;schema&#x9519;&#x8BEF;&#x3002;&#x6709;&#x4E9B;&#x900F;&#x660E;&#x5730;&#x62A5;&#x544A;&#x5904;&#x4E8E;&#x5FD9;&#x72B6;&#x6001;&#xFF0C;&#x6709;&#x4E9B;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x5B9E;&#x9645;&#x7684;&#x9519;&#x8BEF;&#x4EE3;&#x7801;&#x3002;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x9047;&#x5230;&#x4E86;schema&#x9519;&#x8BEF;&#xFF0C;&#x8868;&#x793A;&#x6709;&#x5176;&#x5B83;&#x7684;&#x8FDE;&#x63A5;&#x5728;&#x4F60;&#x7684;&#x8BFB;&#x4E0E;&#x5199;&#x4E4B;&#x95F4;&#x6539;&#x53D8;&#x4E86;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4F60;&#x7684;&#x8BED;&#x53E5;&#x5DF2;&#x4E0D;&#x518D;&#x5408;&#x6CD5;&#x3002;&#x4F60;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x8BED;&#x53E5;&#xFF0C;&#x4EE5;&#x4FBF;&#x80FD;&#x591F;&#x91CD;&#x65B0;&#x6267;&#x884C;&#x5B83;&#x3002;Schema&#x9519;&#x8BEF;&#x53EA;&#x4F1A;&#x53D1;&#x751F;&#x5728;&#x5BF9;prepare()&#x7684;&#x8C03;&#x7528;&#x548C;&#x7B2C;1&#x6B21;&#x5BF9;step()&#x7684;&#x8C03;&#x7528;&#x4E4B;&#x95F4;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7B2C;1&#x6B21;step()&#x8C03;&#x7528;&#x6210;&#x529F;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x4E0D;&#x5FC5;&#x518D;&#x62C5;&#x5FC3;&#x5728;&#x540E;&#x9762;&#x8C03;&#x7528;step()&#x65F6;&#x4F1A;&#x5F15;&#x53D1;schema&#x9519;&#x8BEF;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x7684;&#x8FDE;&#x63A5;&#x5DF2;&#x7ECF;&#x9501;&#x4F4F;&#x4E86;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5176;&#x5B83;&#x7684;&#x8FDE;&#x63A5;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x6B64;&#x671F;&#x95F4;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x822C;&#x6027;&#x9519;&#x8BEF;&#xFF0C;API&#x63D0;&#x4F9B;&#x4E86;sqlite3_errcode()&#x6765;&#x83B7;&#x53D6;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x8C03;&#x7528;API&#x51FD;&#x6570;&#x65F6;&#x7684;&#x8FD4;&#x56DE;&#x7801;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;sqlite3_errmsg()&#x51FD;&#x6570;&#x5F97;&#x5230;&#x66F4;&#x5177;&#x4F53;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;&#x6700;&#x540E;&#x9519;&#x8BEF;&#x7684;&#x6587;&#x5B57;&#x63CF;&#x8FF0;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x6269;&#x5C55;&#x90FD;&#x652F;&#x6301;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x89C2;&#x5FF5;&#xFF0C;&#x524D;&#x9762;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x8C03;&#x7528;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x7C7B;&#x4F3C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x68C0;&#x67E5;&#x9519;&#x8BEF;&#xFF1A;</p>
<pre><code># Check and report errors
if db.errcode() != SQLITE_OK
  print db.errmsg(stmt)
end
</code></pre><p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x5E76;&#x4E0D;&#x56F0;&#x96BE;&#x3002;&#x5904;&#x7406;&#x9519;&#x8BEF;&#x7684;&#x65B9;&#x6CD5;&#x7531;&#x4F60;&#x786E;&#x5207;&#x5730;&#x60F3;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x51B3;&#x5B9A;&#x3002;</p>
<h3 id="&#x683C;&#x5F0F;&#x5316;sql&#x8BED;&#x53E5;">&#x683C;&#x5F0F;&#x5316;SQL&#x8BED;&#x53E5;</h3>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x65B9;&#x4FBF;&#x7684;&#x51FD;&#x6570;&#x662F;sqlite3_mprintf()&#xFF0C;&#x5B83;&#x662F;&#x6807;&#x51C6;C&#x5E93;&#x51FD;&#x6570;sprintf()&#x7684;&#x4E00;&#x4E2A;&#x53D8;&#x4F53;&#x3002;&#x5B83;&#x6709;&#x5F88;&#x72EC;&#x7279;&#x7684;&#x66FF;&#x6362;&#x7B26;&#xFF0C;&#x7279;&#x522B;&#x65B9;&#x4FBF;&#x5BF9;SQL&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x5B83;&#x7684;&#x66FF;&#x6362;&#x7B26;&#x662F;%q&#x548C;%Q&#x3002;%q&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x50CF;%s&#xFF0C;&#x4ECE;&#x53C2;&#x6570;&#x5217;&#x8868;&#x4E2D;&#x53D6;&#x5F97;&#x4E00;&#x4E2A;&#x4EE5;NULL&#x7ED3;&#x675F;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5B83;&#x4F1A;&#x5C06;&#x5355;&#x5F15;&#x53F7;&#x53CD;&#x659C;&#x6760;&#x90FD;&#x53CC;&#x5199;&#xFF0C;&#x4F7F;&#x4F60;&#x66F4;&#x5BB9;&#x6613;&#x9632;&#x8303;SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;(&#x53C2;&#x672C;&#x8282;&#x4E0B;&#x6587;&#x7684;&#x201C;SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#x201D;&#x4E00;&#x6BB5;)&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>char* before = &quot;Hey, at least %q no pig-man.&quot;;
char* after = sqlite3_mprintf(before, &quot;\he&apos;s\&quot;);
</code></pre><p>&#x4E0A;&#x8FF0;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x540E;after&#x7684;&#x503C;&#x4E3A;&apos;Hey, at least \he&apos;&apos;s\ no pig-man&apos;&#x3002;The single quote in he&#x2019;s is doubled along with the backslashes around it, making it acceptable as a string literal in a SQL statement. The %Q formatting does everything %qdoes, but it additionally encloses the resulting string in single quotes. Furthermore, if the argument for %Q is a NULL pointer (in C), it produces the string NULL without single quotes. For more information, see the sqlite3_mprintf() documentation in the C API reference in Appendix B.</p>
<p>SQL&#x6CE8;&#x5165;&#x5F0F;&#x653B;&#x51FB;&#xFF1A;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F9D;&#x8D56;&#x7528;&#x6237;&#x7684;&#x8F93;&#x5165;&#x6765;&#x6784;&#x9020;SQL&#x8BED;&#x53E5;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C06;&#x5F88;&#x5BB9;&#x6613;&#x53D7;&#x5230;SQL&#x6CE8;&#x5165;&#x653B;&#x51FB;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x7CBE;&#x5FC3;&#x5730;&#x8FC7;&#x6EE4;&#x7528;&#x6237;&#x8F93;&#x5165;&#xFF0C;&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x8F93;&#x5165;&#x522B;&#x6709;&#x7528;&#x5FC3;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6CE8;&#x5165;&#x5230;&#x4F60;&#x7684;SQL&#x4E2D;&#xFF0C;&#x5E76;&#x5728;&#x5176;&#x540E;&#x9762;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;SQL&#x8BED;&#x53E5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x7528;&#x7528;&#x6237;&#x8F93;&#x5165;&#x6765;&#x586B;&#x5145;&#x4E0B;&#x9762;SQL&#x8BED;&#x53E5;&#xFF1A;</p>
<pre><code>SELECT * FROM foods WHERE name=&apos;%s&apos;;
</code></pre><p>&#x5982;&#x679C;&#x65E0;&#x8BBA;&#x7528;&#x6237;&#x8F93;&#x5165;&#x4EC0;&#x4E48;&#x90FD;&#x76F4;&#x63A5;&#x6765;&#x66FF;&#x6362;%s&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x5BF9;&#x4F60;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6709;&#x4E00;&#x5B9A;&#x4E86;&#x89E3;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x8F93;&#x5165;&#x5982;&#x4E0B;&#x5185;&#x5BB9;&#xFF1A;</p>
<pre><code>nothing&apos; LIMIT 0; SELECT name FROM sqlite_master WHERE name=&apos;%
</code></pre><p>&#x5C06;&#x7528;&#x6237;&#x8F93;&#x5165;&#x66FF;&#x6362;&#x8FDB;&#x539F;&#x6709;&#x7684;SQL&#x8BED;&#x53E5;&#x4E4B;&#x540E;&#xFF0C;&#x53D8;&#x6210;&#x4E86;&#x4E24;&#x4E2A;&#x65B0;&#x7684;&#x8BED;&#x53E5;&#xFF1A;</p>
<pre><code>SELECT * FROM foods WHERE name=&apos;nothing&apos; LIMIT 0; SELECT name FROM
sqlite_master WHERE name=&apos;%&apos;;
</code></pre><p>&#x7B2C;1&#x4E2A;&#x8BED;&#x53E5;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x8FD4;&#x56DE;&#xFF0C;&#x4F46;&#x7B2C;2&#x4E2A;&#x5C06;&#x8FD4;&#x56DE;&#x8868;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x8BB0;&#x5F55;&#x3002;Granted, the odds of this happening require quite a bit of knowledge on the attacker&#x2019;s part, but it is nevertheless possible. Some major (commercial) web applications have been known to keep SQL statements embedded in their JavaScript, which can provide plenty of hints about the database being used. In the previous example, all a malicious user has to do now is insert DROP TABLE statements for every table found in sqlite_master and you could find yourself fumbling through backups.</p>
<h2 id="&#x64CD;&#x4F5C;&#x63A7;&#x5236;">&#x64CD;&#x4F5C;&#x63A7;&#x5236;</h2>
<p>API&#x4E2D;&#x5305;&#x542B;&#x51E0;&#x4E2A;&#x547D;&#x4EE4;&#x6765;&#x76D1;&#x89C6;&#x3001;&#x63A7;&#x5236;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x9650;&#x5236;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#x3002;SQLite&#x4F7F;&#x7528;&#x8FC7;&#x6EE4;(&#x6216;&#x79F0;&#x56DE;&#x53EB;)&#x51FD;&#x6570;&#x6765;&#x5B8C;&#x6210;&#x6B64;&#x529F;&#x80FD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6CE8;&#x518C;&#x5B83;&#x4EEC;&#x7531;&#x7279;&#x5B9A;&#x7684;&#x4E8B;&#x4EF6;&#x6765;&#x8C03;&#x7528;&#x3002;&#x6709;3&#x4E2A;&#x201C;hook&#x201D;&#x51FD;&#x6570;&#xFF1A;sqlite3_commit_hook()&#xFF0C;&#x5B83;&#x76D1;&#x89C6;&#x4E8B;&#x52A1;&#x7684;&#x63D0;&#x4EA4;&#xFF1B;sqlite3_rollback_hook()&#xFF0C;&#x5B83;&#x76D1;&#x89C6;&#x4E8B;&#x52A1;&#x7684;&#x56DE;&#x5377;&#xFF1B;sqlite3_update_hook()&#xFF0C;&#x5B83;&#x76D1;&#x89C6;INSERT&#x3001;UPDATE&#x548C;DELETE&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x88AB;&#x8C03;&#x7528;&#x2014;&#x2014;&#x5373;&#x5F53;&#x547D;&#x4EE4;&#x6267;&#x884C;&#x65F6;&#x88AB;&#x8C03;&#x7528;&#x3002;Each hook allows you to register a callback function on a connection-by-connection basis, and lets you provide some kind of application-specific data to be passed to the callback as well. The general use of operational control functions is as follows:</p>
<pre><code>def commit_hook(cnx)
       log(&apos;Attempted commit on connection %x&apos;, cnx)
       return -1
end
db = open(&apos;foods.db&apos;)
db.set_commit_hook(rollback_hook, cnx)
db.exec(&quot;BEGIN; DELETE from episodes; ROLLBACK&quot;)
db.close()
</code></pre><h3 id="&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;">&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;</h3>
<p>SQLite&#x6709;&#x51E0;&#x4E2A;&#x53EF;&#x4EE5;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E0B;&#x4F7F;&#x7528;&#x7684;&#x51FD;&#x6570;&#x3002;&#x5728;3.3.1&#x7248;&#x4E2D;&#xFF0C;SQLite&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x5171;&#x4EAB;&#x7F13;&#x51B2;&#x533A;&#x6A21;&#x5F0F;&#x7684;&#x72EC;&#x7279;&#x7684;&#x64CD;&#x4F5C;&#x6A21;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x5185;&#x5D4C;&#x5F0F;&#x670D;&#x52A1;&#x5668;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x7528;&#x5355;&#x7EBF;&#x7A0B;&#x6765;&#x5904;&#x7406;&#x591A;&#x8FDE;&#x63A5;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7684;&#x9875;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x4E86;&#x6574;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5185;&#x5B58;&#x9700;&#x6C42;&#x3002;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x5305;&#x62EC;&#x591A;&#x4E2A;&#x51FD;&#x6570;&#x6765;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#x548C;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8BE6;&#x89C1;&#x7B2C;6&#x7AE0;&#x201C;&#x5171;&#x4EAB;&#x7F13;&#x51B2;&#x533A;&#x6A21;&#x5F0F;&#x201D;&#x4E00;&#x8282;&#x3002;</p>
<h2 id="&#x6269;&#x5145;api">&#x6269;&#x5145;API</h2>
<p>SQLite&#x7684;&#x6269;&#x5145;API&#x7528;&#x6765;&#x652F;&#x6301;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x3001;&#x805A;&#x5408;&#x548C;&#x6392;&#x5E8F;&#x6CD5;&#x3002;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x662F;&#x4E00;&#x4E2A;SQL&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x5BF9;&#x5E94;&#x4E8E;&#x4F60;&#x7528;C&#x8BED;&#x8A00;&#x6216;&#x5176;&#x5B83;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x7684;&#x51FD;&#x6570;&#x7684;&#x53E5;&#x67C4;&#x3002;&#x4F7F;&#x7528;C API&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x53E5;&#x67C4;&#x7528;C/C++&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x6269;&#x5C55;&#x5FC5;&#x987B;&#x6CE8;&#x518C;&#x5230;&#x4E00;&#x4E2A;&#x7531;&#x8FDE;&#x63A5;&#x5230;&#x8FDE;&#x63A5;&#x7684;&#x57FA;&#x7840;(connection-by-connection basis)&#x4E4B;&#x4E0A;&#xFF0C;&#x5B58;&#x50A8;&#x5728;&#x7A0B;&#x5E8F;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x662F;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;(&#x5C31;&#x50CF;&#x5927;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E00;&#x6837;)&#xFF0C;&#x800C;&#x662F;&#x5B58;&#x50A8;&#x5728;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;</p>
<h3 id="&#x521B;&#x5EFA;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;">&#x521B;&#x5EFA;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x51FD;&#x6570;</h3>
<p>&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x5206;&#x4E3A;&#x4E24;&#x6B65;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5199;&#x53E5;&#x67C4;&#x3002;&#x53E5;&#x67C4;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x4F60;&#x60F3;&#x901A;&#x8FC7;SQL&#x5B8C;&#x6210;&#x7684;&#x529F;&#x80FD;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6CE8;&#x518C;&#x53E5;&#x67C4;&#xFF0C;&#x4E3A;&#x5B83;&#x63D0;&#x4F9B;SQL&#x540D;&#x79F0;&#x3001;&#x53C2;&#x6570;&#x7684;&#x6570;&#x91CF;&#x548C;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x53E5;&#x67C4;&#x7684;&#x6307;&#x9488;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x60F3;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53EB;&#x505A;hello_newman()&#x7684;SQL&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;&#x6587;&#x672C;&apos;Hello Jerry&apos;&#x3002;&#x5728;SQLite C API&#x4E2D;&#xFF0C;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;C&#x51FD;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x6B64;&#x529F;&#x80FD;&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code>void hello_newman(sqlite3_context* ctx, int nargs, sqlite3_value** values)
{
    /* Create Newman&apos;s reply */
    const char *msg = &quot;Hello Jerry&quot;;
    /* Set the return value. Have sqlite clean up msg w/ sqlite_free(). */
    sqlite3_result_text(ctx, msg, strlen(msg), sqlite3_free);
}
</code></pre><p>&#x4E0D;&#x4E86;&#x89E3;C&#x548C;C API&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#x3002;&#x8FD9;&#x4E2A;&#x53E5;&#x67C4;&#x4EC5;&#x8FD4;&#x56DE;&apos;Hello Jerry&apos;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x4F7F;&#x7528;sqlite3_create_function()&#x51FD;&#x6570;&#x6CE8;&#x518C;&#x8FD9;&#x4E2A;&#x53E5;&#x67C4;&#xFF1A;</p>
<pre><code>    sqlite3_create_function(db, &quot;hello_newman&quot;, 0, hello_newman);
</code></pre><p>&#x7B2C;1&#x4E2A;&#x53C2;&#x6570;(db)&#x662F;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x3002;&#x7B2C;2&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x51FD;&#x6570;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x8FD9;&#x4E2A;&#x540D;&#x79F0;&#x5C06;&#x51FA;&#x73B0;&#x5728;SQL&#x4E2D;&#x3002;&#x7B2C;3&#x4E2A;&#x53C2;&#x6570;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x6709;0&#x4E2A;&#x53C2;&#x6570;(&#x5982;&#x679C;&#x8BE5;&#x53C2;&#x6570;&#x503C;&#x4E3A;-1&#xFF0C;&#x8868;&#x793A;&#x8BE5;&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x53EF;&#x53D8;&#x6570;&#x91CF;&#x7684;&#x53C2;&#x6570;)&#x3002;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;C&#x51FD;&#x6570;hello_newman()&#x7684;&#x6307;&#x9488;&#xFF0C;&#x5F53;SQL&#x51FD;&#x6570;&#x88AB;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x6307;&#x9488;&#x6765;&#x8C03;&#x7528;&#x5B9E;&#x9645;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x8FDB;&#x884C;&#x4E86;&#x6CE8;&#x518C;&#xFF0C;SQLite&#x5C31;&#x77E5;&#x9053;&#x4E86;&#x5F53;&#x9047;&#x5230;SQL&#x51FD;&#x6570;&#x8C03;&#x7528;hello_newman()&#x65F6;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x8C03;&#x7528;C&#x51FD;&#x6570;hello_newman()&#x6765;&#x5F97;&#x5230;&#x7ED3;&#x679C;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x6267;&#x884C;SELECT hello_newman()&#x8BED;&#x53E5;&#xFF0C;&#x5B83;&#x5C06;&#x8FD4;&#x56DE;&#x5355;&#x884C;&#x5355;&#x5217;&#x7684;&#x6587;&#x672C;&apos;Hello Jerry&apos;&#x3002;</p>
<p>&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x6269;&#x5C55;&#x5141;&#x8BB8;&#x7528;&#x5404;&#x81EA;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x5B9E;&#x73B0;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Java&#x3001;Perl&#x7B49;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x8A00;&#x6269;&#x5C55;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x6CE8;&#x518C;&#x51FD;&#x6570;&#xFF0C;&#x6709;&#x4E9B;&#x4F7F;&#x7528;&#x5176;&#x672C;&#x8EAB;&#x8BED;&#x8A00;&#x7684;&#x51FD;&#x6570;&#x6765;&#x5B8C;&#x6210;&#x6B64;&#x9879;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5728;Ruby&#x4E2D;&#x4F7F;&#x7528;block&#x2014;one&#x3002;</p>
<h3 id="&#x521B;&#x5EFA;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x805A;&#x5408;">&#x521B;&#x5EFA;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x805A;&#x5408;</h3>
<p>&#x6240;&#x8C13;&#x805A;&#x5408;&#x51FD;&#x6570;&#xFF0C;&#x5C31;&#x662F;&#x90A3;&#x4E9B;&#x5728;&#x7ED3;&#x679C;&#x96C6;&#x4E2D;&#x5E94;&#x7528;&#x4E8E;&#x5168;&#x90E8;&#x8BB0;&#x5F55;&#xFF0C;&#x5E76;&#x4ECE;&#x4E2D;&#x8BA1;&#x7B97;&#x4E00;&#x4E9B;&#x805A;&#x5408;&#x503C;&#x7684;&#x51FD;&#x6570;&#x3002;SUM()&#x3001;COUNT()&#x548C;AVG()&#x90FD;&#x662F;SQLite&#x6807;&#x51C6;&#x805A;&#x5408;&#x51FD;&#x6570;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x805A;&#x5408;&#x9700;&#x8981;&#x4E09;&#x6B65;&#xFF1A;&#x6CE8;&#x518C;&#x805A;&#x5408;&#x3001;&#x5B9E;&#x73B0;&#x6B65;&#x8FDB;&#x51FD;&#x6570;(&#x5BF9;&#x7ED3;&#x679C;&#x96C6;&#x4E2D;&#x7684;&#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#x8C03;&#x7528;)&#x3001;&#x5B9E;&#x73B0;&#x5B9A;&#x6848;&#x51FD;&#x6570;(&#x5728;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x5904;&#x7406;&#x5B8C;&#x540E;&#x8C03;&#x7528;)&#x3002;&#x5728;&#x5B9A;&#x6848;&#x51FD;&#x6570;&#x4E2D;&#x8BA1;&#x7B97;&#x6700;&#x7EC8;&#x7684;&#x805A;&#x5408;&#x503C;&#xFF0C;&#x5E76;&#x505A;&#x4E00;&#x4E9B;&#x5FC5;&#x8981;&#x7684;&#x6E05;&#x7406;&#x5DE5;&#x4F5C;&#x3002;</p>
<h3 id="&#x521B;&#x5EFA;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x6392;&#x5E8F;&#x6CD5;">&#x521B;&#x5EFA;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x6392;&#x5E8F;&#x6CD5;</h3>
<h2 id="&#x4E8B;&#x52A1;">&#x4E8B;&#x52A1;</h2>
<p>&#x73B0;&#x5728;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x5BF9;API&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x8F83;&#x597D;&#x7684;&#x4E86;&#x89E3;&#x3002;&#x4F60;&#x77E5;&#x9053;&#x4E86;&#x6267;&#x884C;SQL&#x547D;&#x4EE4;&#x7684;&#x4E0D;&#x540C;&#x65B9;&#x6CD5;&#x548C;&#x4E00;&#x4E9B;&#x6709;&#x7528;&#x7684;&#x529F;&#x80FD;&#x51FD;&#x6570;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x53EA;&#x77E5;&#x9053;API&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x4E8B;&#x52A1;&#x548C;&#x9501;&#x4E0E;&#x67E5;&#x8BE2;&#x7684;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x662F;&#x7D27;&#x5BC6;&#x5173;&#x8054;&#x7684;&#x3002;&#x67E5;&#x8BE2;&#x6C38;&#x8FDC;&#x53EA;&#x80FD;&#x5728;&#x4E8B;&#x52A1;&#x4E2D;&#x5B8C;&#x6210;&#xFF0C;&#x4E8B;&#x52A1;&#x5305;&#x542B;&#x9501;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x4E0D;&#x6E05;&#x695A;&#x81EA;&#x5DF1;&#x5230;&#x5E95;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x9501;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x95EE;&#x9898;&#x3002;&#x6839;&#x636E;&#x4F60;&#x662F;&#x5982;&#x4F55;&#x4F7F;&#x7528;SQL&#x53CA;&#x5982;&#x4F55;&#x7F16;&#x7801;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x9501;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x7B2C;4&#x7AE0;&#x56FE;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x5047;&#x60F3;&#xFF1A;&#x4E24;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x8FDE;&#x63A5;&#x540C;&#x65F6;&#x6267;&#x884C;&#x65F6;&#x5BFC;&#x81F4;&#x4E86;&#x6B7B;&#x9501;&#x3002;&#x4F5C;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x4ECE;&#x4EE3;&#x7801;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#x5F85;&#x95EE;&#x9898;&#xFF0C;&#x4EE3;&#x7801;&#x4E2D;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x5904;&#x4E8E;&#x591A;&#x79CD;&#x72B6;&#x6001;&#x7684;&#x591A;&#x4E2A;&#x8FDE;&#x63A5;&#xFF0C;&#x5E26;&#x6709;&#x591A;&#x4E2A;&#x8BED;&#x53E5;&#x53E5;&#x67C4;&#xFF0C;&#x800C;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x5728;&#x4F60;&#x4E0D;&#x77E5;&#x60C5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x6301;&#x6709;&#x4E86;EXCLUSIVE&#x9501;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5176;&#x5B83;&#x8FDE;&#x63A5;&#x4E0D;&#x80FD;&#x505A;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x638C;&#x63E1;&#x4E0B;&#x9762;&#x77E5;&#x8BC6;&#x5F88;&#x91CD;&#x8981;&#xFF1A;&#x4E8B;&#x52A1;&#x548C;&#x9501;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#xFF0C;&#x5B83;&#x4EEC;&#x5982;&#x4F55;&#x4E0E;API&#x7ED3;&#x5408;&#x6765;&#x5904;&#x7406;&#x67E5;&#x8BE2;&#x3002;&#x7406;&#x60F3;&#x7684;&#x76EE;&#x6807;&#x662F;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x770B;&#x7740;&#x4F60;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x5E76;&#x8BF4;&#x51FA;&#x4E8B;&#x52A1;&#x5904;&#x4E8E;&#x4EC0;&#x4E48;&#x72B6;&#x6001;&#xFF0C;&#x6216;&#x8005;&#x81F3;&#x5C11;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x6F5C;&#x5728;&#x7684;&#x95EE;&#x9898;&#x3002;&#x672C;&#x8282;&#x5C06;&#x4ECB;&#x7ECD;&#x4E8B;&#x52A1;&#x548C;&#x9501;&#x80CC;&#x540E;&#x7684;&#x8FD0;&#x884C;&#x673A;&#x5236;&#xFF0C;&#x4E0B;&#x4E00;&#x8282;&#x5C06;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x5B9E;&#x9645;&#x5730;&#x7F16;&#x7801;&#x3002;</p>
<h2 id="&#x4E8B;&#x52A1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;">&#x4E8B;&#x52A1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;</h2>
<p>&#x6709;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x4EE3;&#x7801;&#x548C;&#x4E8B;&#x52A1;&#x7684;&#x95EE;&#x9898;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x3002;&#x9996;&#x5148;&#x9700;&#x8981;&#x77E5;&#x9053;&#x54EA;&#x4E2A;&#x5BF9;&#x8C61;&#x8FD0;&#x884C;&#x5728;&#x54EA;&#x4E2A;&#x4E8B;&#x52A1;&#x4E4B;&#x4E0B;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x2014;&#x2014;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4F55;&#x65F6;&#x5F00;&#x59CB;&#xFF0C;&#x4F55;&#x65F6;&#x7ED3;&#x675F;&#xFF0C;&#x4ECE;&#x54EA;&#x4E00;&#x70B9;&#x5F00;&#x59CB;&#x5F71;&#x54CD;&#x5176;&#x5B83;&#x8FDE;&#x63A5;&#xFF1F;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E0E;API&#x76F4;&#x63A5;&#x5173;&#x8054;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E0E;SQL&#x7684;&#x4E00;&#x822C;&#x6982;&#x5FF5;&#x53CA;SQLite&#x7684;&#x7279;&#x6B8A;&#x5B9E;&#x73B0;&#x5173;&#x8054;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;(connection)&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x8BED;&#x53E5;(statement)&#xFF0C;&#x800C;&#x4E14;&#x6BCF;&#x4E2A;&#x8FDE;&#x63A5;&#x6709;&#x4E00;&#x4E2A;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x5173;&#x8054;&#x7684;B-tree&#x548C;&#x4E00;&#x4E2A;pager&#x3002;Pager&#x5728;&#x8FDE;&#x63A5;&#x4E2D;&#x8D77;&#x7740;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7BA1;&#x7406;&#x4E8B;&#x52A1;&#x3001;&#x9501;&#x3001;&#x5185;&#x5B58;&#x7F13;&#x51B2;&#x4EE5;&#x53CA;&#x8D1F;&#x8D23;&#x5D29;&#x6E83;&#x6062;&#x590D;(crash recovery)&#x3002;&#x5F53;&#x4F60;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5E93;&#x5199;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x8BB0;&#x4F4F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#xFF1A;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E0B;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x3002;&#x8FD9;&#x56DE;&#x7B54;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x548C;&#x8BED;&#x53E5;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x7ED3;&#x675F;&#x5B83;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E8B;&#x52A1;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#xFF0C;&#x5F53;&#x7136;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;BEGIN..COMMIT&#x624B;&#x52A8;&#x63D0;&#x4EA4;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4E8B;&#x52A1;&#x5982;&#x4F55;&#x4E0E;&#x9501;&#x5173;&#x8054;&#x3002;</p>
<h2 id="&#x9501;&#x7684;&#x72B6;&#x6001;">&#x9501;&#x7684;&#x72B6;&#x6001;</h2>
<p>&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9501;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x5728;&#x4E8B;&#x52A1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E4B;&#x4E2D;&#x3002;&#x5B83;&#x4EEC;&#x4E0D;&#x4E00;&#x5B9A;&#x540C;&#x65F6;&#x5F00;&#x59CB;&#xFF0C;&#x4F46;&#x603B;&#x65F6;&#x540C;&#x65F6;&#x7ED3;&#x675F;&#x3002;&#x5F53;&#x4F60;&#x7ED3;&#x675F;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x65F6;&#xFF0C;&#x4E5F;&#x4F1A;&#x91CA;&#x653E;&#x5B83;&#x76F8;&#x5173;&#x7684;&#x9501;&#x3002;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x9501;&#x76F4;&#x5230;&#x4E8B;&#x52A1;&#x7ED3;&#x675F;&#x6216;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x65F6;&#x624D;&#x4F1A;&#x91CA;&#x653E;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x5728;&#x4E8B;&#x52A1;&#x6CA1;&#x6709;&#x7ED3;&#x675F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5D29;&#x6E83;&#xFF0C;&#x90A3;&#x4E48;&#x4E0B;&#x4E00;&#x4E2A;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8FDE;&#x63A5;&#x4F1A;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x8BE6;&#x89C1;&#x201C;&#x9501;&#x4E0E;&#x5D29;&#x6E83;&#x6062;&#x590D;&#x201D;&#x4E00;&#x8282;&#x3002;</p>
<p>&#x5728;SQLite&#x4E2D;&#x6709;5&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x9501;&#x72B6;&#x6001;&#xFF0C;&#x8FDE;&#x63A5;(connection)&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x5904;&#x4E8E;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x3002;&#x56FE;5-3&#x663E;&#x793A;&#x4E86;&#x9501;&#x7684;&#x72B6;&#x6001;&#x4EE5;&#x53CA;&#x72B6;&#x6001;&#x7684;&#x8F6C;&#x6362;&#x3002;</p>
<p><img src="img/image009.jpg" alt=""></p>
<p>&#x56FE;5-3 SQLite&#x9501;&#x8F6C;&#x6362;</p>
<p>&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x56FE;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#xFF1A;</p>
<p>(1)&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x5728;UNLOCKED&#x3001;RESERVED&#x6216;EXCLUSIVE&#x4E09;&#x79CD;&#x72B6;&#x6001;&#x4E0B;&#x5F00;&#x59CB;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x5728;UNLOCKED&#x65F6;&#x5F00;&#x59CB;&#x3002;</p>
<p>(2)&#x767D;&#x8272;&#x6846;&#x4E2D;&#x7684;UNLOCKED&#x3001;PENDING&#x3001;SHARED&#x548C; RESERVED&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x7684;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x5B58;&#x5728;&#x3002;</p>
<p>(3)&#x4ECE;&#x7070;&#x8272;&#x7684;PENDING&#x5F00;&#x59CB;&#xFF0C;&#x4E8B;&#x60C5;&#x5C31;&#x53D8;&#x5F97;&#x4E25;&#x683C;&#x8D77;&#x6765;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4E8B;&#x52A1;&#x60F3;&#x5F97;&#x5230;&#x6392;&#x5B83;&#x9501;(EXCLUSIVE)(&#x6CE8;&#x610F;&#x4E0E;&#x767D;&#x8272;&#x6846;&#x4E2D;&#x7684;&#x533A;&#x522B;)&#x3002;</p>
<p>&#x867D;&#x7136;&#x9501;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x4F53;&#x8D28;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x8BFB;&#x4E8B;&#x52A1;&#x548C;&#x5199;&#x4E8B;&#x52A1;&#x3002;</p>
<h2 id="&#x8BFB;&#x4E8B;&#x52A1;">&#x8BFB;&#x4E8B;&#x52A1;</h2>
<p>&#x6211;&#x4EEC;&#x5148;&#x6765;&#x770B;&#x770B;SELECT&#x8BED;&#x53E5;&#x6267;&#x884C;&#x65F6;&#x9501;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#xFF0C;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF1A;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x6267;&#x884C;SELECT&#x8BED;&#x53E5;&#xFF0C;&#x89E6;&#x53D1;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#xFF0C;&#x4ECE;UNLOCKED&#x5230;SHARED&#xFF0C;&#x5F53;&#x4E8B;&#x52A1;COMMIT&#x65F6;&#xFF0C;&#x53C8;&#x56DE;&#x5230;UNLOCKED&#xFF0C;&#x5C31;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5F53;&#x4F60;&#x8FD0;&#x884C;&#x4E24;&#x4E2A;&#x8BED;&#x53E5;&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x8FD9;&#x65F6;&#x5982;&#x4F55;&#x52A0;&#x9501;&#x5462;&#xFF1F;&#x8FD9;&#x4F9D;&#x8D56;&#x4E8E;&#x4F60;&#x662F;&#x5426;&#x8FD0;&#x884C;&#x5728;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#x72B6;&#x6001;&#x3002;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;(&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#xFF0C;&#x8FD9;&#x91CC;&#x7528;&#x4E86;&#x4F2A;&#x7801;)&#xFF1A;</p>
<pre><code>db = open(&apos;foods.db&apos;)
db.exec(&apos;BEGIN&apos;)
db.exec(&apos;SELECT * FROM episodes&apos;)
db.exec(&apos;SELECT * FROM episodes&apos;)
db.exec(&apos;COMMIT&apos;)
db.close()
</code></pre><p>&#x7531;&#x4E8E;&#x663E;&#x5F0F;&#x5730;&#x4F7F;&#x7528;&#x4E86;BEGIN&#x548C;COMMIT&#xFF0C;&#x4E24;&#x4E2A;SELECT&#x547D;&#x4EE4;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E0B;&#x6267;&#x884C;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;exec()&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x8FDE;&#x63A5;&#x5904;&#x4E8E;SHARED&#xFF0C;&#x7136;&#x540E;&#x7B2C;&#x4E8C;&#x4E2A;exec()&#x6267;&#x884C;&#x3002;&#x5F53;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x65F6;&#xFF0C;&#x8FDE;&#x63A5;&#x53C8;&#x4ECE;SHARED&#x56DE;&#x5230;UNLOCKED&#x72B6;&#x6001;&#xFF0C;&#x72B6;&#x6001;&#x53D8;&#x5316;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>UNLOCKED&#x2192;PENDING&#x2192;SHARED&#x2192;UNLOCKED
</code></pre><p>&#x5982;&#x679C;&#x6CA1;&#x6709;BEGIN&#x548C;COMMIT&#x4E24;&#x884C;&#xFF0C;&#x4E24;&#x4E2A;SELECT&#x90FD;&#x8FD0;&#x884C;&#x4E8E;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#x72B6;&#x6001;&#xFF0C;&#x72B6;&#x6001;&#x53D8;&#x5316;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>UNLOCKED&#x2192;PENDING&#x2192;SHARED&#x2192;UNLOCKED&#x2192;PENDING&#x2192;SHARED&#x2192;UNLOCKED
</code></pre><p>&#x4EC5;&#x4EC5;&#x662F;&#x8BFB;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x5728;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x5374;&#x4F1A;&#x7ECF;&#x5386;&#x4E24;&#x4E2A;&#x52A0;&#x89E3;&#x9501;&#x7684;&#x5FAA;&#x73AF;&#xFF0C;&#x592A;&#x9EBB;&#x70E6;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x4E00;&#x4E2A;&#x5199;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x63D2;&#x5230;&#x4E24;&#x4E2A;SELECT&#x4E2D;&#x95F4;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x7B2C;&#x4E8C;&#x6B21;&#x80FD;&#x591F;&#x8BFB;&#x5230;&#x540C;&#x6837;&#x7684;&#x6570;&#x636E;&#x4E86;&#xFF0C;&#x800C;&#x4F7F;&#x7528;BEGIN..COMMIT&#x5C31;&#x53EF;&#x4EE5;&#x6709;&#x6B64;&#x4FDD;&#x8BC1;&#x3002;</p>
<h2 id="&#x5199;&#x4E8B;&#x52A1;">&#x5199;&#x4E8B;&#x52A1;</h2>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x8003;&#x8651;&#x5199;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6BD4;&#x5982;UPDATE&#x3002;&#x548C;&#x8BFB;&#x4E8B;&#x52A1;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x4E5F;&#x4F1A;&#x7ECF;&#x5386;UNLOCKED&#x2192;PENDING&#x2192;SHARED&#x7684;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x4F1A;&#x770B;&#x5230;PENDING&#x9501;&#x662F;&#x5982;&#x4F55;&#x8D77;&#x5230;&#x5173;&#x53E3;&#x4F5C;&#x7528;&#x7684;&#x4E86;&#x3002;</p>
<h3 id="&#x4FDD;&#x7559;reserved&#x72B6;&#x6001;">&#x4FDD;&#x7559;(RESERVED)&#x72B6;&#x6001;</h3>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;(connection)&#x8981;&#x5411;&#x6570;&#x636E;&#x5E93;&#x5199;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x4ECE;SHARED&#x72B6;&#x6001;&#x53D8;&#x4E3A;RESERVED&#x72B6;&#x6001;&#x3002;&#x5982;&#x679C;&#x5B83;&#x5F97;&#x5230;RESERVED&#x9501;&#xFF0C;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5B83;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x8FDB;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#x4E86;&#x3002;&#x5373;&#x4F7F;&#x5B83;&#x6CA1;&#x6709;&#x628A;&#x4FEE;&#x6539;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x4FEE;&#x6539;&#x4FDD;&#x5B58;&#x5230;&#x4F4D;&#x4E8E;pager&#x7684;&#x7F13;&#x51B2;&#x533A;&#x4E2D;(page cache)&#x4E86;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x8FDB;&#x5165;RESERVED&#x72B6;&#x6001;&#xFF0C;pager&#x5C31;&#x5F00;&#x59CB;&#x521D;&#x59CB;&#x5316;&#x56DE;&#x5377;&#x65E5;&#x5FD7;(rollback journal)&#x3002;&#x56DE;&#x5377;&#x65E5;&#x5FD7;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x7528;&#x4E8E;&#x56DE;&#x5377;&#x548C;&#x5D29;&#x6E83;&#x6062;&#x590D;&#xFF0C;&#x89C1;&#x56FE;5-1&#x3002;&#x5728;RESERVED&#x72B6;&#x6001;&#x4E0B;&#xFF0C;pager&#x7BA1;&#x7406;&#x7740;&#x4E09;&#x79CD;&#x9875;&#xFF1A;</p>
<p>(1)&#x5DF2;&#x4FEE;&#x6539;&#x7684;&#x9875;&#xFF1A;&#x5305;&#x542B;&#x88AB;B-tree&#x4FEE;&#x6539;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x4F4D;&#x4E8E;page cache&#x4E2D;&#x3002;</p>
<p>(2)&#x672A;&#x4FEE;&#x6539;&#x7684;&#x9875;&#xFF1A;&#x5305;&#x542B;&#x6CA1;&#x6709;&#x88AB;B-tree&#x4FEE;&#x6539;&#x7684;&#x8BB0;&#x5F55;&#x3002;</p>
<p>(3)&#x65E5;&#x5FD7;&#x9875;&#xFF1A;&#x8FD9;&#x662F;&#x4FEE;&#x6539;&#x9875;&#x4EE5;&#x524D;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x65E5;&#x5FD7;&#x9875;&#x5E76;&#x4E0D;&#x5B58;&#x50A8;&#x5728;page cache&#x4E2D;&#xFF0C;&#x800C;&#x662F;&#x5728;B-tree&#x4FEE;&#x6539;&#x9875;&#x4E4B;&#x524D;&#x5199;&#x5165;&#x65E5;&#x5FD7;&#x3002;</p>
<p>Page cache&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x4E00;&#x4E2A;&#x5904;&#x4E8E;RESERVED&#x72B6;&#x6001;&#x7684;&#x8FDE;&#x63A5;&#x53EF;&#x4EE5;&#x771F;&#x6B63;&#x7684;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5E72;&#x6270;&#x5176;&#x5B83;&#x7684;(&#x8BFB;)&#x8FDE;&#x63A5;&#x3002;&#x6240;&#x4EE5;&#xFF0C;SQLite&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x5730;&#x5904;&#x7406;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x7684;&#x591A;&#x4E2A;&#x8BFB;&#x8FDE;&#x63A5;&#x548C;&#x4E00;&#x4E2A;&#x5199;&#x8FDE;&#x63A5;&#x3002;</p>
<h3 id="&#x672A;&#x51B3;pending&#x72B6;&#x6001;">&#x672A;&#x51B3;(PENDING)&#x72B6;&#x6001;</h3>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x5B8C;&#x6210;&#x4FEE;&#x6539;&#xFF0C;&#x9700;&#x8981;&#x771F;&#x6B63;&#x5F00;&#x59CB;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x65F6;&#xFF0C;&#x6267;&#x884C;&#x8BE5;&#x8FC7;&#x7A0B;&#x7684;pager&#x8FDB;&#x5165;EXCLUSIVE&#x72B6;&#x6001;&#x3002;&#x4ECE;RESERVED&#x72B6;&#x6001;&#x5F00;&#x59CB;&#xFF0C;pager&#x8BD5;&#x7740;&#x83B7;&#x53D6;PENDING&#x9501;&#xFF0C;&#x4E00;&#x65E6;&#x5F97;&#x5230;&#xFF0C;&#x5C31;&#x72EC;&#x5360;&#x5B83;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x4EFB;&#x4F55;&#x5176;&#x5B83;&#x8FDE;&#x63A5;&#x83B7;&#x5F97;PENDING&#x9501;&#x3002;&#x65E2;&#x7136;&#x5199;&#x64CD;&#x4F5C;&#x6301;&#x6709;PENDING&#x9501;&#xFF0C;&#x5176;&#x5B83;&#x4EFB;&#x4F55;&#x8FDE;&#x63A5;&#x90FD;&#x4E0D;&#x80FD;&#x4ECE;UNLOCKED&#x72B6;&#x6001;&#x8FDB;&#x5165;SHARED&#x72B6;&#x6001;&#xFF0C;&#x5373;&#x4E0D;&#x4F1A;&#x518D;&#x6709;&#x65B0;&#x7684;&#x8BFB;&#x8FDB;&#x7A0B;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x518D;&#x6709;&#x65B0;&#x7684;&#x5199;&#x8FDB;&#x7A0B;&#x3002;&#x53EA;&#x6709;&#x90A3;&#x4E9B;&#x5DF2;&#x7ECF;&#x5904;&#x4E8E;SHARED&#x72B6;&#x6001;&#x7684;&#x8FDE;&#x63A5;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#x3002;&#x800C;&#x5904;&#x4E8E;PENDING&#x72B6;&#x6001;&#x7684;&#x5199;&#x8FDB;&#x7A0B;&#x4F1A;&#x4E00;&#x76F4;&#x7B49;&#x5230;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x8FDE;&#x63A5;&#x91CA;&#x653E;&#x5B83;&#x4EEC;&#x7684;&#x9501;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x52A0;EXCUSIVE&#x9501;&#xFF0C;&#x8FDB;&#x5165;EXCLUSIVE&#x72B6;&#x6001;&#xFF0C;&#x72EC;&#x5360;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<h3 id="&#x6392;&#x5B83;&#x72B6;&#x6001;">&#x6392;&#x5B83;&#x72B6;&#x6001;</h3>
<p>&#x5728;EXCLUSIVE&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x4E3B;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x628A;&#x4FEE;&#x6539;&#x7684;&#x9875;&#x4ECE;page cache&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x662F;&#x771F;&#x6B63;&#x8FDB;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x5728;pager&#x5C06;&#x4FEE;&#x6539;&#x9875;&#x5199;&#x5230;&#x6587;&#x4EF6;&#x4E4B;&#x524D;&#xFF0C;&#x8FD8;&#x5FC5;&#x987B;&#x5148;&#x5904;&#x7406;&#x65E5;&#x5FD7;&#x3002;&#x5B83;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x6240;&#x6709;&#x7684;&#x65E5;&#x5FD7;&#x90FD;&#x5199;&#x5165;&#x4E86;&#x78C1;&#x76D8;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x8FD8;&#x4F4D;&#x4E8E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x3002;&#x6240;&#x4EE5;pager&#x5F97;&#x544A;&#x8BC9;OS&#x628A;&#x6240;&#x6709;&#x7684;&#x6587;&#x4EF6;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF0C;&#x8FD9;&#x4E0E;synchronous pragma&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x76F8;&#x540C;&#xFF0C;&#x5982;&#x7B2C;4&#x7AE0;&#x6240;&#x8FF0;&#x3002;</p>
<p>&#x65E5;&#x5FD7;&#x662F;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x6062;&#x590D;&#x7684;&#x60DF;&#x4E00;&#x65B9;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#x65E5;&#x5FD7;&#x5BF9;&#x4E8E;DBMS&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x5982;&#x679C;&#x65E5;&#x5FD7;&#x9875;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x5199;&#x5165;&#x78C1;&#x76D8;&#x800C;&#x53D1;&#x751F;&#x5D29;&#x6E83;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5C31;&#x4E0D;&#x80FD;&#x6062;&#x590D;&#x5230;&#x5B83;&#x539F;&#x6765;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6B64;&#x65F6;&#x6570;&#x636E;&#x5E93;&#x5C31;&#x5904;&#x4E8E;&#x4E0D;&#x4E00;&#x81F4;&#x72B6;&#x6001;&#x3002;&#x65E5;&#x5FD7;&#x5199;&#x76D8;&#x5B8C;&#x6210;&#x540E;&#xFF0C;pager&#x5C31;&#x628A;&#x6240;&#x6709;&#x7684;&#x4FEE;&#x6539;&#x9875;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x505A;&#x4EC0;&#x4E48;&#x53D6;&#x51B3;&#x4E8E;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#xFF0C;&#x90A3;&#x4E48;pager&#x6E05;&#x7406;&#x65E5;&#x5FD7;&#x3001;page cache&#xFF0C;&#x7136;&#x540E;&#x7531;EXCLUSIVE&#x8FDB;&#x5165;UNLOCKED&#x3002;&#x5982;&#x679C;&#x662F;&#x624B;&#x52A8;&#x63D0;&#x4EA4;&#xFF0C;&#x90A3;&#x4E48;pager&#x7EE7;&#x7EED;&#x6301;&#x6709;EXCLUSIVE&#x9501;&#x548C;&#x56DE;&#x5377;&#x65E5;&#x5FD7;&#xFF0C;&#x76F4;&#x81F3;&#x9047;&#x5230;COMMIT&#x6216;&#x8005;ROLLBACK&#x3002;</p>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x51FA;&#x4E8E;&#x6027;&#x80FD;&#x65B9;&#x9762;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x8FDB;&#x7A0B;&#x5360;&#x6709;&#x6392;&#x5B83;&#x9501;&#x7684;&#x65F6;&#x95F4;&#x5E94;&#x8BE5;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x77ED;&#xFF0C;&#x6240;&#x4EE5;DBMS&#x901A;&#x5E38;&#x90FD;&#x662F;&#x5728;&#x771F;&#x6B63;&#x5199;&#x6587;&#x4EF6;&#x65F6;&#x624D;&#x4F1A;&#x5360;&#x6709;&#x6392;&#x5B83;&#x9501;&#xFF0C;&#x8FD9;&#x6837;&#x80FD;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x5E76;&#x53D1;&#x6027;&#x80FD;&#x3002;</p>
<h3 id="&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#x4E0E;&#x6548;&#x7387;">&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#x4E0E;&#x6548;&#x7387;</h3>
<h2 id="&#x8C03;&#x6574;&#x9875;&#x7F13;&#x51B2;&#x533A;">&#x8C03;&#x6574;&#x9875;&#x7F13;&#x51B2;&#x533A;</h2>
<p>&#x56DE;&#x5230;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4E8B;&#x52A1;&#x4ECE;BEGIN&#x5F00;&#x59CB;&#xFF0C;&#x8DDF;&#x7740;UPDATE&#x3002;&#x5982;&#x679C;&#x5728;&#x5199;&#x76D8;&#x4E4B;&#x524D;&#xFF0C;&#x4FEE;&#x6539;&#x64CD;&#x4F5C;&#x5C06;&#x7F13;&#x51B2;&#x533A;&#x7528;&#x5B8C;&#x4E86;(&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4FEE;&#x6539;&#x64CD;&#x4F5C;&#x9700;&#x8981;&#x6BD4;&#x9884;&#x8BBE;&#x7684;&#x66F4;&#x591A;&#x7684;&#x7F13;&#x51B2;&#x533A;)&#xFF0C;&#x8FD9;&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<h3 id="&#x8F6C;&#x6362;&#x4E3A;&#x6392;&#x5B83;">&#x8F6C;&#x6362;&#x4E3A;&#x6392;&#x5B83;</h3>
<p>&#x771F;&#x6B63;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF1A;&#x5230;&#x5E95;&#x5728;&#x54EA;&#x4E2A;(&#x7CBE;&#x786E;&#x7684;)&#x65F6;&#x523B;&#xFF0C;&#x5230;&#x5E95;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;pager &#x4ECE;RESERVED&#x8F6C;&#x6362;&#x4E3A;EXCLUSIVE&#x3002;&#x8FD9;&#x4F1A;&#x53D1;&#x751F;&#x5728;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF1A;&#x5F53;&#x8FDE;&#x63A5;&#x5230;&#x8FBE;&#x63D0;&#x4EA4;&#x70B9;&#x4E3B;&#x52A8;&#x8FDB;&#x5165;&#x6392;&#x5B83;&#x72B6;&#x6001;&#xFF1B;&#x6216;&#x9875;&#x7F13;&#x51B2;&#x533A;&#x5DF2;&#x6EE1;&#x4E0D;&#x5F97;&#x4E0D;&#x8FDB;&#x5165;&#x6392;&#x5B83;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x524D;&#x9762;&#x6211;&#x4EEC;&#x4EC5;&#x770B;&#x5230;&#x4E86;&#x7B2C;1&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x5728;&#x7B2C;2&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6B64;&#x65F6;pager&#x5DF2;&#x4E0D;&#x80FD;&#x518D;&#x5B58;&#x50A8;&#x66F4;&#x591A;&#x7684;&#x5DF2;&#x4FEE;&#x6539;&#x9875;&#xFF0C;&#x4E5F;&#x5C31;&#x4E0D;&#x80FD;&#x518D;&#x505A;&#x4EFB;&#x4F55;&#x4FEE;&#x6539;&#x64CD;&#x4F5C;&#x3002;&#x5B83;&#x5FC5;&#x987B;&#x8F6C;&#x6362;&#x4E3A;&#x6392;&#x5B83;&#x72B6;&#x6001;&#xFF0C;&#x4EE5;&#x4F7F;&#x5DE5;&#x4F5C;&#x80FD;&#x591F;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x4E0D;&#x5B8C;&#x5168;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x6709;&#x8F6F;&#x9650;&#x5236;&#x548C;&#x786C;&#x9650;&#x5236;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<h3 id="&#x8C03;&#x6574;&#x9875;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5927;&#x5C0F;">&#x8C03;&#x6574;&#x9875;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5927;&#x5C0F;</h3>
<p>&#x5982;&#x4F55;&#x51B3;&#x5B9A;&#x9700;&#x8981;&#x591A;&#x5927;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x5C3A;&#x5BF8;&#x5462;&#xFF1F;&#x8FD9;&#x7531;&#x4F60;&#x60F3;&#x505A;&#x4EC0;&#x4E48;&#x800C;&#x5B9A;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x60F3;&#x4FEE;&#x6539;episodes&#x8868;&#x7684;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x8868;&#x7684;&#x6240;&#x6709;&#x9875;&#x90FD;&#x4F1A;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x51FA;episodes&#x8868;&#x603B;&#x5171;&#x9700;&#x8981;&#x591A;&#x5C11;&#x4E2A;&#x9875;&#x5E76;&#x5BF9;&#x7F13;&#x51B2;&#x533A;&#x505A;&#x51FA;&#x8C03;&#x6574;&#x3002;&#x53EF;&#x4EE5;&#x7528;sqlite_analyzer&#x5230;&#x5F97;&#x6240;&#x6709;&#x5173;&#x4E8E;episodes&#x8868;&#x7684;&#x9700;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x8868;&#xFF0C;&#x5B83;&#x90FD;&#x53EF;&#x4EE5;&#x505A;&#x51FA;&#x5B8C;&#x5907;&#x7684;&#x7EDF;&#x8BA1;&#xFF0C;&#x5305;&#x62EC;&#x603B;&#x9875;&#x6570;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;foods&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5173;&#x4E8E;episodes&#x8868;&#x7684;&#x5982;&#x4E0B;&#x4FE1;&#x606F;&#xFF1A;</p>
<pre><code>*** Table EPISODES ***************************************************
Percentage of total database.......... 20.0%
Number of entries..................... 181
Bytes of storage consumed............. 5120
Bytes of payload...................... 3229 63.1%
Average payload per entry............. 17.84
Average unused bytes per entry........ 5.79
Average fanout........................ 4.00
Maximum payload per entry............. 38
Entries that use overflow............. 0 0.0%
Index pages used...................... 1
Primary pages used.................... 4
Overflow pages used................... 0
Total pages used...................... 5
Unused bytes on index pages........... 990 96.7%
Unused bytes on primary pages......... 58 1.4%
Unused bytes on overflow pages........ 0
Unused bytes on all pages............. 1048 20.5%
</code></pre><p>&#x603B;&#x9875;&#x6570;&#x662F;5&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x8868;&#x53EA;&#x7528;&#x4E86;4&#x9875;&#xFF0C;&#x8FD8;&#x6709;1&#x9875;&#x662F;&#x7D22;&#x5F15;&#x3002;&#x56E0;&#x4E3A;&#x9ED8;&#x8BA4;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x5927;&#x5C0F;&#x662F;2000&#x4E2A;&#x9875;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x62C5;&#x5FC3;&#x3002;&#x5728;episodes&#x8868;&#x4E2D;&#x6709;400&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6BCF;&#x9875;&#x53EF;&#x5B58;&#x653E;&#x7EA6;100&#x6761;&#x8BB0;&#x5F55;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x4FEE;&#x6539;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x4E4B;&#x524D;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x8C03;&#x6574;&#x9875;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x9664;&#x975E;episodes&#x4E2D;&#x81F3;&#x5C11;&#x6709;&#x4E86;196000&#x6761;&#x8BB0;&#x5F55;&#x3002;&#x8FD8;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x5728;&#x6709;&#x5176;&#x5B83;&#x8FDE;&#x63A5;&#x5E76;&#x53D1;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5E93;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x9700;&#x8981;&#x8003;&#x8651;&#x8FD9;&#x4E9B;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x6709;&#x4F60;&#x81EA;&#x5DF1;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C31;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x4E86;&#x3002;</p>
<h2 id="&#x7B49;&#x5F85;&#x52A0;&#x9501;">&#x7B49;&#x5F85;&#x52A0;&#x9501;</h2>
<p>&#x6211;&#x4EEC;&#x524D;&#x9762;&#x8C08;&#x5230;&#x8FC7;pager&#x7B49;&#x5F85;&#x4ECE;PENDING&#x72B6;&#x6001;&#x8FDB;&#x5165;EXCLUSIVE&#x72B6;&#x6001;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x8FD9;&#x4E2A;&#x671F;&#x95F4;&#x5230;&#x5E95;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x9996;&#x5148;&#xFF0C;&#x4EFB;&#x4F55;exec()&#x6216;step()&#x7684;&#x8C03;&#x7528;&#x90FD;&#x53EF;&#x80FD;&#x8FDB;&#x5165;&#x7B49;&#x5F85;&#x3002;&#x5F53;SQLite&#x9047;&#x5230;&#x4E0D;&#x80FD;&#x83B7;&#x5F97;&#x9501;&#x7684;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x9ED8;&#x8BA4;&#x8868;&#x73B0;&#x603B;&#x662F;&#x5411;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;SQLITE_BUSY&#x5E76;&#x4F7F;&#x51FD;&#x6570;&#x7EE7;&#x7EED;&#x5BFB;&#x6C42;&#x9501;&#x3002;&#x65E0;&#x8BBA;&#x4F60;&#x6267;&#x884C;&#x4EC0;&#x4E48;&#x547D;&#x4EE4;&#xFF0C;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x9047;&#x5230;SQLITE_BUSY&#xFF0C;&#x5305;&#x62EC;SELECT&#x547D;&#x4EE4;&#xFF0C;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x6709;&#x5176;&#x5B83;&#x7684;&#x5199;&#x8FDB;&#x7A0B;&#x5904;&#x4E8E;&#x672A;&#x51B3;&#x72B6;&#x6001;&#x800C;&#x9047;&#x5230;SQLITE_BUSY&#x3002;&#x5F53;&#x9047;&#x5230;SQLITE_BUSY&#x65F6;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x9009;&#x62E9;&#x662F;&#x91CD;&#x8BD5;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<h3 id="&#x4F7F;&#x7528;&#x5FD9;&#x53E5;&#x67C4;">&#x4F7F;&#x7528;&#x201C;&#x5FD9;&#x201D;&#x53E5;&#x67C4;</h3>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5FD9;&#x53E5;&#x67C4;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x904D;&#x904D;&#x5730;&#x91CD;&#x8BD5;&#x3002;&#x5FD9;&#x53E5;&#x67C4;&#x662F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x521B;&#x5EFA;&#x5B83;&#x7528;&#x6765;&#x6D88;&#x78E8;&#x65F6;&#x95F4;&#x6216;&#x505A;&#x5176;&#x5B83;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x2014;&#x2014;&#x5982;&#x7ED9;&#x5CB3;&#x6BCD;&#x53D1;&#x4E00;&#x5C01;&#x90AE;&#x4EF6;(&#xFF1F;)&#x3002;&#x5B83;&#x4EC5;&#x5728;SQLite&#x4E0D;&#x80FD;&#x83B7;&#x5F97;&#x9501;&#x65F6;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x5FD9;&#x53E5;&#x67C4;&#x5FC5;&#x987B;&#x505A;&#x7684;&#x552F;&#x4E00;&#x7684;&#x4E8B;&#x662F;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x544A;&#x8BC9;SQLite&#x4E0B;&#x4E00;&#x6B65;&#x8BE5;&#x505A;&#x4EC0;&#x4E48;&#x3002;&#x5982;&#x679C;&#x5B83;&#x8FD4;&#x56DE;TRUE&#xFF0C;SQLite&#x5C06;&#x4F1A;&#x7EE7;&#x7EED;&#x5C1D;&#x8BD5;&#x83B7;&#x5F97;&#x9501;&#xFF1B;&#x5982;&#x679C;&#x5B83;&#x8FD4;&#x56DE;FALSE&#xFF0C;SQLite&#x5C06;&#x5411;&#x7533;&#x8BF7;&#x9501;&#x7684;&#x51FD;&#x6570;&#x8FD4;&#x56DE;SQLITE_BUSY&#x3002;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>counter = 1
def busy()
    counter = counter + 1
    if counter == 2
        return 0
    end
    spam_mother_in_law(100)
    return 1
end
db.busy_handler(busy)
stmt = db.prepare(&apos;SELECT * FROM episodes;&apos;)
stmt.step()
stmt.finalize()
</code></pre><p>spam_mother_in_law()&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x53D1;&#x90AE;&#x4EF6;&#x529F;&#x80FD;&#x3002;</p>
<p>step()&#x51FD;&#x6570;&#x5FC5;&#x987B;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;SHARED&#x9501;&#x4EE5;&#x5B8C;&#x6210;SELECT&#x64CD;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x6B64;&#x65F6;&#x6709;&#x4E00;&#x4E2A;&#x5199;&#x8FDB;&#x7A0B;&#x6D3B;&#x52A8;&#xFF0C;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;step()&#x4F1A;&#x8FD4;&#x56DE;SQLITE_BUSY&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x4E0A;&#x9762;&#x7A0B;&#x5E8F;&#x4E2D;&#x5374;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x800C;&#x662F;&#x7531;pager&#x8C03;&#x7528;busy()&#x51FD;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5DF2;&#x7ECF;&#x88AB;&#x6CE8;&#x518C;&#x961F;&#x5FD9;&#x53E5;&#x67C4;&#x3002;busy()&#x51FD;&#x6570;&#x589E;&#x52A0;&#x8BA1;&#x6570;&#xFF0C;&#x7ED9;&#x4F60;&#x5CB3;&#x6BCD;&#x53D1;&#x4E00;&#x5C01;&#x90AE;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x8FD4;&#x56DE;1&#xFF0C;&#x5728;pager&#x4E2D;&#x4F1A;&#x88AB;&#x7FFB;&#x8BD1;&#x6210;true&#x2014;&#x2014;&#x7EE7;&#x7EED;&#x7533;&#x8BF7;&#x9501;&#x3002;Pager&#x518D;&#x6B21;&#x7533;&#x8BF7;&#x83B7;&#x5F97;SHARED&#x9501;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x5E93;&#x4ECD;&#x7136;&#x88AB;&#x9501;&#x7740;&#xFF0C;&#x4E8E;&#x662F;pager&#x518D;&#x6B21;&#x8C03;&#x7528;busy()&#x51FD;&#x6570;&#x3002;&#x53EA;&#x6709;&#x6B64;&#x65F6;&#xFF0C;busy()&#x51FD;&#x6570;&#x8FD4;&#x56DE;0&#xFF0C;&#x5728;pager&#x4E2D;&#x4F1A;&#x88AB;&#x7FFB;&#x8BD1;&#x6210;false&#x2014;&#x2014;&#x8FD4;&#x56DE;SQLITE_BUSY&#x3002;</p>
<h3 id="&#x4F7F;&#x7528;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x52A1;">&#x4F7F;&#x7528;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x52A1;</h3>
<h2 id="&#x7F16;&#x7801;">&#x7F16;&#x7801;</h2>
<p>&#x73B0;&#x5728;&#xFF0C;&#x4F60;&#x5BF9;API&#x3001;&#x4E8B;&#x52A1;&#x548C;&#x9501;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x4E86;&#x89E3;&#x4E86;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FD9;3&#x4E2A;&#x5185;&#x5BB9;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x7ED3;&#x5408;&#x5230;&#x4E00;&#x8D77;&#x3002;</p>
<h2 id="&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x8FDE;&#x63A5;">&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x8FDE;&#x63A5;</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x66FE;&#x7ECF;&#x4E3A;&#x5176;&#x5B83;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7F16;&#x5199;&#x8FC7;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x6709;&#x4E9B;&#x9002;&#x7528;&#x4E8E;&#x90A3;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x65B9;&#x6CD5;&#x4E0D;&#x4E00;&#x5B9A;&#x9002;&#x7528;&#x4E8E;SQLite&#x3002;&#x4F7F;&#x7528;&#x5176;&#x5B83;&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#x4E2D;&#x6253;&#x5F00;&#x591A;&#x4E2A;&#x8FDE;&#x63A5;&#xFF0C;&#x5178;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x4E2D;&#x8FD4;&#x590D;&#x904D;&#x5386;&#x4E00;&#x4E2A;&#x8868;&#x800C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x4E2D;&#x4FEE;&#x6539;&#x5B83;&#x7684;&#x8BB0;&#x5F55;&#x3002;</p>
<p>&#x5728;SQLite&#x4E2D;&#xFF0C;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#x4E2D;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x8FDE;&#x63A5;&#x4F1A;&#x5F15;&#x8D77;&#x95EE;&#x9898;&#xFF0C;&#x5FC5;&#x987B;&#x5C0F;&#x5FC3;&#x5730;&#x5BF9;&#x5F85;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x8BF7;&#x770B;&#x4E0B;&#x9762;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>c1 = open(&apos;foods.db&apos;)
c2 = open(&apos;foods.db&apos;)
stmt = c1.prepare(&apos;SELECT * FROM episodes&apos;)
while stmt.step()
    print stmt.column(&apos;name&apos;)
    c2.exec(&apos;UPDATE episodes SET &#x2026;)
end
stmt.finalize()
c1.close()
c2.close()
</code></pre><p>&#x95EE;&#x9898;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5F53;c2&#x8BD5;&#x56FE;&#x6267;&#x884C;UPDATE&#x65F6;&#xFF0C;c1&#x62E5;&#x6709;&#x4E00;&#x4E2A;SHARED&#x9501;&#xFF0C;&#x8FD9;&#x4E2A;&#x9501;&#x53EA;&#x6709;&#x7B49;stmt.finalize()&#x4E4B;&#x540E;&#x624D;&#x4F1A;&#x91CA;&#x653E;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x6210;&#x529F;&#x5199;&#x6570;&#x636E;&#x5E93;&#x7684;&#x3002;&#x6700;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x4E2D;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x540C;&#x4E00;&#x4E2A;BEGIN IMMEDIATE&#x4E8B;&#x52A1;&#x4E2D;&#x5B8C;&#x6210;&#x3002;&#x65B0;&#x7A0B;&#x5E8F;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>c1 = open(&apos;foods.db&apos;)
# Keep trying until we get it
while c1.exec(&apos;BEGIN IMMEDIATE&apos;) != SQLITE_OK
end
stmt = c1.prepare(&apos;SELECT * FROM episodes&apos;)
while stmt.step()
    print stmt.column(&apos;name&apos;)
    c1.exec(&apos;UPDATE episodes SET &#x2026;)
end
stmt.finalize()
c1.exec(&apos;COMMIT&apos;)
c1.close()
</code></pre><p>&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5728;&#x5355;&#x72EC;&#x7684;&#x8FDE;&#x63A5;&#x4E2D;&#x4F7F;&#x7528;&#x8BED;&#x53E5;(statement)&#x6765;&#x5B8C;&#x6210;&#x8BFB;&#x548C;&#x5199;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x6570;&#x636E;&#x5E93;&#x9501;&#x4F1A;&#x5F15;&#x53D1;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x7279;&#x522B;&#x7684;&#x793A;&#x4F8B;&#x4ECD;&#x7136;&#x4E0D;&#x80FD;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;(statement)&#x4E2D;&#x8FD4;&#x590D;&#x904D;&#x5386;&#x4E00;&#x4E2A;&#x8868;&#x800C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x4E2D;&#x4FEE;&#x6539;&#x5B83;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x9644;&#x52A0;&#x7684;&#x9501;&#x95EE;&#x9898;&#x4F60;&#x9700;&#x8981;&#x4E86;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x3002;</p>
<h2 id="&#x8868;&#x9501;">&#x8868;&#x9501;</h2>
<p>&#x5373;&#x4F7F;&#x53EA;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#xFF0C;&#x5728;&#x6709;&#x4E9B;&#x8FB9;&#x754C;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x4F1A;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x8981;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x8BED;&#x53E5;(statements)&#x5C31;&#x80FD;&#x534F;&#x8C03;&#x5DE5;&#x4F5C;&#xFF0C;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x4F8B;&#x5916;&#x3002;</p>
<p>&#x5F53;&#x5728;&#x4E00;&#x4E2A;&#x8868;&#x4E0A;&#x6267;&#x884C;&#x4E86;SELECT&#x547D;&#x4EE4;&#xFF0C;&#x8BED;&#x53E5;&#x5BF9;&#x8C61;&#x4F1A;&#x5728;&#x8868;&#x4E0A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;B-tree&#x6E38;&#x6807;&#x3002;&#x5982;&#x679C;&#x8868;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x6D3B;&#x52A8;&#x7684;B-tree&#x6E38;&#x6807;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x672C;&#x8FDE;&#x63A5;&#x4E2D;&#x7684;&#x5176;&#x5B83;&#x8BED;&#x53E5;&#x4E5F;&#x4E0D;&#x80FD;&#x591F;&#x518D;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;&#x8868;&#x3002;&#x5982;&#x679C;&#x505A;&#x8FD9;&#x79CD;&#x5C1D;&#x8BD5;&#xFF0C;&#x5C06;&#x4F1A;&#x5F97;&#x5230;SQLITE_BUSY&#x3002;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>c = sqlite.open(&quot;foods.db&quot;)
stmt1 = c.compile(&apos;SELECT * FROM episodes LIMIT 10&apos;)
while stmt1.step() do
    # Try to update the row
    row = stm1.row()
    stmt2 = c.compile(&apos;UPDATE episodes SET &#x2026;&apos;)
    # Uh oh: ain&apos;t gonna happen
    stmt2.step()
end
stmt1.finalize()
stmt2.finalize ()
c.close()
</code></pre><p>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EA;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x3002;&#x4F46;&#x5F53;&#x8C03;&#x7528;stmt2.step()&#x5219;&#x4E0D;&#x4F1A;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;stmt1&#x62E5;&#x6709;episodes&#x8868;&#x7684;&#x4E00;&#x4E2A;&#x6E38;&#x6807;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;stmt2.step()&#x6709;&#x53EF;&#x80FD;&#x6210;&#x529F;&#x5730;&#x5C06;&#x9501;&#x5347;&#x7EA7;&#x5230;EXCLUSIVE&#xFF0C;&#x4F46;&#x4ECD;&#x4F1A;&#x8FD4;&#x56DE;SQLITE_BUSY&#xFF0C;&#x56E0;&#x4E3A;episodes&#x7684;&#x6E38;&#x6807;&#x4F1A;&#x963B;&#x6B62;&#x5B83;&#x4FEE;&#x6539;&#x8868;&#x3002;&#x5B8C;&#x6210;&#x8FD9;&#x79CD;&#x64CD;&#x4F5C;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ul>
<li><p>&#x904D;&#x5386;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x7684;&#x7ED3;&#x679C;&#x96C6;&#xFF0C;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x5B58;&#x9700;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5B9A;&#x6848;&#x8FD9;&#x4E2A;&#x8BFB;&#x8BED;&#x53E5;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x4FEE;&#x6539;&#x64CD;&#x4F5C;&#x3002;</p>
</li>
<li><p>&#x5C06;SELECT&#x7684;&#x7ED3;&#x679C;&#x5B58;&#x5230;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x8868;&#x4E2D;&#x5E76;&#x7528;&#x8BFB;&#x6E38;&#x6807;&#x6253;&#x5F00;&#x5B83;&#x3002;&#x8FD9;&#x65F6;&#x540C;&#x65F6;&#x6709;&#x4E00;&#x4E2A;&#x8BFB;&#x8BED;&#x53E5;&#x548C;&#x4E00;&#x4E2A;&#x5199;&#x8BED;&#x53E5;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x4E0A;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x4E3B;&#x8868;&#x4E0A;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x3002;&#x5199;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x5220;&#x6389;&#x4E34;&#x65F6;&#x8868;&#x5C31;&#x662F;&#x4E86;&#x3002;</p>
</li>
</ul>
<p>&#x5F53;&#x8868;&#x4E0A;&#x6253;&#x5F00;&#x4E86;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#xFF0C;&#x5B83;&#x7684;B-tree&#x6E38;&#x6807;&#x5728;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x88AB;&#x79FB;&#x9664;&#xFF1A;</p>
<ul>
<li><p>&#x5230;&#x8FBE;&#x4E86;&#x8BED;&#x53E5;&#x7ED3;&#x679C;&#x96C6;&#x7684;&#x5C3E;&#x90E8;&#x3002;&#x8FD9;&#x65F6;step()&#x4F1A;&#x81EA;&#x52A8;&#x5730;&#x5173;&#x95ED;&#x8BED;&#x53E5;&#x7684;&#x6E38;&#x6807;&#x3002;&#x4ECE;VDBE&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x5F53;&#x5230;&#x8FBE;&#x7ED3;&#x679C;&#x96C6;&#x7684;&#x5C3E;&#x90E8;&#x65F6;&#xFF0C;CDBE&#x9047;&#x5230;Close&#x547D;&#x4EE4;&#xFF0C;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x6240;&#x6709;&#x76F8;&#x5173;&#x6E38;&#x6807;&#x7684;&#x5173;&#x95ED;&#x3002;</p>
</li>
<li><p>&#x7A0B;&#x5E8F;&#x663E;&#x5F0F;&#x5730;&#x8C03;&#x7528;&#x4E86;finalize()&#xFF0C;&#x6240;&#x6709;&#x76F8;&#x5173;&#x6E38;&#x6807;&#x5C06;&#x5173;&#x95ED;&#x3002;</p>
</li>
</ul>
<p>&#x5728;&#x5F88;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6269;&#x5C55;&#x4E2D;&#xFF0C;statement&#x5BF9;&#x8C61;&#x7684;close()&#x51FD;&#x6570;&#x4F1A;&#x81EA;&#x52A8;&#x8C03;&#x7528;sqlite3_finalize()&#x3002;</p>
<h2 id="&#x6709;&#x8DA3;&#x7684;&#x4E34;&#x65F6;&#x8868;">&#x6709;&#x8DA3;&#x7684;&#x4E34;&#x65F6;&#x8868;</h2>
<p>&#x4E34;&#x65F6;&#x8868;&#x4F7F;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x4E0D;&#x8FDD;&#x53CD;&#x89C4;&#x5219;&#x3002;&#x5982;&#x679C;&#x4F60;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x5728;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#x4E2D;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x8FDE;&#x63A5;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x8BED;&#x53E5;(statement)&#x64CD;&#x4F5C;&#x540C;&#x4E00;&#x4E2A;&#x8868;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x5728;&#x4E34;&#x65F6;&#x8868;&#x4E0A;&#x5982;&#x6B64;&#x505A;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x8868;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5F97;&#x5230;RESERVED&#x9501;&#xFF0C;&#x56E0;&#x4E3A;&#x4E34;&#x65F6;&#x8868;&#x5B58;&#x5728;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x4E4B;&#x5916;&#x3002;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x770B;&#x4F60;&#x60F3;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x5E76;&#x53D1;&#x3002;&#x8BF7;&#x770B;&#x5982;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>c1 = open(&apos;foods.db&apos;)
c2 = open(&apos;foods.db&apos;)
c2.exec(&apos;CREATE TEMPORARY TABLE temp_epsidodes as SELECT * from episodes&apos;)
stmt = c1.prepare(&apos;SELECT * FROM episodes&apos;)
while stmt.step()
    print stmt.column(&apos;name&apos;)
    c2.exec(&apos;UPDATE temp_episodes SET &#x2026;&apos;)
end
stmt.finalize()
c2.exec(&apos;BEGIN IMMEDIATE&apos;)
c2.exec(&apos;DELETE FROM episodes&apos;)
c2.exec(&apos;INSERT INTO episodes SELECT * FROM temp_episodes&apos;)
c2.exec(&apos;COMMIT&apos;)
c1.close()
c2.close()
</code></pre><p>&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x4E0D;&#x597D;&#x3002;episodes&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x8981;&#x5168;&#x90E8;&#x5220;&#x9664;&#x5E76;&#x91CD;&#x5EFA;&#xFF0C;&#x8FD9;&#x5C06;&#x4E22;&#x5931;episodes&#x8868;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5B8C;&#x6574;&#x6027;&#x7EA6;&#x675F;&#x548C;&#x7D22;&#x5F15;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#x6BD4;&#x8F83;&#x597D;&#xFF1A;</p>
<pre><code>c1 = open(&apos;foods.db&apos;)
c2 = open(&apos;foods.db&apos;)
c1.exec(&apos;CREATE TEMPORARY TABLE temp_episodes as SELECT * from episodes&apos;)
stmt = c1.prepare(&apos;SELECT * FROM temp_episodes&apos;)
while stmt.step()
    print stmt.column(&apos;name&apos;)
    c2.exec(&apos;UPDATE episodes SET &#x2026;&apos;) # What about SQLITE_BUSY?
end
stmt.finalize()
c1.exec(&apos;DROP TABLE temp_episodes&apos;)
c1.close()
c2.close()
</code></pre><h2 id="&#x5B9A;&#x6848;&#x7684;&#x91CD;&#x8981;&#x6027;">&#x5B9A;&#x6848;&#x7684;&#x91CD;&#x8981;&#x6027;</h2>
<p>&#x4F7F;&#x7528;SELECT&#x8BED;&#x53E5;&#x5FC5;&#x987B;&#x8981;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x5176;SHARED&#x9501;(&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;)&#x76F4;&#x5230;finalize()&#x88AB;&#x8C03;&#x7528;&#x540E;&#x624D;&#x4F1A;&#x91CA;&#x653E;&#xFF0C;&#x8BF7;&#x770B;&#x4E0B;&#x9762;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>stmt = c1.prepare(&apos;SELECT * FROM episodes&apos;)
while stmt.step()
    print stmt.column(&apos;name&apos;)
end
c2.exec(&apos;BEGIN IMMEDIATE; UPDATE episodes SET &#x2026;; COMMIT;&apos;)
stmt.finalize()
</code></pre><p>&#x5982;&#x679C;&#x4F60;&#x7528;C API&#x5199;&#x4E86;&#x4E0E;&#x4E0A;&#x4F8B;&#x7B49;&#x4EF7;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x80FD;&#x591F;&#x5DE5;&#x4F5C;&#x7684;&#x3002;&#x5C3D;&#x7BA1;&#x6CA1;&#x6709;&#x8C03;&#x7528;finalize()&#xFF0C;&#x4F46;&#x7B2C;&#x4E8C;&#x4E2A;&#x8FDE;&#x63A5;&#x4ECD;&#x7136;&#x80FD;&#x591F;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x5E93;&#x3002;&#x5728;&#x544A;&#x8BC9;&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x6765;&#x770B;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>c1 = open(&apos;foods.db&apos;)
c2 = open(&apos;foods.db&apos;)
stmt = c1.prepare(&apos;SELECT * FROM episodes&apos;)
stmt.step()
stmt.step()
stmt.step()
c2.exec(&apos;BEGIN IMMEDIATE; UPDATE episodes SET &#x2026;; COMMIT;&apos;)
stmt.finalize()
</code></pre><p>&#x5047;&#x8BBE;episodes&#x4E2D;&#x6709;100&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x7A0B;&#x5E8F;&#x4EC5;&#x4EC5;&#x8BBF;&#x95EE;&#x4E86;&#x5176;&#x4E2D;&#x7684;3&#x6761;&#xFF0C;&#x8FD9;&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x5462;&#xFF1F;&#x7B2C;2&#x4E2A;&#x8FDE;&#x63A5;&#x4F1A;&#x5F97;&#x5230;SQLITE_BUSY&#x3002;</p>
<p>&#x5728;&#x7B2C;1&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5F53;&#x5230;&#x8FBE;&#x8BED;&#x53E5;&#x7ED3;&#x679C;&#x96C6;&#x5C3E;&#x90E8;&#x65F6;&#xFF0C;&#x4F1A;&#x91CA;&#x653E;SHARED&#x9501;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD8;&#x6CA1;&#x6709;&#x8C03;&#x7528;finalize()&#x3002;&#x5728;&#x7B2C;2&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x5230;&#x8FBE;&#x8BED;&#x53E5;&#x7ED3;&#x679C;&#x96C6;&#x5C3E;&#x90E8;&#xFF0C;SHARED&#x9501;&#x6CA1;&#x6709;&#x91CA;&#x653E;&#x3002;&#x6240;&#x4EE5;&#xFF0C;c2&#x4E0D;&#x80FD;&#x6267;&#x884C;UPDATE&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x7684;&#x4E2D;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#xFF1A;&#x4E0D;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x5C3D;&#x7BA1;&#x6709;&#x65F6;&#x8FD9;&#x4E48;&#x505A;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x5728;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x8FDB;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x6C38;&#x8FDC;&#x8981;&#x5148;&#x8C03;&#x7528;finalize()&#x3002;</p>
<h2 id="&#x5171;&#x4EAB;&#x7F13;&#x51B2;&#x533A;&#x6A21;&#x5F0F;">&#x5171;&#x4EAB;&#x7F13;&#x51B2;&#x533A;&#x6A21;&#x5F0F;</h2>
<p>&#x73B0;&#x5728;&#x4F60;&#x5BF9;&#x5E76;&#x53D1;&#x89C4;&#x5219;&#x5DF2;&#x7ECF;&#x5F88;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x4F46;&#x6211;&#x8FD8;&#x8981;&#x627E;&#x4E9B;&#x4E8B;&#x6765;&#x6270;&#x4E71;&#x4F60;&#x3002;SQLite&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x53EF;&#x9009;&#x7684;&#x5E76;&#x53D1;&#x6A21;&#x5F0F;&#xFF0C;&#x79F0;&#x4E3A;&#x5171;&#x4EAB;&#x7F13;&#x51B2;&#x533A;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x5728;&#x5355;&#x4E00;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x64CD;&#x4F5C;&#x591A;&#x4E2A;&#x8FDE;&#x63A5;&#x3002;</p>
<p>&#x5728;&#x5171;&#x4EAB;&#x7F13;&#x51B2;&#x533A;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x8FDE;&#x63A5;&#x6765;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x7684;&#x9875;&#x7F13;&#x51B2;&#x533A;&#x3002;&#x8FDB;&#x800C;&#xFF0C;&#x8FD9;&#x7EC4;&#x8FDE;&#x63A5;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x201C;&#x8BFB;&#x201D;&#x548C;&#x4E00;&#x4E2A;&#x201C;&#x5199;&#x201D;&#x540C;&#x65F6;&#x5DE5;&#x4F5C;&#x4E8E;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;&#x7F13;&#x51B2;&#x533A;&#x4E0D;&#x80FD;&#x5728;&#x7EBF;&#x7A0B;&#x95F4;&#x5171;&#x4EAB;&#xFF0C;&#x5B83;&#x88AB;&#x4E25;&#x683C;&#x5730;&#x9650;&#x5236;&#x5728;&#x521B;&#x5EFA;&#x5B83;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x201C;&#x8BFB;&#x201D;&#x548C;&#x201C;&#x5199;&#x201D;&#x5C31;&#x9700;&#x8981;&#x51C6;&#x5907;&#x5904;&#x7406;&#x4E0E;&#x8868;&#x9501;&#x6709;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x5F53; readers&#x8BFB;&#x8868;&#x65F6;&#xFF0C; SQLite&#x81EA;&#x52A8;&#x5728;&#x8FD9;&#x4E9B;&#x8868;&#x4E0A;&#x52A0;&#x9501;&#xFF0C;writer&#x5C31;&#x4E0D;&#x80FD;&#x518D;&#x6539;&#x8FD9;&#x4E9B;&#x8868;&#x4E86;&#x3002;&#x5982;&#x679C;writer&#x8BD5;&#x56FE;&#x4FEE;&#x6539;&#x4E00;&#x4E2A;&#x6709;&#x8BFB;&#x9501;&#x7684;&#x8868;&#xFF0C;&#x4F1A;&#x5F97;&#x5230;SQLITE_LOCKED&#x3002;&#x5982;&#x679C;readers&#x8FD0;&#x884C;&#x5728;read-uncommitted&#x6A21;&#x5F0F;(&#x901A;&#x8FC7;read_uncommitted pragma&#x6765;&#x8BBE;&#x7F6E;)&#xFF0C;&#x5219;&#x5F53;readers&#x8BFB;&#x8868;&#x65F6;&#xFF0C;writer&#x4E5F;&#x53EF;&#x4EE5;&#x5199;&#x8868;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;SQLite&#x4E0D;&#x4E3A;readers&#x6240;&#x8BFB;&#x7684;&#x8868;&#x52A0;&#x8BFB;&#x9501;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x662F;readers&#x548C;writer&#x4E92;&#x4E0D;&#x5E72;&#x6270;&#x3002;&#x4E5F;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;writer&#x4FEE;&#x6539;&#x8868;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;readers&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="./6.html" class="navigation navigation-prev " aria-label="Previous page: 第4章  SQL"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="./8.html" class="navigation navigation-next " aria-label="Next page: 第6章  核心C API"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-comment/plugin.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"comment":{"highlightCommented":true},"autocover":{},"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
