<!DOCTYPE HTML>
<html lang="zh-tw" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>k-means | 数据挖掘十大算法详解</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        <meta name="author" content="wizardforcel">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-comment/plugin.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="./svm.html" />
    
    
    <link rel="prev" href="./c4.5.html" />
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="2"
        data-chapter-title="k-means"
        data-filepath="k-means.md"
        data-basepath="."
        data-revision="Thu Feb 11 2016 09:20:12 GMT+0000 (UTC)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
                
                <li>
                    <a href="https://www.gitbook.com/book/wizardforcel/dm-algo-top10" target="blank" class="custom-link">数据挖掘十大算法详解</a>
                </li>
            
            

            
            <li class="divider"></li>
            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        介紹
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="c4.5.html">
            
                
                    <a href="./c4.5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        C4.5
                    </a>
            
            
        </li>
    
        <li class="chapter active" data-level="2" data-path="k-means.html">
            
                
                    <a href="./k-means.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        k-means
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="svm.html">
            
                
                    <a href="./svm.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        SVM
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="3.1" data-path="svm-1.html">
            
                
                    <a href="./svm-1.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.1.</b>
                        
                        支持向量机
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="svm-2.html">
            
                
                    <a href="./svm-2.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.2.</b>
                        
                        拉格朗日对偶
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="svm-3.html">
            
                
                    <a href="./svm-3.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.3.</b>
                        
                        最优间隔分类器
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="svm-4.html">
            
                
                    <a href="./svm-4.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.4.</b>
                        
                        核函数
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="svm-5.html">
            
                
                    <a href="./svm-5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.5.</b>
                        
                        SMO算法详解
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="4" data-path="apriori.html">
            
                
                    <a href="./apriori.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        Apriori
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="em.html">
            
                
                    <a href="./em.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        EM
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="pagerank.html">
            
                
                    <a href="./pagerank.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        PageRank
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="7" data-path="adaboost.html">
            
                
                    <a href="./adaboost.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        AdaBoost
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="knn.html">
            
                
                    <a href="./knn.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        kNN
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="9" data-path="naive-bayes.html">
            
                
                    <a href="./naive-bayes.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>9.</b>
                        
                        Naive Bayes
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="10" data-path="cart.html">
            
                
                    <a href="./cart.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>10.</b>
                        
                        CART
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    本書使用 GitBook 釋出
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >数据挖掘十大算法详解</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x6570;&#x636E;&#x6316;&#x6398;&#x5341;&#x5927;&#x7B97;&#x6CD5;k&#x5747;&#x503C;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;">&#x6570;&#x636E;&#x6316;&#x6398;&#x5341;&#x5927;&#x7B97;&#x6CD5;--K-&#x5747;&#x503C;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;</h1>
<blockquote>
<p>&#x6765;&#x6E90;&#xFF1A;<a href="http://blog.csdn.net/u011067360/article/details/24383051" target="_blank">http://blog.csdn.net/u011067360/article/details/24383051</a></p>
</blockquote>
<p><strong>&#x4E00;&#x3001;&#x76F8;&#x5F02;&#x5EA6;&#x8BA1;&#x7B97; </strong></p>
<p>&#x5728;&#x6B63;&#x5F0F;&#x8BA8;&#x8BBA;&#x805A;&#x7C7B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x5148;&#x5F04;&#x6E05;&#x695A;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x4F55;&#x5B9A;&#x91CF;&#x8BA1;&#x7B97;&#x4E24;&#x4E2A;&#x53EF;&#x6BD4;&#x8F83;&#x5143;&#x7D20;&#x95F4;&#x7684;&#x76F8;&#x5F02;&#x5EA6;&#x3002;&#x7528;&#x901A;&#x4FD7;&#x7684;&#x8BDD;&#x8BF4;&#xFF0C;&#x76F8;&#x5F02;&#x5EA6;&#x5C31;&#x662F;&#x4E24;&#x4E2A;&#x4E1C;&#x897F;&#x5DEE;&#x522B;&#x6709;&#x591A;&#x5927;&#xFF0C;&#x4F8B;&#x5982;&#x4EBA;&#x7C7B;&#x4E0E;&#x7AE0;&#x9C7C;&#x7684;&#x76F8;&#x5F02;&#x5EA6;&#x660E;&#x663E;&#x5927;&#x4E8E;&#x4EBA;&#x7C7B;&#x4E0E;&#x9ED1;&#x7329;&#x7329;&#x7684;&#x76F8;&#x5F02;&#x5EA6;&#xFF0C;&#x8FD9;&#x662F;&#x80FD;&#x6211;&#x4EEC;&#x76F4;&#x89C2;&#x611F;&#x53D7;&#x5230;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x6CA1;&#x6709;&#x8FD9;&#x79CD;&#x76F4;&#x89C2;&#x611F;&#x53D7;&#x80FD;&#x529B;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5BF9;&#x76F8;&#x5F02;&#x5EA6;&#x5728;&#x6570;&#x5B66;&#x4E0A;&#x8FDB;&#x884C;&#x5B9A;&#x91CF;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x8BBE;<img src="img/20140423195257421.jpg" alt=""> &#xFF0C;&#x5176;&#x4E2D;X&#xFF0C;Y&#x662F;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x9879;&#xFF0C;&#x5404;&#x81EA;&#x5177;&#x6709;n&#x4E2A;&#x53EF;&#x5EA6;&#x91CF;&#x7279;&#x5F81;&#x5C5E;&#x6027;&#xFF0C;&#x90A3;&#x4E48;X&#x548C;Y&#x7684;&#x76F8;&#x5F02;&#x5EA6;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;</p>
<p><img src="img/20140423195321906.jpg" alt=""> &#xFF0C;&#x5176;&#x4E2D;R&#x4E3A;&#x5B9E;&#x6570;&#x57DF;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x76F8;&#x5F02;&#x5EA6;&#x662F;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x5BF9;&#x5B9E;&#x6570;&#x57DF;&#x7684;&#x4E00;&#x4E2A;&#x6620;&#x5C04;&#xFF0C;&#x6240;&#x6620;&#x5C04;&#x7684;&#x5B9E;&#x6570;&#x5B9A;&#x91CF;&#x8868;&#x793A;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x76F8;&#x5F02;&#x5EA6;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x76F8;&#x5F02;&#x5EA6;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x3002;</p>
<p><strong>1&#x3001;&#x6807;&#x91CF;</strong></p>
<p>&#xFF08;1&#xFF09;&#x6807;&#x91CF;&#x4E5F;&#x5C31;&#x662F;&#x65E0;&#x65B9;&#x5411;&#x610F;&#x4E49;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x4E5F;&#x53EB;&#x6807;&#x5EA6;&#x53D8;&#x91CF;&#x3002;&#x73B0;&#x5728;&#x5148;&#x8003;&#x8651;&#x5143;&#x7D20;&#x7684;&#x6240;&#x6709;&#x7279;&#x5F81;&#x5C5E;&#x6027;&#x90FD;&#x662F;&#x6807;&#x91CF;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8BA1;&#x7B97;X={2,1,102}&#x548C;Y={1,3,2}&#x7684;&#x76F8;&#x5F02;&#x5EA6;&#x3002;&#x4E00;&#x79CD;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x60F3;&#x6CD5;&#x662F;&#x7528;&#x4E24;&#x8005;&#x7684;&#x6B27;&#x51E0;&#x91CC;&#x5F97;&#x8DDD;&#x79BB;&#x6765;&#x4F5C;&#x4E3A;&#x76F8;&#x5F02;&#x5EA6;&#xFF0C;&#x6B27;&#x51E0;&#x91CC;&#x5F97;&#x8DDD;&#x79BB;&#x7684;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="img/20140423195616406.jpg" alt=""></p>
<p>&#x5176;&#x610F;&#x4E49;&#x5C31;&#x662F;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x5728;&#x6B27;&#x6C0F;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x96C6;&#x5408;&#x8DDD;&#x79BB;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x76F4;&#x89C2;&#x6613;&#x61C2;&#x4E14;&#x53EF;&#x89E3;&#x91CA;&#x6027;&#x5F3A;&#xFF0C;&#x88AB;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x6807;&#x8BC6;&#x4E24;&#x4E2A;&#x6807;&#x91CF;&#x5143;&#x7D20;&#x7684;&#x76F8;&#x5F02;&#x5EA6;&#x3002;&#x5C06;&#x4E0A;&#x9762;&#x4E24;&#x4E2A;&#x793A;&#x4F8B;&#x6570;&#x636E;&#x4EE3;&#x5165;&#x516C;&#x5F0F;&#xFF0C;&#x53EF;&#x5F97;&#x4E24;&#x8005;&#x7684;&#x6B27;&#x6C0F;&#x8DDD;&#x79BB;&#x4E3A;&#xFF1A;</p>
<p><img src="img/20140423195626062.jpg" alt=""></p>
<p>&#x9664;&#x6B27;&#x6C0F;&#x8DDD;&#x79BB;&#x5916;&#xFF0C;&#x5E38;&#x7528;&#x4F5C;&#x5EA6;&#x91CF;&#x6807;&#x91CF;&#x76F8;&#x5F02;&#x5EA6;&#x7684;&#x8FD8;&#x6709;&#x66FC;&#x54C8;&#x987F;&#x8DDD;&#x79BB;&#x548C;&#x95F5;&#x53EF;&#x592B;&#x65AF;&#x57FA;&#x8DDD;&#x79BB;&#xFF0C;&#x4E24;&#x8005;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#xFF08;2&#xFF09;&#x66FC;&#x54C8;&#x987F;&#x8DDD;&#x79BB;&#xFF1A;</p>
<p><img src="img/20140423195639031.jpg" alt=""></p>
<p>&#xFF08;3&#xFF09; &#x95F5;&#x53EF;&#x592B;&#x65AF;&#x57FA;&#x8DDD;&#x79BB;&#xFF1A;</p>
<p><img src="img/20140423195734265.jpg" alt=""></p>
<p>&#xFF08;4&#xFF09;&#x76AE;&#x5C14;&#x900A;&#x7CFB;&#x6570;(Pearson Correlation Coefficient)</p>
<p>&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x7684;&#x76AE;&#x5C14;&#x900A;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#x5B9A;&#x4E49;&#x4E3A;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x65B9;&#x5DEE;&#x548C;&#x6807;&#x51C6;&#x5DEE;&#x7684;&#x5546;.</p>
<p><img src="img/20140423201208000.jpg" alt=""></p>
<p>(&#x5176;&#x4E2D;&#xFF0C;E&#x4E3A;&#x6570;&#x5B66;&#x671F;&#x671B;&#x6216;&#x5747;&#x503C;&#xFF0C;D&#x4E3A;&#x65B9;&#x5DEE;&#xFF0C;D&#x5F00;&#x6839;&#x53F7;&#x4E3A;&#x6807;&#x51C6;&#x5DEE;&#xFF0C;E{ [X-ux] [Y-uy]}&#x79F0;&#x4E3A;&#x968F;&#x673A;&#x53D8;&#x91CF;X&#x4E0E;Y&#x7684;&#x534F;&#x65B9;&#x5DEE;&#xFF0C;&#x8BB0;&#x4E3A;Cov(X,Y)&#xFF0C;&#x5373;Cov(X,Y) = E{ [X-ux] [Y-ux]}&#xFF0C;&#x800C;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x65B9;&#x5DEE;&#x548C;&#x6807;&#x51C6;&#x5DEE;&#x7684;&#x5546;&#x5219;&#x79F0;&#x4E3A;&#x968F;&#x673A;&#x53D8;&#x91CF;X&#x4E0E;Y&#x7684;&#x76F8;&#x5173;&#x7CFB;&#x6570;&#xFF0C;&#x8BB0;&#x4E3A;<img src="img/1354710691_8305.jpg" alt=""></p>
<p>&#x6B27;&#x6C0F;&#x8DDD;&#x79BB;&#x548C;&#x66FC;&#x54C8;&#x987F;&#x8DDD;&#x79BB;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x662F;&#x95F5;&#x53EF;&#x592B;&#x65AF;&#x57FA;&#x8DDD;&#x79BB;&#x5728;p=2&#x548C;p=1&#x4E0B;&#x7684;&#x7279;&#x4F8B;&#x3002;&#x53E6;&#x5916;&#x8FD9;&#x4E09;&#x79CD;&#x8DDD;&#x79BB;&#x90FD;&#x53EF;&#x4EE5;&#x52A0;&#x6743;&#xFF0C;&#x8FD9;&#x4E2A;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x8981;&#x8BF4;&#x4E00;&#x4E0B;&#x6807;&#x91CF;&#x7684;&#x89C4;&#x683C;&#x5316;&#x95EE;&#x9898;&#x3002;&#x4E0A;&#x9762;&#x8FD9;&#x6837;&#x8BA1;&#x7B97;&#x76F8;&#x5F02;&#x5EA6;&#x7684;&#x65B9;&#x5F0F;&#x6709;&#x4E00;&#x70B9;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5927;&#x7684;&#x5C5E;&#x6027;&#x5BF9;&#x8DDD;&#x79BB;&#x7684;&#x5F71;&#x54CD;&#x9AD8;&#x4E8E;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5C0F;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x4F8B;&#x5982;&#x4E0A;&#x8FF0;&#x4F8B;&#x5B50;&#x4E2D;&#x7B2C;&#x4E09;&#x4E2A;&#x5C5E;&#x6027;&#x7684;&#x53D6;&#x503C;&#x8DE8;&#x5EA6;&#x8FDC;&#x5927;&#x4E8E;&#x524D;&#x4E24;&#x4E2A;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x5229;&#x4E8E;&#x771F;&#x5B9E;&#x53CD;&#x6620;&#x771F;&#x5B9E;&#x7684;&#x76F8;&#x5F02;&#x5EA6;&#xFF0C;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x822C;&#x8981;&#x5BF9;&#x5C5E;&#x6027;&#x503C;&#x8FDB;&#x884C;&#x89C4;&#x683C;&#x5316;&#x3002;</p>
<p>&#x6240;&#x8C13;&#x89C4;&#x683C;&#x5316;&#x5C31;&#x662F;&#x5C06;&#x5404;&#x4E2A;&#x5C5E;&#x6027;&#x503C;&#x6309;&#x6BD4;&#x4F8B;&#x6620;&#x5C04;&#x5230;&#x76F8;&#x540C;&#x7684;&#x53D6;&#x503C;&#x533A;&#x95F4;&#xFF0C;&#x8FD9;&#x6837;&#x662F;&#x4E3A;&#x4E86;&#x5E73;&#x8861;&#x5404;&#x4E2A;&#x5C5E;&#x6027;&#x5BF9;&#x8DDD;&#x79BB;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x901A;&#x5E38;&#x5C06;&#x5404;&#x4E2A;&#x5C5E;&#x6027;&#x5747;&#x6620;&#x5C04;&#x5230;[0,1]&#x533A;&#x95F4;&#xFF0C;&#x6620;&#x5C04;&#x516C;&#x5F0F;&#x4E3A;&#xFF1A;</p>
<p><img src="img/20140423195834187.jpg" alt=""></p>
<p>&#x5176;&#x4E2D;max(ai)&#x548C;min(ai)&#x8868;&#x793A;&#x6240;&#x6709;&#x5143;&#x7D20;&#x9879;&#x4E2D;&#x7B2C;i&#x4E2A;&#x5C5E;&#x6027;&#x7684;&#x6700;&#x5927;&#x503C;&#x548C;&#x6700;&#x5C0F;&#x503C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5C06;&#x793A;&#x4F8B;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x89C4;&#x683C;&#x5316;&#x5230;[0,1]&#x533A;&#x95F4;&#x540E;&#xFF0C;&#x5C31;&#x53D8;&#x6210;&#x4E86;X&#x2019;={1,0,1}&#xFF0C;Y&#x2019;={0,1,0}&#xFF0C;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x6B27;&#x6C0F;&#x8DDD;&#x79BB;&#x7EA6;&#x4E3A;1.732&#x3002;</p>
<p><strong>2&#x3001;&#x4E8C;&#x5143;&#x53D8;&#x91CF;</strong></p>
<p>&#x6240;&#x8C13;&#x4E8C;&#x5143;&#x53D8;&#x91CF;&#x662F;&#x53EA;&#x80FD;&#x53D6;0&#x548C;1&#x4E24;&#x79CD;&#x503C;&#x53D8;&#x91CF;&#xFF0C;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x901A;&#x5E38;&#x7528;&#x6765;&#x6807;&#x8BC6;&#x662F;&#x6216;&#x4E0D;&#x662F;&#x8FD9;&#x79CD;&#x4E8C;&#x503C;&#x5C5E;&#x6027;&#x3002;&#x5BF9;&#x4E8E;&#x4E8C;&#x5143;&#x53D8;&#x91CF;&#xFF0C;&#x4E0A;&#x4E00;&#x8282;&#x63D0;&#x5230;&#x7684;&#x8DDD;&#x79BB;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x6807;&#x8BC6;&#x5176;&#x76F8;&#x5F02;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x66F4;&#x9002;&#x5408;&#x7684;&#x6807;&#x8BC6;&#x3002;&#x4E00;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x7528;&#x5143;&#x7D20;&#x76F8;&#x540C;&#x5E8F;&#x4F4D;&#x540C;&#x503C;&#x5C5E;&#x6027;&#x7684;&#x6BD4;&#x4F8B;&#x6765;&#x6807;&#x8BC6;&#x5176;&#x76F8;&#x5F02;&#x5EA6;&#x3002;</p>
<p>&#x8BBE;&#x6709;X={1,0,0,0,1,0,1,1}&#xFF0C;Y={0,0,0,1,1,1,1,1}&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x7B2C;2&#x3001;3&#x3001;5&#x3001;7&#x548C;8&#x4E2A;&#x5C5E;&#x6027;&#x53D6;&#x503C;&#x76F8;&#x540C;&#xFF0C;&#x800C;&#x7B2C;1&#x3001;4&#x548C;6&#x4E2A;&#x53D6;&#x503C;&#x4E0D;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x76F8;&#x5F02;&#x5EA6;&#x53EF;&#x4EE5;&#x6807;&#x8BC6;&#x4E3A;3/8=0.375&#x3002;&#x4E00;&#x822C;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E8C;&#x5143;&#x53D8;&#x91CF;&#xFF0C;&#x76F8;&#x5F02;&#x5EA6;&#x53EF;&#x7528;&#x201C;<strong>&#x53D6;&#x503C;&#x4E0D;&#x540C;&#x7684;&#x540C;&#x4F4D;&#x5C5E;&#x6027;&#x6570;/&#x5355;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5C5E;&#x6027;&#x4F4D;&#x6570;</strong>&#x201D;&#x6807;&#x8BC6;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x6240;&#x8BF4;&#x7684;&#x76F8;&#x5F02;&#x5EA6;&#x5E94;&#x8BE5;&#x53EB;&#x505A;&#x5BF9;&#x79F0;&#x4E8C;&#x5143;&#x76F8;&#x5F02;&#x5EA6;&#x3002;&#x73B0;&#x5B9E;&#x4E2D;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x53EA;&#x5173;&#x5FC3;&#x4E24;&#x8005;&#x90FD;&#x53D6;1&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x800C;&#x8BA4;&#x4E3A;&#x4E24;&#x8005;&#x90FD;&#x53D6;0&#x7684;&#x5C5E;&#x6027;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4E24;&#x8005;&#x66F4;&#x76F8;&#x4F3C;&#x3002;&#x4F8B;&#x5982;&#x5728;&#x6839;&#x636E;&#x75C5;&#x60C5;&#x5BF9;&#x75C5;&#x4EBA;&#x805A;&#x7C7B;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4EBA;&#x90FD;&#x60A3;&#x6709;&#x80BA;&#x764C;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x4E24;&#x4E2A;&#x4EBA;&#x589E;&#x5F3A;&#x4E86;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4EBA;&#x90FD;&#x6CA1;&#x60A3;&#x80BA;&#x764C;&#xFF0C;&#x5E76;&#x4E0D;&#x89C9;&#x5F97;&#x8FD9;&#x52A0;&#x5F3A;&#x4E86;&#x4E24;&#x4EBA;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6539;&#x7528;&#x201C;<strong>&#x53D6;&#x503C;&#x4E0D;&#x540C;&#x7684;&#x540C;&#x4F4D;&#x5C5E;&#x6027;&#x6570;/(&#x5355;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5C5E;&#x6027;&#x4F4D;&#x6570;-&#x540C;&#x53D6;0&#x7684;&#x4F4D;&#x6570;)</strong>&#x201D;&#x6765;&#x6807;&#x8BC6;&#x76F8;&#x5F02;&#x5EA6;&#xFF0C;&#x8FD9;&#x53EB;&#x505A;&#x975E;&#x5BF9;&#x79F0;&#x4E8C;&#x5143;&#x76F8;&#x5F02;&#x5EA6;&#x3002;&#x5982;&#x679C;&#x7528;1&#x51CF;&#x53BB;&#x975E;&#x5BF9;&#x79F0;&#x4E8C;&#x5143;&#x76F8;&#x5F02;&#x5EA6;&#xFF0C;&#x5219;&#x5F97;&#x5230;&#x975E;&#x5BF9;&#x79F0;&#x4E8C;&#x5143;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;&#x4E5F;&#x53EB;Jaccard&#x7CFB;&#x6570;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p><strong>3&#x3001;&#x5206;&#x7C7B;&#x53D8;&#x91CF;</strong></p>
<p>&#x5206;&#x7C7B;&#x53D8;&#x91CF;&#x662F;&#x4E8C;&#x5143;&#x53D8;&#x91CF;&#x7684;&#x63A8;&#x5E7F;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x679A;&#x4E3E;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;&#x5404;&#x4E2A;&#x503C;&#x6CA1;&#x6709;&#x6570;&#x5B57;&#x6216;&#x5E8F;&#x6570;&#x610F;&#x4E49;&#xFF0C;&#x5982;&#x989C;&#x8272;&#x3001;&#x6C11;&#x65CF;&#x7B49;&#x7B49;&#xFF0C;&#x5BF9;&#x4E8E;&#x5206;&#x7C7B;&#x53D8;&#x91CF;&#xFF0C;&#x7528;&#x201C;<strong>&#x53D6;&#x503C;&#x4E0D;&#x540C;&#x7684;&#x540C;&#x4F4D;&#x5C5E;&#x6027;&#x6570;/&#x5355;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5168;&#x90E8;&#x5C5E;&#x6027;&#x6570;</strong>&#x201D;&#x6765;&#x6807;&#x8BC6;&#x5176;&#x76F8;&#x5F02;&#x5EA6;&#x3002;</p>
<p><strong>4&#x3001;&#x5E8F;&#x6570;&#x53D8;&#x91CF;</strong></p>
<p>&#x5E8F;&#x6570;&#x53D8;&#x91CF;&#x662F;&#x5177;&#x6709;&#x5E8F;&#x6570;&#x610F;&#x4E49;&#x7684;&#x5206;&#x7C7B;&#x53D8;&#x91CF;&#xFF0C;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x987A;&#x5E8F;&#x610F;&#x4E49;&#x6392;&#x5217;&#xFF0C;&#x5982;&#x51A0;&#x519B;&#x3001;&#x4E9A;&#x519B;&#x548C;&#x5B63;&#x519B;&#x3002;&#x5BF9;&#x4E8E;&#x5E8F;&#x6570;&#x53D8;&#x91CF;&#xFF0C;&#x4E00;&#x822C;&#x4E3A;&#x6BCF;&#x4E2A;&#x503C;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6570;&#xFF0C;&#x53EB;&#x505A;&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x79E9;&#xFF0C;&#x7136;&#x540E;&#x4EE5;&#x79E9;&#x4EE3;&#x66FF;&#x539F;&#x503C;&#x5F53;&#x505A;&#x6807;&#x91CF;&#x5C5E;&#x6027;&#x8BA1;&#x7B97;&#x76F8;&#x5F02;&#x5EA6;&#x3002;</p>
<p><strong>5&#x3001;&#x5411;&#x91CF;</strong></p>
<p>&#x5BF9;&#x4E8E;&#x5411;&#x91CF;&#xFF0C;&#x7531;&#x4E8E;&#x5B83;&#x4E0D;&#x4EC5;&#x6709;&#x5927;&#x5C0F;&#x800C;&#x4E14;&#x6709;&#x65B9;&#x5411;&#xFF0C;&#x6240;&#x4EE5;&#x95F5;&#x53EF;&#x592B;&#x65AF;&#x57FA;&#x8DDD;&#x79BB;&#x4E0D;&#x662F;&#x5EA6;&#x91CF;&#x5176;&#x76F8;&#x5F02;&#x5EA6;&#x7684;&#x597D;&#x529E;&#x6CD5;&#xFF0C;&#x4E00;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x7528;&#x4E24;&#x4E2A;&#x5411;&#x91CF;&#x7684;&#x4F59;&#x5F26;&#x5EA6;&#x91CF;&#xFF0C;&#x5176;&#x5EA6;&#x91CF;&#x516C;&#x5F0F;&#x4E3A;&#xFF1A;</p>
<p><img src="img/20140423200248500.jpg" alt=""></p>
<p>&#x5176;&#x4E2D;||X||&#x8868;&#x793A;X&#x7684;&#x6B27;&#x51E0;&#x91CC;&#x5F97;&#x8303;&#x6570;&#x3002;&#x8981;&#x6CE8;&#x610F;&#xFF0C;<strong>&#x4F59;&#x5F26;&#x5EA6;&#x91CF;&#x5EA6;&#x91CF;&#x7684;&#x4E0D;&#x662F;&#x4E24;&#x8005;&#x7684;&#x76F8;&#x5F02;&#x5EA6;&#xFF0C;&#x800C;&#x662F;&#x76F8;&#x4F3C;&#x5EA6;&#xFF01;</strong></p>
<p><strong>&#x4E8C;&#x3001;&#x805A;&#x7C7B;&#x95EE;&#x9898;</strong></p>
<p>&#x6240;&#x8C13;&#x805A;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x96C6;&#x5408;D&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x5177;&#x6709;n&#x4E2A;&#x53EF;&#x89C2;&#x5BDF;&#x5C5E;&#x6027;&#xFF0C;&#x4F7F;&#x7528;&#x67D0;&#x79CD;&#x7B97;&#x6CD5;&#x5C06;D&#x5212;&#x5206;&#x6210;k&#x4E2A;&#x5B50;&#x96C6;&#xFF0C;&#x8981;&#x6C42;&#x6BCF;&#x4E2A;&#x5B50;&#x96C6;&#x5185;&#x90E8;&#x7684;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x76F8;&#x5F02;&#x5EA6;&#x5C3D;&#x53EF;&#x80FD;&#x4F4E;&#xFF0C;&#x800C;&#x4E0D;&#x540C;&#x5B50;&#x96C6;&#x7684;&#x5143;&#x7D20;&#x76F8;&#x5F02;&#x5EA6;&#x5C3D;&#x53EF;&#x80FD;&#x9AD8;&#x3002;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x5B50;&#x96C6;&#x53EB;&#x505A;&#x4E00;&#x4E2A;&#x7C07;&#x3002;
      &#x4E0E;&#x5206;&#x7C7B;&#x4E0D;&#x540C;&#xFF0C;&#x5206;&#x7C7B;&#x662F;&#x793A;&#x4F8B;&#x5F0F;&#x5B66;&#x4E60;&#xFF0C;&#x8981;&#x6C42;&#x5206;&#x7C7B;&#x524D;&#x660E;&#x786E;&#x5404;&#x4E2A;&#x7C7B;&#x522B;&#xFF0C;&#x5E76;&#x65AD;&#x8A00;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x4E2A;&#x7C7B;&#x522B;&#xFF0C;&#x800C;&#x805A;&#x7C7B;&#x662F;&#x89C2;&#x5BDF;&#x5F0F;&#x5B66;&#x4E60;&#xFF0C;&#x5728;&#x805A;&#x7C7B;&#x524D;&#x53EF;&#x4EE5;&#x4E0D;&#x77E5;&#x9053;&#x7C7B;&#x522B;&#x751A;&#x81F3;&#x4E0D;&#x7ED9;&#x5B9A;&#x7C7B;&#x522B;&#x6570;&#x91CF;&#xFF0C;&#x662F;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x4E00;&#x79CD;&#x3002;&#x76EE;&#x524D;&#x805A;&#x7C7B;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x4E8E;&#x7EDF;&#x8BA1;&#x5B66;&#x3001;&#x751F;&#x7269;&#x5B66;&#x3001;&#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#x548C;&#x5E02;&#x573A;&#x8425;&#x9500;&#x7B49;&#x9886;&#x57DF;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x7B97;&#x6CD5;&#x4E5F;&#x975E;&#x5E38;&#x7684;&#x591A;&#x3002;&#x672C;&#x6587;&#x4EC5;&#x4ECB;&#x7ECD;&#x4E00;&#x79CD;&#x6700;&#x7B80;&#x5355;&#x7684;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;&#x2014;&#x2014;k&#x5747;&#x503C;&#xFF08;k-means&#xFF09;&#x7B97;&#x6CD5;&#x3002;</p>
<p>1&#x3001;&#x7B97;&#x6CD5;&#x7B80;&#x4ECB;</p>
<p>k-means&#x7B97;&#x6CD5;&#xFF0C;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;k-&#x5E73;&#x5747;&#x6216;k-&#x5747;&#x503C;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x5F97;&#x5230;&#x6700;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x805A;&#x7C7B;&#x7B97;&#x6CD5;&#x3002; &#x5B83;&#x662F;&#x5C06;&#x5404;&#x4E2A;&#x805A;&#x7C7B;&#x5B50;&#x96C6;&#x5185;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x6837;&#x672C;&#x7684;&#x5747;&#x503C;&#x4F5C;&#x4E3A;&#x8BE5;&#x805A;&#x7C7B;&#x7684;&#x4EE3;&#x8868;&#x70B9;&#xFF0C;</p>
<p>&#x7B97;&#x6CD5;&#x7684;&#x4E3B;&#x8981;&#x601D;&#x60F3;&#x662F;&#x901A;&#x8FC7;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x628A;&#x6570;&#x636E;&#x96C6;&#x5212;&#x5206;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x522B;&#xFF0C;&#x4F7F;&#x5F97;&#x8BC4;&#x4EF7;&#x805A;&#x7C7B;&#x6027;&#x80FD;&#x7684;&#x51C6;&#x5219;&#x51FD;&#x6570;&#x8FBE;&#x5230;&#x6700;&#x4F18;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x751F;&#x6210;&#x7684;&#x6BCF;&#x4E2A;&#x805A;&#x7C7B;&#x5185;&#x7D27;&#x51D1;&#xFF0C;&#x7C7B;&#x95F4;&#x72EC;&#x7ACB;&#x3002;&#x8FD9;&#x4E00;&#x7B97;&#x6CD5;&#x4E0D;&#x9002;&#x5408;&#x5904;&#x7406;&#x79BB;&#x6563;&#x578B;&#x5C5E;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x8FDE;&#x7EED;&#x578B;&#x5177;&#x6709;&#x8F83;&#x597D;&#x7684;&#x805A;&#x7C7B;&#x6548;&#x679C;&#x3002;</p>
<p><strong>2&#x3001;&#x7B97;&#x6CD5;&#x63CF;&#x8FF0;</strong></p>
<p>1&#x3001;&#x4E3A;&#x4E2D;&#x5FC3;&#x5411;&#x91CF;c1, c2, &#x2026;, ck&#x521D;&#x59CB;&#x5316;k&#x4E2A;&#x79CD;&#x5B50;</p>
<p>2&#x3001;&#x5206;&#x7EC4;:</p>
<p>&#xFF08;1&#xFF09;&#x5C06;&#x6837;&#x672C;&#x5206;&#x914D;&#x7ED9;&#x8DDD;&#x79BB;&#x5176;&#x6700;&#x8FD1;&#x7684;&#x4E2D;&#x5FC3;&#x5411;&#x91CF;</p>
<p>&#xFF08;2&#xFF09;&#x7531;&#x8FD9;&#x4E9B;&#x6837;&#x672C;&#x6784;&#x9020;&#x4E0D;&#x76F8;&#x4EA4;&#xFF08; non-overlapping &#xFF09;&#x7684;&#x805A;&#x7C7B;</p>
<p>3&#x3001;&#x786E;&#x5B9A;&#x4E2D;&#x5FC3;:</p>
<p>&#x7528;&#x5404;&#x4E2A;&#x805A;&#x7C7B;&#x7684;&#x4E2D;&#x5FC3;&#x5411;&#x91CF;&#x4F5C;&#x4E3A;&#x65B0;&#x7684;&#x4E2D;&#x5FC3;</p>
<p>4&#x3001;&#x91CD;&#x590D;&#x5206;&#x7EC4;&#x548C;&#x786E;&#x5B9A;&#x4E2D;&#x5FC3;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x76F4;&#x81F3;&#x7B97;&#x6CD5;&#x6536;&#x655B;&#x3002;</p>
<p>3&#x3001;<strong>&#x7B97;</strong>&#x6CD5;  k-means&#x7B97;&#x6CD5;</p>
<p>&#x8F93;&#x5165;&#xFF1A;&#x7C07;&#x7684;&#x6570;&#x76EE;k&#x548C;&#x5305;&#x542B;n&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<p>&#x8F93;&#x51FA;&#xFF1A;k&#x4E2A;&#x7C07;&#xFF0C;&#x4F7F;&#x5E73;&#x65B9;&#x8BEF;&#x5DEE;&#x51C6;&#x5219;&#x6700;&#x5C0F;&#x3002;</p>
<p>&#x7B97;&#x6CD5;&#x6B65;&#x9AA4;&#xFF1A; </p>
<p>1.&#x4E3A;&#x6BCF;&#x4E2A;&#x805A;&#x7C7B;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x6709;K &#x4E2A;&#x521D;&#x59CB;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;&#x3002; </p>
<p>2.&#x5C06;&#x6837;&#x672C;&#x96C6;&#x4E2D;&#x7684;&#x6837;&#x672C;&#x6309;&#x7167;&#x6700;&#x5C0F;&#x8DDD;&#x79BB;&#x539F;&#x5219;&#x5206;&#x914D;&#x5230;&#x6700;&#x90BB;&#x8FD1;&#x805A;&#x7C7B;  </p>
<p>3.&#x4F7F;&#x7528;&#x6BCF;&#x4E2A;&#x805A;&#x7C7B;&#x4E2D;&#x7684;&#x6837;&#x672C;&#x5747;&#x503C;&#x4F5C;&#x4E3A;&#x65B0;&#x7684;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;&#x3002;</p>
<p>4.&#x91CD;&#x590D;&#x6B65;&#x9AA4;2.3&#x76F4;&#x5230;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;&#x4E0D;&#x518D;&#x53D8;&#x5316;&#x3002;</p>
<p>5.&#x7ED3;&#x675F;&#xFF0C;&#x5F97;&#x5230;K&#x4E2A;&#x805A;&#x7C7B;</p>
<p>PS</p>
<p>1&#x3001;&#x5C06;&#x6837;&#x672C;&#x5206;&#x914D;&#x7ED9;&#x8DDD;&#x79BB;&#x5B83;&#x4EEC;&#x6700;&#x8FD1;&#x7684;&#x4E2D;&#x5FC3;&#x5411;&#x91CF;&#xFF0C;&#x5E76;&#x4F7F;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x503C;&#x51CF;&#x5C0F;</p>
<p><img src="img/20140423201716125.jpg" alt=""></p>
<p>2&#x3001;&#x66F4;&#x65B0;&#x7C07;&#x5E73;&#x5747;&#x503C;</p>
<p><img src="img/20140423201731671.jpg" alt=""></p>
<p>3&#x3001;&#x8BA1;&#x7B97;&#x51C6;&#x5219;&#x51FD;&#x6570;E</p>
<p><img src="img/20140423201745812.jpg" alt=""></p>
<p>4&#x3001;&#x5212;&#x5206;&#x805A;&#x7C7B;&#x65B9;&#x6CD5;&#x5BF9;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x805A;&#x7C7B;&#x65F6;&#x5305;&#x62EC;&#x5982;&#x4E0B;</p>
<p>&#x4E09;&#x4E2A;&#x8981;&#x70B9;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x9009;&#x5B9A;&#x67D0;&#x79CD;&#x8DDD;&#x79BB;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x6837;&#x672C;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x5EA6;&#x91CF;              </p>
<p>&#x4E0A;&#x9762;&#x8BB2;&#x5230;&#xFF0C;k-means&#x805A;&#x7C7B;&#x7B97;&#x6CD5;&#x4E0D;&#x9002;&#x5408;&#x5904;&#x7406;&#x79BB;&#x6563;&#x578B;&#x5C5E;&#x6027;&#xFF0C;&#x5BF9;&#x8FDE;&#x7EED;&#x578B;&#x5C5E;&#x6027;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x8BA1;&#x7B97;&#x6570;&#x636E;&#x6837;&#x672C;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x9700;&#x8981;&#x9009;&#x62E9;&#x6B27;&#x5F0F;&#x8DDD;&#x79BB;&#x3001;&#x66FC;&#x54C8;&#x987F;&#x8DDD;&#x79BB;&#x6216;&#x8005;&#x660E;&#x8003;&#x65AF;&#x8DDD;&#x79BB;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x6765;&#x4F5C;&#x4E3A;&#x7B97;&#x6CD5;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x5EA6;&#x91CF;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x5E38;&#x7528;&#x7684;&#x662F;&#x6B27;&#x5F0F;&#x8DDD;&#x79BB;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x518D;&#x7ED9;&#x5927;&#x5BB6;&#x5177;&#x4F53;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x6B27;&#x5F0F;&#x8DDD;&#x79BB;&#x3002;&#x5E73;&#x5747;&#x503C;</p>
<p>&#x5047;&#x8BBE;&#x7ED9;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x96C6;<img src="img/20140423202102500.jpg" alt="">&#xFF0C;X&#x4E2D;&#x7684;&#x6837;&#x672C;&#x7528;d&#x4E2A;&#x63CF;&#x8FF0;&#x5C5E;&#x6027;A1,A2&#x2026;Ad&#x6765;&#x8868;&#x793A;&#xFF0C;&#x5E76;&#x4E14;d&#x4E2A;&#x63CF;&#x8FF0;&#x5C5E;&#x6027;&#x90FD;&#x662F;&#x8FDE;&#x7EED;&#x578B;&#x5C5E;&#x6027;&#x3002;&#x6570;&#x636E;&#x6837;&#x672C;xi=(xi1,xi2,&#x2026;xid),xj=(xj1,xj2,&#x2026;xjd)&#x5176;&#x4E2D;&#xFF0C;xi1,xi2,&#x2026;xid&#x548C;xj1,xj2,&#x2026;xjd&#x5206;&#x522B;&#x662F;&#x6837;&#x672C;xi&#x548C;xj&#x5BF9;&#x5E94;d&#x4E2A;&#x63CF;&#x8FF0;&#x5C5E;&#x6027;A1,A2,&#x2026;Ad&#x7684;&#x5177;&#x4F53;&#x53D6;&#x503C;&#x3002;&#x6837;&#x672C;xi&#x548C;xj&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x901A;&#x5E38;&#x7528;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;d(xi,xj)&#x6765;&#x8868;&#x793A;&#xFF0C;&#x8DDD;&#x79BB;&#x8D8A;&#x5C0F;&#xFF0C;&#x6837;&#x672C;xi&#x548C;xj&#x8D8A;&#x76F8;&#x4F3C;&#xFF0C;&#x5DEE;&#x5F02;&#x5EA6;&#x8D8A;&#x5C0F;&#xFF1B;&#x8DDD;&#x79BB;&#x8D8A;&#x5927;&#xFF0C;&#x6837;&#x672C;xi&#x548C;xj&#x8D8A;&#x4E0D;&#x76F8;&#x4F3C;&#xFF0C;&#x5DEE;&#x5F02;&#x5EA6;&#x8D8A;&#x5927;&#x3002;</p>
<p>&#x6B27;&#x5F0F;&#x8DDD;&#x79BB;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="img/20140423202143062.jpg" alt=""></p>
<p>&#xFF08;2&#xFF09;&#x9009;&#x62E9;&#x8BC4;&#x4EF7;&#x805A;&#x7C7B;&#x6027;&#x80FD;&#x7684;&#x51C6;&#x5219;&#x51FD;&#x6570;</p>
<p>k-means&#x805A;&#x7C7B;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x8BEF;&#x5DEE;&#x5E73;&#x65B9;&#x548C;&#x51C6;&#x5219;&#x51FD;&#x6570;&#x6765; &#x8BC4;&#x4EF7;&#x805A;&#x7C7B;&#x6027;&#x80FD;&#x3002;&#x7ED9;&#x5B9A;&#x6570;&#x636E;&#x96C6;X&#xFF0C;&#x5176;&#x4E2D;&#x53EA;&#x5305;&#x542B;&#x63CF;&#x8FF0;&#x5C5E;&#x6027;&#xFF0C;&#x4E0D;&#x5305;&#x542B;&#x7C7B;&#x522B;&#x5C5E;&#x6027;&#x3002;&#x5047;&#x8BBE;X&#x5305;&#x542B;k&#x4E2A;&#x805A;&#x7C7B;&#x5B50;&#x96C6;X1,X2,&#x2026;XK&#xFF1B;&#x5404;&#x4E2A;&#x805A;&#x7C7B;&#x5B50;&#x96C6;&#x4E2D;&#x7684;&#x6837;&#x672C;&#x6570;&#x91CF;&#x5206;&#x522B;&#x4E3A;n1&#xFF0C;n2,&#x2026;,nk;&#x5404;&#x4E2A;&#x805A;&#x7C7B;&#x5B50;&#x96C6;&#x7684;&#x5747;&#x503C;&#x4EE3;&#x8868;&#x70B9;&#xFF08;&#x4E5F;&#x79F0;&#x805A;&#x7C7B;&#x4E2D;&#x5FC3;&#xFF09;&#x5206;&#x522B;&#x4E3A;m1&#xFF0C;m2,&#x2026;,mk&#x3002;&#x5219;&#x8BEF;&#x5DEE;&#x5E73;&#x65B9;&#x548C;&#x51C6;&#x5219;&#x51FD;&#x6570;&#x516C;&#x5F0F;&#x4E3A;&#xFF1A;</p>
<p><img src="img/20140423202252921.jpg" alt=""></p>
<p>&#xFF08;3&#xFF09;&#x76F8;&#x4F3C;&#x5EA6;&#x7684;&#x8BA1;&#x7B97;&#x6839;&#x636E;&#x4E00;&#x4E2A;&#x7C07;&#x4E2D;&#x5BF9;&#x8C61;&#x7684;&#x5E73;&#x5747;&#x503C;&#x6765;&#x8FDB;&#x884C;&#x3002;</p>
<p>1&#xFF09;&#x5C06;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x968F;&#x673A;&#x5206;&#x914D;&#x5230;k&#x4E2A;&#x975E;&#x7A7A;&#x7684;&#x7C07;&#x4E2D;&#x3002;</p>
<p>2&#xFF09;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x7C07;&#x7684;&#x5E73;&#x5747;&#x503C;&#xFF0C;&#x5E76;&#x7528;&#x8BE5;&#x5E73;&#x5747;&#x503C;&#x4EE3;&#x8868;&#x76F8;&#x5E94;&#x7684;&#x7C07;&#x3002;</p>
<p>3&#xFF09;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x4E0E;&#x5404;&#x4E2A;&#x7C07;&#x4E2D;&#x5FC3;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x5206;&#x914D;&#x7ED9;&#x6700;&#x8FD1;&#x7684;&#x7C07;&#x3002;</p>
<p>4&#xFF09;&#x7136;&#x540E;&#x8F6C;2&#xFF09;&#xFF0C;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;&#x7C07;&#x7684;&#x5E73;&#x5747;&#x503C;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x76F4;&#x5230;&#x6EE1;&#x8DB3;&#x67D0;&#x4E2A;&#x51C6;&#x5219;&#x51FD;&#x6570;&#x624D;&#x505C;&#x6B62;</p>
<p><strong>&#x4E09;&#x3001;&#x805A;&#x7C7B;&#x4F8B;&#x5B50;</strong></p>
<p><img src="img/20140423203151921.jpg" alt=""></p>
<p>&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x96C6;&#x5408;S&#x89C1;&#x4E0A;&#x8868;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x805A;&#x7C7B;&#x5206;&#x6790;&#x7684;&#x4E8C;&#x7EF4;&#x6837;&#x672C;&#xFF0C;&#x8981;&#x6C42;&#x7684;&#x7C07;&#x7684;&#x6570;&#x91CF;k=2&#x3002;</p>
<p>(1)&#x9009;&#x62E9;<img src="img/20140423203237812.jpg" alt=""> &#xFF0C;<img src="img/20140423203249187.jpg" alt="">&#x4E3A;&#x521D;&#x59CB;&#x7684;&#x7C07;&#x4E2D;&#x5FC3;&#xFF0C;&#x5373; <img src="img/20140423203421421.jpg" alt="">&#xFF0C;<img src="img/20140423203435375.jpg" alt="">&#x3002;</p>
<p>(2)&#x5BF9;&#x5269;&#x4F59;&#x7684;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x6839;&#x636E;&#x5176;&#x4E0E;&#x5404;&#x4E2A;&#x7C07;&#x4E2D;&#x5FC3;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x5C06;&#x5B83;&#x8D4B;&#x7ED9;&#x6700;&#x8FD1;&#x7684;&#x7C07;</p>
<p>&#x5BF9;O3 &#xFF1A;</p>
<p><img src="img/20140423203534843.jpg" alt=""></p>
<p><img src="img/20140423203546203.jpg" alt=""></p>
<p>&#x663E;&#x7136; <img src="img/20140423203704843.jpg" alt="">O3&#xFF0C;&#x6545;&#x5C06;C2&#x5206;&#x914D;&#x7ED9;</p>
<p>&#x5BF9;&#x4E8E;O4:</p>
<p><img src="img/20140423204359875.jpg" alt=""></p>
<p><img src="img/20140423204411046.jpg" alt=""></p>
<p>&#x56E0;&#x4E3A;&#xFF1A;<img src="img/20140423204439750.jpg" alt="">&#x6240;&#x4EE5;&#x5C06;O4&#x5206;&#x914D;&#x7ED9;C2</p>
<p>&#x5BF9;&#x4E8E;O5:</p>
<p><img src="img/20140423204559171.jpg" alt=""></p>
<p><img src="img/20140423204609828.jpg" alt=""></p>
<p>&#x56E0;&#x4E3A;&#xFF1A;<img src="img/20140423204632515.jpg" alt="">&#x6240;&#x4EE5;&#x8BB2;O5&#x5206;&#x914D;&#x7ED9;C1</p>
<p>&#x66F4;&#x65B0;&#xFF0C;&#x5F97;&#x5230;&#x65B0;&#x7C07;<img src="img/20140423204739875.jpg" alt=""> &#x548C;<img src="img/20140423204852343.jpg" alt=""></p>
<p>&#x8BA1;&#x7B97;&#x5E73;&#x65B9;&#x8BEF;&#x5DEE;&#x51C6;&#x5219;&#xFF0C;&#x5355;&#x4E2A;&#x65B9;&#x5DEE;&#x4E3A;</p>
<p><img src="img/20140423205009734.jpg" alt=""><img src="img/20140423205129500.jpg" alt=""></p>
<p><img src="img/20140423205021062.jpg" alt=""><img src="img/20140423205141453.jpg" alt=""></p>
<p>&#x603B;&#x4F53;&#x5E73;&#x5747;&#x65B9;&#x5DEE;&#x662F;&#xFF1A;</p>
<p><img src="img/20140423205228437.jpg" alt=""></p>
<p>&#xFF08;3&#xFF09;&#x8BA1;&#x7B97;&#x65B0;&#x7684;&#x7C07;&#x7684;&#x4E2D;&#x5FC3;&#x3002; </p>
<p><img src="img/20140423205318984.jpg" alt=""></p>
<p>&#x91CD;&#x590D;&#xFF08;2&#xFF09;&#x548C;&#xFF08;3&#xFF09;&#xFF0C;&#x5F97;&#x5230;O1&#x5206;&#x914D;&#x7ED9;C1&#xFF1B;O2&#x5206;&#x914D;&#x7ED9;C2&#xFF0C;O3&#x5206;&#x914D;&#x7ED9;C2 &#xFF0C;O4&#x5206;&#x914D;&#x7ED9;C2&#xFF0C;O5&#x5206;&#x914D;&#x7ED9;C1&#x3002;&#x66F4;&#x65B0;&#xFF0C;&#x5F97;&#x5230;&#x65B0;&#x7C07;
<img src="img/20140423205651953.jpg" alt=""> &#x548C;<img src="img/20140423205511031.jpg" alt="">&#x3002; &#x4E2D;&#x5FC3;&#x4E3A;<img src="img/20140423205604656.jpg" alt="">  &#xFF0C;<img src="img/20140423205539968.jpg" alt=""> &#x3002;</p>
<p>&#x5355;&#x4E2A;&#x65B9;&#x5DEE;&#x5206;&#x522B;&#x4E3A;<img src="img/20140423205717453.jpg" alt=""></p>
<p>&#x603B;&#x4F53;&#x5E73;&#x5747;&#x8BEF;&#x5DEE;&#x662F;&#xFF1A; </p>
<p><img src="img/20140423205803671.jpg" alt=""></p>
<p>&#x7531;&#x4E0A;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x540E;&#xFF0C;&#x603B;&#x4F53;&#x5E73;&#x5747;&#x8BEF;&#x5DEE;&#x503C;52.25~25.65&#xFF0C;&#x663E;&#x8457;&#x51CF;&#x5C0F;&#x3002;&#x7531;&#x4E8E;&#x5728;&#x4E24;&#x6B21;&#x8FED;&#x4EE3;&#x4E2D;&#xFF0C;&#x7C07;&#x4E2D;&#x5FC3;&#x4E0D;&#x53D8;&#xFF0C;&#x6240;&#x4EE5;&#x505C;&#x6B62;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#xFF0C;&#x7B97;&#x6CD5;&#x505C;&#x6B62;&#x3002;</p>
<p><strong>PS </strong></p>
<p><strong>1&#x3001;k-means&#x7B97;&#x6CD5;&#x7684;&#x6027;&#x80FD;&#x5206;&#x6790;</strong></p>
<p>&#x4E3B;&#x8981;&#x4F18;&#x70B9;&#xFF1A;</p>
<p>&#x662F;&#x89E3;&#x51B3;&#x805A;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x79CD;&#x7ECF;&#x5178;&#x7B97;&#x6CD5;&#xFF0C;&#x7B80;&#x5355;&#x3001;&#x5FEB;&#x901F;&#x3002;</p>
<p>&#x5BF9;&#x5904;&#x7406;&#x5927;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x8BE5;&#x7B97;&#x6CD5;&#x662F;&#x76F8;&#x5BF9;&#x53EF;&#x4F38;&#x7F29;&#x548C;&#x9AD8;&#x6548;&#x7387;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x662F;0 (n k t ) , &#x5176;&#x4E2D;, n &#x662F;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x7684;&#x6570;&#x76EE;, k &#x662F;&#x7C07;&#x7684;&#x6570;&#x76EE;, t &#x662F;&#x8FED;&#x4EE3;&#x7684;&#x6B21;&#x6570;&#x3002;&#x901A;&#x5E38;k &lt; &lt;n &#x4E14;t &lt; &lt;n &#x3002;</p>
<p>&#x5F53;&#x7ED3;&#x679C;&#x7C07;&#x662F;&#x5BC6;&#x96C6;&#x7684;&#xFF0C;&#x800C;&#x7C07;&#x4E0E;&#x7C07;&#x4E4B;&#x95F4;&#x533A;&#x522B;&#x660E;&#x663E;&#x65F6;, &#x5B83;&#x7684;&#x6548;&#x679C;&#x8F83;&#x597D;&#x3002;</p>
<p>&#x4E3B;&#x8981;&#x7F3A;&#x70B9;</p>
<p>&#x5728;&#x7C07;&#x7684;&#x5E73;&#x5747;&#x503C;&#x88AB;&#x5B9A;&#x4E49;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x5904;&#x7406;&#x7B26;&#x53F7;&#x5C5E;&#x6027;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x9002;&#x7528;&#x3002;</p>
<p>&#x5FC5;&#x987B;&#x4E8B;&#x5148;&#x7ED9;&#x51FA;k&#xFF08;&#x8981;&#x751F;&#x6210;&#x7684;&#x7C07;&#x7684;&#x6570;&#x76EE;&#xFF09;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;&#x521D;&#x503C;&#x654F;&#x611F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x540C;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x5B83;&#x5BF9;&#x4E8E;&#x201C;&#x8E81;&#x58F0;&#x201D;&#x548C;&#x5B64;&#x7ACB;&#x70B9;&#x6570;&#x636E;&#x662F;&#x654F;&#x611F;&#x7684;&#xFF0C;&#x5C11;&#x91CF;&#x7684;&#x8BE5;&#x7C7B;&#x6570;&#x636E;&#x80FD;&#x591F;&#x5BF9;&#x5E73;&#x5747;&#x503C;&#x4EA7;&#x751F;&#x6781;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>K-Means&#x7B97;&#x6CD5;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x540C;&#x7ED3;&#x679C;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF1A;</p>
<p>1.&#x591A;&#x8BBE;&#x7F6E;&#x4E00;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x521D;&#x503C;&#xFF0C;&#x5BF9;&#x6BD4;&#x6700;&#x540E;&#x7684;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#xFF09;&#x4E00;&#x76F4;&#x5230;&#x7ED3;&#x679C;&#x8D8B;&#x4E8E;&#x7A33;&#x5B9A;&#x7ED3;&#x675F;&#xFF0C;&#x6BD4;&#x8F83;&#x8017;&#x65F6;&#x548C;&#x6D6A;&#x8D39;&#x8D44;&#x6E90;</p>
<p>2.&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x4E8B;&#x5148;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x7ED9;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x96C6;&#x5E94;&#x8BE5;&#x5206;&#x6210;&#x591A;&#x5C11;&#x4E2A;&#x7C7B;&#x522B;&#x624D;&#x6700;&#x5408;&#x9002;&#x3002;&#x8FD9;&#x4E5F;&#x662F; K-means &#x7B97;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x4E0D;&#x8DB3;&#x3002;&#x6709;&#x7684;&#x7B97;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x7C7B;&#x7684;&#x81EA;&#x52A8;&#x5408;&#x5E76;&#x548C;&#x5206;&#x88C2;&#xFF0C;&#x5F97;&#x5230;&#x8F83;&#x4E3A;&#x5408;&#x7406;&#x7684;&#x7C7B;&#x578B;&#x6570;&#x76EE; K.</p>
<p>2&#x3001;k-means&#x7B97;&#x6CD5;&#x7684;&#x6539;&#x8FDB;&#x65B9;&#x6CD5;&#x2014;&#x2014;k-prototype&#x7B97;&#x6CD5;</p>
<p>k-Prototype&#x7B97;&#x6CD5;&#xFF1A;&#x53EF;&#x4EE5;&#x5BF9;&#x79BB;&#x6563;&#x4E0E;&#x6570;&#x503C;&#x5C5E;&#x6027;&#x4E24;&#x79CD;&#x6DF7;&#x5408;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x805A;&#x7C7B;&#xFF0C;&#x5728;k-prototype&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x6570;&#x503C;&#x4E0E;&#x79BB;&#x6563;&#x5C5E;&#x6027;&#x90FD;&#x8BA1;&#x7B97;&#x7684;&#x76F8;&#x5F02;&#x6027;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#x3002;</p>
<p>K-Prototype&#x7B97;&#x6CD5;&#x662F;&#x7ED3;&#x5408;K-Means&#x4E0E;K-modes&#x7B97;&#x6CD5;&#xFF0C;&#x9488;&#x5BF9;&#x6DF7;&#x5408;&#x5C5E;&#x6027;&#x7684;&#xFF0C;&#x89E3;&#x51B3;2&#x4E2A;&#x6838;&#x5FC3;&#x95EE;&#x9898;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>1.&#x5EA6;&#x91CF;&#x5177;&#x6709;&#x6DF7;&#x5408;&#x5C5E;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x6570;&#x503C;&#x5C5E;&#x6027;&#x91C7;&#x7528;K-means&#x65B9;&#x6CD5;&#x5F97;&#x5230;P1&#xFF0C;&#x5206;&#x7C7B;&#x5C5E;&#x6027;&#x91C7;&#x7528;K-modes&#x65B9;&#x6CD5;P2&#xFF0C;&#x90A3;&#x4E48;D=P1+a*P2&#xFF0C;a&#x662F;&#x6743;&#x91CD;&#xFF0C;&#x5982;&#x679C;&#x89C9;&#x5F97;&#x5206;&#x7C7B;&#x5C5E;&#x6027;&#x91CD;&#x8981;&#xFF0C;&#x5219;&#x589E;&#x52A0;a&#xFF0C;&#x5426;&#x5219;&#x51CF;&#x5C11;a&#xFF0C;a=0&#x65F6;&#x5373;&#x53EA;&#x6709;&#x6570;&#x503C;&#x5C5E;&#x6027;</p>
<p>2.&#x66F4;&#x65B0;&#x4E00;&#x4E2A;&#x7C07;&#x7684;&#x4E2D;&#x5FC3;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x65B9;&#x6CD5;&#x662F;&#x7ED3;&#x5408;K-Means&#x4E0E;K-modes&#x7684;&#x66F4;&#x65B0;&#x65B9;&#x6CD5;&#x3002;</p>
<p>3&#x3001;k-means&#x7B97;&#x6CD5;&#x7684;&#x6539;&#x8FDB;&#x65B9;&#x6CD5;&#x2014;&#x2014;k-&#x4E2D;&#x5FC3;&#x70B9;&#x7B97;&#x6CD5;</p>
<p>k-&#x4E2D;&#x5FC3;&#x70B9;&#x7B97;&#x6CD5;&#xFF1A;k -means&#x7B97;&#x6CD5;&#x5BF9;&#x4E8E;&#x5B64;&#x7ACB;&#x70B9;&#x662F;&#x654F;&#x611F;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x91C7;&#x7528;&#x7C07;&#x4E2D;&#x7684;&#x5E73;&#x5747;&#x503C;&#x4F5C;&#x4E3A;&#x53C2;&#x7167;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x7528;&#x7C07;&#x4E2D;&#x4F4D;&#x7F6E;&#x6700;&#x4E2D;&#x5FC3;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5373;&#x4E2D;&#x5FC3;&#x70B9;&#x4F5C;&#x4E3A;&#x53C2;&#x7167;&#x70B9;&#x3002;&#x8FD9;&#x6837;&#x5212;&#x5206;&#x65B9;&#x6CD5;&#x4ECD;&#x7136;&#x662F;&#x57FA;&#x4E8E;&#x6700;&#x5C0F;&#x5316;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x4E0E;&#x5176;&#x53C2;&#x7167;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x5F02;&#x5EA6;&#x4E4B;&#x548C;&#x7684;&#x539F;&#x5219;&#x6765;&#x6267;&#x884C;&#x7684;&#x3002; </p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="./c4.5.html" class="navigation navigation-prev " aria-label="Previous page: C4.5"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="./svm.html" class="navigation navigation-next " aria-label="Next page: SVM"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-comment/plugin.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"comment":{"highlightCommented":true},"autocover":{},"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
