<!DOCTYPE HTML>
<html lang="zh-tw" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>支持向量机 | 数据挖掘十大算法详解</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        <meta name="author" content="wizardforcel">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-comment/plugin.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="./svm-2.html" />
    
    
    <link rel="prev" href="./svm.html" />
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="3.1"
        data-chapter-title="支持向量机"
        data-filepath="svm-1.md"
        data-basepath="."
        data-revision="Thu Feb 11 2016 09:20:12 GMT+0000 (UTC)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
                
                <li>
                    <a href="https://www.gitbook.com/book/wizardforcel/dm-algo-top10" target="blank" class="custom-link">数据挖掘十大算法详解</a>
                </li>
            
            

            
            <li class="divider"></li>
            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        介紹
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="c4.5.html">
            
                
                    <a href="./c4.5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        C4.5
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="k-means.html">
            
                
                    <a href="./k-means.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        k-means
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="svm.html">
            
                
                    <a href="./svm.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        SVM
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="3.1" data-path="svm-1.html">
            
                
                    <a href="./svm-1.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.1.</b>
                        
                        支持向量机
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="svm-2.html">
            
                
                    <a href="./svm-2.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.2.</b>
                        
                        拉格朗日对偶
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="svm-3.html">
            
                
                    <a href="./svm-3.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.3.</b>
                        
                        最优间隔分类器
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="svm-4.html">
            
                
                    <a href="./svm-4.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.4.</b>
                        
                        核函数
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="svm-5.html">
            
                
                    <a href="./svm-5.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.5.</b>
                        
                        SMO算法详解
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="4" data-path="apriori.html">
            
                
                    <a href="./apriori.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        Apriori
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="em.html">
            
                
                    <a href="./em.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        EM
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="pagerank.html">
            
                
                    <a href="./pagerank.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        PageRank
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="7" data-path="adaboost.html">
            
                
                    <a href="./adaboost.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        AdaBoost
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="knn.html">
            
                
                    <a href="./knn.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        kNN
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="9" data-path="naive-bayes.html">
            
                
                    <a href="./naive-bayes.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>9.</b>
                        
                        Naive Bayes
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="10" data-path="cart.html">
            
                
                    <a href="./cart.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>10.</b>
                        
                        CART
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    本書使用 GitBook 釋出
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >数据挖掘十大算法详解</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E0E;&#x6570;&#x636E;&#x6316;&#x6398;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;svm&#xFF08;&#x4E00;&#xFF09;">&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E0E;&#x6570;&#x636E;&#x6316;&#x6398;-&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;(SVM)&#xFF08;&#x4E00;&#xFF09;</h1>
<blockquote>
<p>&#x6765;&#x6E90;&#xFF1A;<a href="http://blog.csdn.net/u011067360/article/details/24876849" target="_blank">http://blog.csdn.net/u011067360/article/details/24876849</a></p>
</blockquote>
<p>&#x6700;&#x8FD1;&#x5728;&#x770B;&#x65AF;&#x5766;&#x798F;&#x5927;&#x5B66;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x516C;&#x5F00;&#x8BFE;&#xFF0C;&#x5B66;&#x4E60;&#x4E86;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#xFF0C;&#x518D;&#x7ED3;&#x5408;&#x7F51;&#x4E0A;&#x5404;&#x4F4D;&#x5927;&#x795E;&#x7684;&#x5B66;&#x4E60;&#x7ECF;&#x9A8C;&#x603B;&#x7ED3;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x4E00;&#x3001;&#x4EC0;&#x4E48;&#x662F;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;(SVM)?</p>
<p>1&#x3001;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#xFF08;Support Vector Machine&#xFF0C;&#x5E38;&#x7B80;&#x79F0;&#x4E3A;SVM&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x76D1;&#x7763;&#x5F0F;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x5E7F;&#x6CDB;&#x5730;&#x5E94;&#x7528;&#x4E8E;&#x7EDF;&#x8BA1;&#x5206;&#x7C7B;&#x4EE5;&#x53CA;&#x56DE;&#x5F52;&#x5206;&#x6790;&#x3002;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#x5C5E;&#x4E8E;&#x4E00;&#x822C;&#x5316;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x8FD9;&#x65CF;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x7279;&#x70B9;&#x662F;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x6700;&#x5C0F;&#x5316;&#x7ECF;&#x9A8C;&#x8BEF;&#x5DEE;&#x4E0E;&#x6700;&#x5927;&#x5316;&#x51E0;&#x4F55;&#x8FB9;&#x7F18;&#x533A;&#xFF0C;&#x56E0;&#x6B64;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x6700;&#x5927;&#x8FB9;&#x7F18;&#x533A;&#x5206;&#x7C7B;&#x5668;&#x3002;</p>
<p>2&#x3001;&#x652F;&#x6301;&#x5411;&#x91CF;&#x673A;&#x5C06;&#x5411;&#x91CF;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x9AD8;&#x7EF4;&#x7684;&#x7A7A;&#x95F4;&#x91CC;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x7A7A;&#x95F4;&#x91CC;&#x5EFA;&#x7ACB;&#x6709;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x95F4;&#x9694;&#x8D85;&#x5E73;&#x9762;&#x3002;&#x5728;&#x5206;&#x5F00;&#x6570;&#x636E;&#x7684;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x4E24;&#x8FB9;&#x5EFA;&#x6709;&#x4E24;&#x4E2A;&#x4E92;&#x76F8;&#x5E73;&#x884C;&#x7684;&#x8D85;&#x5E73;&#x9762;&#xFF0C;&#x5206;&#x9694;&#x8D85;&#x5E73;&#x9762;&#x4F7F;&#x4E24;&#x4E2A;&#x5E73;&#x884C;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x8DDD;&#x79BB;&#x6700;&#x5927;&#x5316;&#x3002;&#x5047;&#x5B9A;&#x5E73;&#x884C;&#x8D85;&#x5E73;&#x9762;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x6216;&#x5DEE;&#x8DDD;&#x8D8A;&#x5927;&#xFF0C;&#x5206;&#x7C7B;&#x5668;&#x7684;&#x603B;&#x8BEF;&#x5DEE;&#x8D8A;&#x5C0F;&#x3002;</p>
<p>3&#x3001;&#x5047;&#x8BBE;&#x7ED9;&#x5B9A;&#x4E00;&#x4E9B;&#x5206;&#x5C5E;&#x4E8E;&#x4E24;&#x7C7B;&#x7684;2&#x7EF4;&#x70B9;&#xFF0C;&#x8FD9;&#x4E9B;&#x70B9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x76F4;&#x7EBF;&#x5206;&#x5272;&#xFF0C; &#x6211;&#x4EEC;&#x8981;&#x627E;&#x5230;&#x4E00;&#x6761;&#x6700;&#x4F18;&#x7684;&#x5206;&#x5272;&#x7EBF;&#xFF0C;&#x5982;&#x4F55;&#x6765;&#x754C;&#x5B9A;&#x4E00;&#x4E2A;&#x8D85;&#x5E73;&#x9762;&#x662F;&#x4E0D;&#x662F;&#x6700;&#x4F18;&#x7684;&#x5462;? </p>
<p>&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="img/20140502155924375.png" alt=""></p>
<p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x56FE;&#x4E2D;&#xFF0C;a&#x548C;b&#x90FD;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5206;&#x7C7B;&#x8D85;&#x5E73;&#x9762;&#xFF0C;&#x4F46;&#x6700;&#x4F18;&#x8D85;&#x5E73;&#x9762;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x6700;&#x4F18;&#x5206;&#x7C7B;&#x5E73;&#x9762;&#x4F7F;&#x95F4;&#x9694;&#x6700;&#x5927;&#x5316;&#x3002; &#x90A3;&#x662F;&#x4E0D;&#x662F;&#x67D0;&#x6761;&#x76F4;&#x7EBF;&#x6BD4;&#x5176;&#x4ED6;&#x7684;&#x66F4;&#x52A0;&#x5408;&#x9002;&#x5462;? &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x51ED;&#x76F4;&#x89C9;&#x6765;&#x5B9A;&#x4E49;&#x4E00;&#x6761;&#x8BC4;&#x4EF7;&#x76F4;&#x7EBF;&#x597D;&#x574F;&#x7684;&#x6807;&#x51C6;:</p>
<p>&#x8DDD;&#x79BB;&#x6837;&#x672C;&#x592A;&#x8FD1;&#x7684;&#x76F4;&#x7EBF;&#x4E0D;&#x662F;&#x6700;&#x4F18;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x7684;&#x76F4;&#x7EBF;&#x5BF9;&#x566A;&#x58F0;&#x654F;&#x611F;&#x5EA6;&#x9AD8;&#xFF0C;&#x6CDB;&#x5316;&#x6027;&#x8F83;&#x5DEE;&#x3002; &#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x627E;&#x5230;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#xFF08;&#x56FE;&#x4E2D;&#x7684;&#x6700;&#x4F18;&#x8D85;&#x5E73;&#x9762;&#xFF09;&#xFF0C;&#x79BB;&#x6240;&#x6709;&#x70B9;&#x7684;&#x8DDD;&#x79BB;&#x6700;&#x8FDC;&#x3002;
&#x7531;&#x6B64;&#xFF0C; SVM&#x7B97;&#x6CD5;&#x7684;&#x5B9E;&#x8D28;&#x662F;&#x627E;&#x51FA;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x5C06;&#x67D0;&#x4E2A;&#x503C;&#x6700;&#x5927;&#x5316;&#x7684;&#x8D85;&#x5E73;&#x9762;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x5C31;&#x662F;&#x8D85;&#x5E73;&#x9762;&#x79BB;&#x6240;&#x6709;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x7684;&#x6700;&#x5C0F;&#x8DDD;&#x79BB;&#x3002;&#x8FD9;&#x4E2A;&#x6700;&#x5C0F;&#x8DDD;&#x79BB;&#x7528;SVM&#x672F;&#x8BED;&#x6765;&#x8BF4;&#x53EB;&#x505A;&#x95F4;&#x9694;(margin) &#x3002;</p>
<p><strong>&#x4E8C;&#x3001;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x6700;&#x4F18;&#x8D85;&#x5E73;&#x9762;?</strong></p>
<p>1&#x3001;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#xFF1A;</p>
<p>&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x5E0C;&#x671B;&#x5206;&#x7C7B;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x70B9;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x662F;<img src="http://upload.wikimedia.org/math/a/1/f/a1fd49f304c1094efe3fda098d5eaa5f.png" alt="\mathbb{R}^2">&#x4E2D;&#x7684;&#x70B9;&#xFF0C;&#x800C;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;<img src="http://upload.wikimedia.org/math/3/0/c/30c28f76ef7517dbd19df4d4c683dbe6.png" alt="\mathbb{R}^n">&#x7684;&#x70B9;&#xFF08;&#x4E00;&#x4E2A;&#x8D85;&#x5E73;&#x9762;&#xFF0C;&#x5728;&#x4E8C;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x628A;&#x8FD9;&#x4E9B;&#x70B9;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;n-1&#x7EF4;&#x7684;&#x8D85;&#x5E73;&#x9762;&#x5206;&#x5F00;&#xFF0C;&#x901A;&#x5E38;&#x8FD9;&#x4E2A;&#x88AB;&#x79F0;&#x4E3A;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x5668;&#x3002;&#x6709;&#x5F88;&#x591A;&#x5206;&#x7C7B;&#x5668;&#x90FD;&#x7B26;&#x5408;&#x8FD9;&#x4E2A;&#x8981;&#x6C42;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8FD8;&#x5E0C;&#x671B;&#x627E;&#x5230;&#x5206;&#x7C7B;&#x6700;&#x4F73;&#x7684;&#x5E73;&#x9762;&#xFF0C;&#x5373;&#x4F7F;&#x5F97;&#x5C5E;&#x4E8E;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7C7B;&#x7684;&#x6570;&#x636E;&#x70B9;&#x95F4;&#x9694;&#x6700;&#x5927;&#x7684;&#x90A3;&#x4E2A;&#x9762;&#xFF0C;&#x8BE5;&#x9762;&#x4EA6;&#x79F0;&#x4E3A;&#x6700;&#x5927;&#x95F4;&#x9694;&#x8D85;&#x5E73;&#x9762;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x627E;&#x5230;&#x8FD9;&#x4E2A;&#x9762;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x5C31;&#x79F0;&#x4E3A;&#x6700;&#x5927;&#x95F4;&#x9694;&#x5206;&#x7C7B;&#x5668;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4ECE;&#x4E0B;&#x9762;&#x4E00;&#x4E2A;&#x56FE;&#x5F00;&#x59CB;&#xFF1A;</p>
<p><img src="img/20140502162406593.png" alt=""></p>
<p>&#x4E2D;&#x95F4;&#x90A3;&#x6761;&#x7EBF;&#x662F;wx + b =0&#xFF0C;&#x6211;&#x4EEC;&#x5F3A;&#x8C03;&#x6240;&#x6709;&#x70B9;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x8FDC;&#x79BB;&#x4E2D;&#x95F4;&#x90A3;&#x6761;&#x7EBF;&#x3002;&#x8003;&#x8651;&#x4E0A;&#x9762;3&#x4E2A;&#x70B9;A&#x3001;B&#x548C;C&#x3002;&#x4ECE;&#x56FE;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;A&#x662F;&#xD7;&#x7C7B;&#x522B;&#x7684;&#xFF0C;&#x7136;&#x800C;C&#x6211;&#x4EEC;&#x662F;&#x4E0D;&#x592A;&#x786E;&#x5B9A;&#x7684;&#xFF0C;B&#x8FD8;&#x7B97;&#x80FD;&#x591F;&#x786E;&#x5B9A;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF0C;&#x6211;&#x4EEC;&#x66F4;&#x5E94;&#x8BE5;&#x5173;&#x5FC3;&#x9760;&#x8FD1;&#x4E2D;&#x95F4;&#x5206;&#x5272;&#x7EBF;&#x7684;&#x70B9;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x8FDC;&#x79BB;&#x4E2D;&#x95F4;&#x7EBF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x6240;&#x6709;&#x70B9;&#x4E0A;&#x8FBE;&#x5230;&#x6700;&#x4F18;&#x3002;&#x56E0;&#x4E3A;&#x90A3;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x8981;&#x4F7F;&#x5F97;&#x4E00;&#x90E8;&#x5206;&#x70B9;&#x9760;&#x8FD1;&#x4E2D;&#x95F4;&#x7EBF;&#x6765;&#x6362;&#x53D6;&#x53E6;&#x5916;&#x4E00;&#x90E8;&#x5206;&#x70B9;&#x66F4;&#x52A0;&#x8FDC;&#x79BB;&#x4E2D;&#x95F4;&#x7EBF;&#x3002;&#x540C;&#x65F6;&#x8FD9;&#x4E2A;&#x6240;&#x8C13;&#x7684;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x7684;&#x786E;&#x628A;&#x8FD9;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x5F62;&#x72B6;&#x7684;&#x6570;&#x636E;&#x70B9;&#x5206;&#x9694;&#x5F00;&#x6765;&#xFF0C;&#x5728;&#x8D85;&#x5E73;&#x9762;&#x4E00;&#x8FB9;&#x7684;&#x6570;&#x636E;&#x70B9;&#x6240;&#x5BF9;&#x5E94;&#x7684; y &#x5168;&#x662F; -1 &#xFF0C;&#x800C;&#x5728;&#x53E6;&#x4E00;&#x8FB9;&#x5168;&#x662F; 1 &#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4EE4;&#x5206;&#x7C7B;&#x51FD;&#x6570;&#xFF1A;</p>
<p><img src="img/20131107201211968" alt=""></p>
<p>&#x663E;&#x7136;&#xFF0C;&#x5982;&#x679C; f(x)=0 &#xFF0C;&#x90A3;&#x4E48; x &#x662F;&#x4F4D;&#x4E8E;&#x8D85;&#x5E73;&#x9762;&#x4E0A;&#x7684;&#x70B9;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x59A8;&#x8981;&#x6C42;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x6EE1;&#x8DB3; f(x)<0 的点，其对应的="" y="" 等于="" -1="" ，而="" f(x)="">0 &#x5219;&#x5BF9;&#x5E94; y=1 &#x7684;&#x6570;&#x636E;&#x70B9;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#x3002;</0></p>
<p><img src="img/20140502163842531.jpg" alt=""></p>
<p>&#x6700;&#x4F18;&#x8D85;&#x5E73;&#x9762;&#x53EF;&#x4EE5;&#x6709;&#x65E0;&#x6570;&#x79CD;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x4EFB;&#x610F;&#x7684;&#x7F29;&#x653E; <strong>w</strong> &#x548C; <strong>b</strong> &#x3002; &#x4E60;&#x60EF;&#x4E0A;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x65B9;&#x5F0F;&#x6765;&#x8868;&#x8FBE;&#x6700;&#x4F18;&#x8D85;&#x5E73;&#x9762;</p>
<p><img src="img/20140502204659421.jpg" alt="|\beta_{0} + \beta^{T} x| = 1"> <strong>=1</strong></p>
<p>&#x5F0F;&#x4E2D; <img src="img/26eeb5258ca5099acf8fe96b2a1049c48c89a5e6.png" alt="x"> &#x8868;&#x793A;&#x79BB;&#x8D85;&#x5E73;&#x9762;&#x6700;&#x8FD1;&#x7684;&#x90A3;&#x4E9B;&#x70B9;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x652F;&#x6301;&#x5411;&#x91CF;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4E3A;&#xFF1A;y(wx + b) = 1&#xFF0C;</p>
<p>&#x4E0A;&#x9762;&#x8BF4;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x4EE4;&#x4E24;&#x7C7B;&#x7684;&#x70B9;&#x5206;&#x522B;&#x4E3A;+1, -1&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x6709;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x70B9;x&#x9700;&#x8981;&#x9884;&#x6D4B;&#x5C5E;&#x4E8E;&#x54EA;&#x4E2A;&#x5206;&#x7C7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x7528;sgn(f(x))&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x9884;&#x6D4B;&#x4E86;&#xFF0C;sgn&#x8868;&#x793A;&#x7B26;&#x53F7;&#x51FD;&#x6570;&#xFF0C;&#x5F53;f(x) &gt; 0&#x7684;&#x65F6;&#x5019;&#xFF0C;sgn(f(x)) = +1, &#x5F53;f(x) &lt; 0&#x7684;&#x65F6;&#x5019;sgn(f(x)) = &#x2013;1&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x51E0;&#x4F55;&#x5B66;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x70B9; <img src="img/26eeb5258ca5099acf8fe96b2a1049c48c89a5e6.png" alt="x"> &#x5230;&#x8D85;&#x5E73;&#x9762; <img src="http://www.opencv.org.cn/opencvdoc/2.3.2/html/_images/math/63a5e2b53001253e0447d8ebf105843ab3873438.png" alt="(\beta, \beta_{0})"> &#x7684;&#x8DDD;&#x79BB;&#x4E3A;:</p>
<p><img src="img/20140502205728468.jpg" alt=""></p>
<p>&#x7279;&#x522B;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x8D85;&#x5E73;&#x9762;, &#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x7684;&#x5206;&#x5B50;&#x4E3A;1&#xFF0C;&#x56E0;&#x6B64;&#x652F;&#x6301;&#x5411;&#x91CF;&#x5230;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x8DDD;&#x79BB;&#x662F;</p>
<p><img src="img/20140502205931687.jpg" alt=""></p>
<p>||w||&#x7684;&#x610F;&#x601D;&#x662F;w&#x7684;&#x4E8C;&#x8303;&#x6570;&#x3002;</p>
<p>&#x521A;&#x624D;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86;&#x95F4;&#x9694;(margin),&#x8FD9;&#x91CC;&#x8868;&#x793A;&#x4E3A; <img src="http://www.opencv.org.cn/opencvdoc/2.3.2/html/_images/math/5d1e4485dc90c450e8c76826516c1b2ccb8fce16.png" alt="M">, &#x5B83;&#x7684;&#x53D6;&#x503C;&#x662F;&#x6700;&#x8FD1;&#x8DDD;&#x79BB;&#x7684;2&#x500D;:</p>
<pre><code>M = 2 / ||w||
</code></pre><p>&#x6700;&#x5927;&#x5316;&#x8FD9;&#x4E2A;&#x5F0F;&#x5B50;&#x7B49;&#x4EF7;&#x4E8E;&#x6700;&#x5C0F;&#x5316;||w||, &#x53E6;&#x5916;&#x7531;&#x4E8E;||w||&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BF9;&#x5176;&#x52A0;&#x5165;&#x5E73;&#x65B9;&#xFF0C;&#x548C;&#x524D;&#x9762;&#x7684;&#x7CFB;&#x6570;&#xFF0C;&#x719F;&#x6089;&#x7684;&#x540C;&#x5B66;&#x5E94;&#x8BE5;&#x5F88;&#x5BB9;&#x6613;&#x5C31;&#x770B;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5F0F;&#x5B50;&#x662F;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x6C42;&#x5BFC;&#x3002;</p>
<p>&#x6700;&#x540E;&#x6700;&#x5927;&#x5316; <img src="img/5d1e4485dc90c450e8c76826516c1b2ccb8fce16.png" alt="M"> &#x8F6C;&#x5316;&#x4E3A;&#x5728;&#x9644;&#x52A0;&#x9650;&#x5236;&#x6761;&#x4EF6;&#x4E0B;&#x6700;&#x5C0F;&#x5316;&#x51FD;&#x6570;&#xFF1A;</p>
<p><img src="img/20140502212218390.jpg" alt=""></p>
<p>&#x5373;&#xFF1A;<img src="img/1351141837_7366.jpg" alt=""></p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x4F18;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x4E58;&#x6570;&#x6CD5;&#x5F97;&#x5230;&#x6700;&#x4F18;&#x8D85;&#x5E73;&#x9762;&#x7684;&#x6743;&#x91CD;&#x5411;&#x91CF;<strong>W</strong>&#x548C;&#x504F;&#x7F6E; <strong>b</strong> &#x3002;</p>
<p><img src="img/20140502212752609.jpg" alt=""></p>
<p>PS</p>
<p>1&#x3001;&#x54B1;&#x4EEC;&#x5C31;&#x8981;&#x786E;&#x5B9A;&#x4E0A;&#x8FF0;&#x5206;&#x7C7B;&#x51FD;&#x6570;f(x) = w.x + b&#xFF08;w.x&#x8868;&#x793A;w&#x4E0E;x&#x7684;&#x5185;&#x79EF;&#xFF09;&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x53C2;&#x6570;w&#x548C;b&#xFF0C;&#x901A;&#x4FD7;&#x7406;&#x89E3;&#x7684;&#x8BDD;w&#x662F;&#x6CD5;&#x5411;&#x91CF;&#xFF0C;b&#x662F;&#x622A;&#x8DDD;;</p>
<p>2&#x3001;&#x90A3;&#x5982;&#x4F55;&#x786E;&#x5B9A;w&#x548C;b&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x5BFB;&#x627E;&#x4E24;&#x6761;&#x8FB9;&#x754C;&#x7AEF;&#x6216;&#x6781;&#x7AEF;&#x5212;&#x5206;&#x76F4;&#x7EBF;&#x4E2D;&#x95F4;&#x7684;&#x6700;&#x5927;&#x95F4;&#x9694;&#xFF08;&#x4E4B;&#x6240;&#x4EE5;&#x8981;&#x5BFB;&#x6700;&#x5927;&#x95F4;&#x9694;&#x662F;&#x4E3A;&#x4E86;&#x80FD;&#x66F4;&#x597D;&#x7684;&#x5212;&#x5206;&#x4E0D;&#x540C;&#x7C7B;&#x7684;&#x70B9;&#xFF0C;&#x4E0B;&#x6587;&#x4F60;&#x5C06;&#x770B;&#x5230;&#xFF1A;&#x4E3A;&#x5BFB;&#x6700;&#x5927;&#x95F4;&#x9694;&#xFF0C;&#x5BFC;&#x51FA;1/2||w||^2&#xFF0C;&#x7EE7;&#x800C;&#x5F15;&#x5165;&#x62C9;&#x683C;&#x6717;&#x65E5;&#x51FD;&#x6570;&#x548C;&#x5BF9;&#x5076;&#x53D8;&#x91CF;a&#xFF0C;&#x5316;&#x4E3A;&#x5BF9;&#x5355;&#x4E00;&#x56E0;&#x6570;&#x5BF9;&#x5076;&#x53D8;&#x91CF;a&#x7684;&#x6C42;&#x89E3;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x662F;&#x540E;&#x8BDD;&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x786E;&#x5B9A;&#x6700;&#x7EC8;&#x7684;&#x6700;&#x5927;&#x95F4;&#x9694;&#x5206;&#x7C7B;&#x8D85;&#x5E73;&#x9762;hyper plane&#x548C;&#x5206;&#x7C7B;&#x51FD;&#x6570;&#xFF1B;</p>
<p>3&#x3001;&#x8FDB;&#x800C;&#x628A;&#x5BFB;&#x6C42;&#x5206;&#x7C7B;&#x51FD;&#x6570;f(x) = w.x + b&#x7684;&#x95EE;&#x9898;&#x8F6C;&#x5316;&#x4E3A;&#x5BF9;w&#xFF0C;b&#x7684;&#x6700;&#x4F18;&#x5316;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x7EC8;&#x5316;&#x4E3A;&#x5BF9;&#x5076;&#x56E0;&#x5B50;&#x7684;&#x6C42;&#x89E3;&#x3002;</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="./svm.html" class="navigation navigation-prev " aria-label="Previous page: SVM"><i class="fa fa-angle-left"></i></a>
        
        
        <a href="./svm-2.html" class="navigation navigation-next " aria-label="Next page: 拉格朗日对偶"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-comment/plugin.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"comment":{"highlightCommented":true},"autocover":{},"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
