
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>卷积神经网络 · TensorFlow 教程（Hvass）</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="wizardforcel">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-comment/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../03_PrettyTensor_zh_CN/03_PrettyTensor_zh_CN.html" />
    
    
    <link rel="prev" href="../01_Simple_Linear_Model_zh_CN/01_Simple_Linear_Model_zh_CN.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/wizardforcel/tf-tut-hvass" target="_blank" class="custom-link">TensorFlow 教程（Hvass）</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    TensorFlow 教程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../01_Simple_Linear_Model_zh_CN/01_Simple_Linear_Model_zh_CN.html">
            
                <a href="../01_Simple_Linear_Model_zh_CN/01_Simple_Linear_Model_zh_CN.html">
            
                    
                    简单线性模型
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="02_Convolutional_Neural_Network_zh_CN.html">
            
                <a href="02_Convolutional_Neural_Network_zh_CN.html">
            
                    
                    卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../03_PrettyTensor_zh_CN/03_PrettyTensor_zh_CN.html">
            
                <a href="../03_PrettyTensor_zh_CN/03_PrettyTensor_zh_CN.html">
            
                    
                    PrettyTensor
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../04_Save_Restore_zh_CN/04_Save_Restore_zh_CN.html">
            
                <a href="../04_Save_Restore_zh_CN/04_Save_Restore_zh_CN.html">
            
                    
                    保存 & 恢复
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../05_Ensemble_Learning_zh_CN/05_Ensemble_Learning_zh_CN.html">
            
                <a href="../05_Ensemble_Learning_zh_CN/05_Ensemble_Learning_zh_CN.html">
            
                    
                    集成学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../06_CIFAR-10_zh_CN/06_CIFAR-10_zh_CN.html">
            
                <a href="../06_CIFAR-10_zh_CN/06_CIFAR-10_zh_CN.html">
            
                    
                    CIFAR-10
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="../07_Inception_Model_zh_CN/07_Inception_Model_zh_CN.html">
            
                <a href="../07_Inception_Model_zh_CN/07_Inception_Model_zh_CN.html">
            
                    
                    Inception 模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="../08_Transfer_Learning_zh_CN/08_Transfer_Learning_zh_CN.html">
            
                <a href="../08_Transfer_Learning_zh_CN/08_Transfer_Learning_zh_CN.html">
            
                    
                    迁移学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="../09_Video_Data_zh_CN/09_Video_Data_zh_CN.html">
            
                <a href="../09_Video_Data_zh_CN/09_Video_Data_zh_CN.html">
            
                    
                    视频数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="../11_Adversarial_Examples_zh_CN/11_Adversarial_Examples_zh_CN.html">
            
                <a href="../11_Adversarial_Examples_zh_CN/11_Adversarial_Examples_zh_CN.html">
            
                    
                    对抗样本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="../12_Adversarial_Noise_MNIST_zh_CN/12_Adversarial_Noise_MNIST_zh_CN.html">
            
                <a href="../12_Adversarial_Noise_MNIST_zh_CN/12_Adversarial_Noise_MNIST_zh_CN.html">
            
                    
                    MNIST的对抗噪声
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="../13_Visual_Analysis_zh_CN/13_Visual_Analysis_zh_CN.html">
            
                <a href="../13_Visual_Analysis_zh_CN/13_Visual_Analysis_zh_CN.html">
            
                    
                    可视化分析
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="../14_DeepDream_zh_CN/14_DeepDream_zh_CN.html">
            
                <a href="../14_DeepDream_zh_CN/14_DeepDream_zh_CN.html">
            
                    
                    DeepDream
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="../15_Style_Transfer_zh_CN/15_Style_Transfer_zh_CN.html">
            
                <a href="../15_Style_Transfer_zh_CN/15_Style_Transfer_zh_CN.html">
            
                    
                    风格迁移
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >卷积神经网络</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="tensorflow-&#x6559;&#x7A0B;-02">TensorFlow &#x6559;&#x7A0B; #02</h1>
<h1 id="&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;">&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;</h1>
<p>by <a href="http://www.hvass-labs.org/" target="_blank">Magnus Erik Hvass Pedersen</a>
/ <a href="https://github.com/Hvass-Labs/TensorFlow-Tutorials" target="_blank">GitHub</a> / <a href="https://www.youtube.com/playlist?list=PL9Hr9sNUjfsmEu1ZniY0XpHSzl5uihcXZ" target="_blank">Videos on YouTube</a></p>
<p>&#x4E2D;&#x6587;&#x7FFB;&#x8BD1; <a href="https://zhuanlan.zhihu.com/insight-pixel" target="_blank">thrillerist</a>/<a href="https://github.com/thrillerist/TensorFlow-Tutorials" target="_blank">Github</a></p>
<h2 id="&#x4ECB;&#x7ECD;">&#x4ECB;&#x7ECD;</h2>
<p>&#x5148;&#x524D;&#x7684;&#x6559;&#x7A0B;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#xFF0C;&#x5BF9;MNIST&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x624B;&#x5199;&#x6570;&#x5B57;&#x7684;&#x8BC6;&#x522B;&#x7387;&#x8FBE;&#x5230;&#x4E86;91%&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x6559;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5728;TensorFlow&#x4E2D;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5B83;&#x80FD;&#x8FBE;&#x5230;&#x5927;&#x7EA6;99%&#x7684;&#x5206;&#x7C7B;&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#x7684;&#x7EC3;&#x4E60;&#xFF0C;&#x51C6;&#x786E;&#x7387;&#x8FD8;&#x53EF;&#x80FD;&#x66F4;&#x9AD8;&#x3002;</p>
<p>&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x4E00;&#x5F20;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x4E0A;&#x79FB;&#x52A8;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x6EE4;&#x6CE2;&#x5668;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;&#x904D;&#x5386;&#x6574;&#x5F20;&#x56FE;&#x50CF;&#x6765;&#x8BC6;&#x522B;&#x6A21;&#x5F0F;&#x65F6;&#xFF0C;&#x8981;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6EE4;&#x6CE2;&#x5668;&#x3002;&#x8FD9;&#x8BA9;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x62E5;&#x6709;&#x76F8;&#x540C;&#x6570;&#x91CF;&#x7684;&#x53D8;&#x91CF;&#x65F6;&#x6BD4;&#x5168;&#x8FDE;&#x63A5;&#x7F51;&#x7EDC;&#xFF08;Fully-Connected&#xFF09;&#x66F4;&#x5F3A;&#x5927;&#xFF0C;&#x4E5F;&#x8BA9;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x5F97;&#x66F4;&#x5FEB;&#x3002;</p>
<p>&#x4F60;&#x5E94;&#x8BE5;&#x719F;&#x6089;&#x57FA;&#x672C;&#x7684;&#x7EBF;&#x6027;&#x4EE3;&#x6570;&#x3001;Python&#x548C;Jupyter Notebook&#x7F16;&#x8F91;&#x5668;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;TensorFlow&#x65B0;&#x624B;&#xFF0C;&#x5728;&#x672C;&#x6559;&#x7A0B;&#x4E4B;&#x524D;&#x5E94;&#x8BE5;&#x5148;&#x5B66;&#x4E60;&#x7B2C;&#x4E00;&#x7BC7;&#x6559;&#x7A0B;&#x3002;</p>
<h2 id="&#x6D41;&#x7A0B;&#x56FE;">&#x6D41;&#x7A0B;&#x56FE;</h2>
<p>&#x4E0B;&#x9762;&#x7684;&#x56FE;&#x8868;&#x76F4;&#x63A5;&#x663E;&#x793A;&#x4E86;&#x4E4B;&#x540E;&#x5B9E;&#x73B0;&#x7684;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x6570;&#x636E;&#x7684;&#x4F20;&#x9012;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> IPython.display <span class="hljs-keyword">import</span> Image
Image(<span class="hljs-string">&apos;images/02_network_flowchart.png&apos;</span>)
</code></pre>
<p><img src="output_4_0.png" alt="png"></p>
<p>&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x5728;&#x7B2C;&#x4E00;&#x5C42;&#x5377;&#x79EF;&#x5C42;&#x91CC;&#x4F7F;&#x7528;&#x6743;&#x91CD;&#x8FC7;&#x6EE4;&#x5668;&#x5904;&#x7406;&#x3002;&#x7ED3;&#x679C;&#x5728;16&#x5F20;&#x65B0;&#x56FE;&#x91CC;&#xFF0C;&#x6BCF;&#x5F20;&#x4EE3;&#x8868;&#x4E86;&#x5377;&#x79EF;&#x5C42;&#x91CC;&#x4E00;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#xFF08;&#x7684;&#x5904;&#x7406;&#x7ED3;&#x679C;&#xFF09;&#x3002;&#x56FE;&#x50CF;&#x7ECF;&#x8FC7;&#x964D;&#x91C7;&#x6837;&#xFF0C;&#x5206;&#x8FA8;&#x7387;&#x4ECE;28x28&#x51CF;&#x5C11;&#x5230;14x14&#x3002;</p>
<p>16&#x5F20;&#x5C0F;&#x56FE;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x4E2D;&#x5904;&#x7406;&#x3002;&#x8FD9;16&#x4E2A;&#x901A;&#x9053;&#x4EE5;&#x53CA;&#x8FD9;&#x5C42;&#x8F93;&#x51FA;&#x7684;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FC7;&#x6EE4;&#x6743;&#x91CD;&#x3002;&#x603B;&#x5171;&#x6709;36&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x6709;16 x 36 = 576&#x4E2A;&#x6EE4;&#x6CE2;&#x5668;&#x3002;&#x8F93;&#x51FA;&#x56FE;&#x518D;&#x4E00;&#x6B21;&#x964D;&#x91C7;&#x6837;&#x5230;7x7&#x4E2A;&#x50CF;&#x7D20;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x662F;36&#x5F20;7x7&#x50CF;&#x7D20;&#x7684;&#x56FE;&#x50CF;&#x3002;&#x5B83;&#x4EEC;&#x88AB;&#x8F6C;&#x6362;&#x5230;&#x4E00;&#x4E2A;&#x957F;&#x4E3A;7 x 7 x 36 = 1764&#x7684;&#x5411;&#x91CF;&#x4E2D;&#x53BB;&#xFF0C;&#x5B83;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6709;128&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#xFF08;&#x6216;&#x5143;&#x7D20;&#xFF09;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x5165;&#x3002;&#x8FD9;&#x4E9B;&#x53C8;&#x8F93;&#x5165;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x6709;10&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x7C7B;&#x522B;&#xFF0C;&#x7528;&#x6765;&#x786E;&#x5B9A;&#x56FE;&#x50CF;&#x7684;&#x7C7B;&#x522B;&#xFF0C;&#x5373;&#x56FE;&#x50CF;&#x4E0A;&#x7684;&#x6570;&#x5B57;&#x3002;</p>
<p>&#x5377;&#x79EF;&#x6EE4;&#x6CE2;&#x4E00;&#x5F00;&#x59CB;&#x662F;&#x968F;&#x673A;&#x6311;&#x9009;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5206;&#x7C7B;&#x4E5F;&#x662F;&#x968F;&#x673A;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x6839;&#x636E;&#x4EA4;&#x53C9;&#x71B5;&#xFF08;cross-entropy&#xFF09;&#x6765;&#x6D4B;&#x91CF;&#x8F93;&#x5165;&#x56FE;&#x9884;&#x6D4B;&#x503C;&#x548C;&#x771F;&#x5B9E;&#x7C7B;&#x522B;&#x95F4;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x7136;&#x540E;&#x4F18;&#x5316;&#x5668;&#x7528;&#x94FE;&#x5F0F;&#x6CD5;&#x5219;&#x81EA;&#x52A8;&#x5730;&#x5C06;&#x8FD9;&#x4E2A;&#x8BEF;&#x5DEE;&#x5728;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x4E2D;&#x4F20;&#x9012;&#xFF0C;&#x66F4;&#x65B0;&#x6EE4;&#x6CE2;&#x6743;&#x91CD;&#x6765;&#x63D0;&#x5347;&#x5206;&#x7C7B;&#x8D28;&#x91CF;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x8FED;&#x4EE3;&#x4E86;&#x51E0;&#x5343;&#x6B21;&#xFF0C;&#x76F4;&#x5230;&#x5206;&#x7C7B;&#x8BEF;&#x5DEE;&#x8DB3;&#x591F;&#x4F4E;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x6EE4;&#x6CE2;&#x6743;&#x91CD;&#x548C;&#x4E2D;&#x95F4;&#x56FE;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x7ED3;&#x679C;&#xFF0C;&#x548C;&#x4F60;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x6240;&#x770B;&#x5230;&#x7684;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5728;TensorFlow&#x4E0A;&#x7684;&#x8BA1;&#x7B97;&#x662F;&#x5728;&#x4E00;&#x90E8;&#x5206;&#x56FE;&#x50CF;&#x4E0A;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x975E;&#x5355;&#x72EC;&#x7684;&#x4E00;&#x5F20;&#x56FE;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x8BA1;&#x7B97;&#x66F4;&#x6709;&#x6548;&#x3002;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x5728;TensorFlow&#x4E0A;&#x5B9E;&#x73B0;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x6D41;&#x7A0B;&#x56FE;&#x5B9E;&#x9645;&#x4E0A;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;&#x7EF4;&#x5EA6;&#x3002;</p>
<h2 id="&#x5377;&#x79EF;&#x5C42;">&#x5377;&#x79EF;&#x5C42;</h2>
<p>&#x4E0B;&#x9762;&#x7684;&#x56FE;&#x7247;&#x5C55;&#x793A;&#x4E86;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x4E2D;&#x5904;&#x7406;&#x56FE;&#x50CF;&#x7684;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x3002;&#x8F93;&#x5165;&#x56FE;&#x7247;&#x63CF;&#x7ED8;&#x4E86;&#x6570;&#x5B57;7&#xFF0C;&#x8FD9;&#x91CC;&#x663E;&#x793A;&#x4E86;&#x5B83;&#x7684;&#x56DB;&#x5F20;&#x62F7;&#x8D1D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x6E05;&#x6670;&#x7684;&#x770B;&#x5230;&#x6EE4;&#x6CE2;&#x5668;&#x662F;&#x5982;&#x4F55;&#x5728;&#x56FE;&#x50CF;&#x7684;&#x4E0D;&#x540C;&#x4F4D;&#x7F6E;&#x79FB;&#x52A8;&#x3002;&#x5728;&#x6EE4;&#x6CE2;&#x5668;&#x7684;&#x6BCF;&#x4E2A;&#x4F4D;&#x7F6E;&#x4E0A;&#xFF0C;&#x8BA1;&#x7B97;&#x6EE4;&#x6CE2;&#x5668;&#x4EE5;&#x53CA;&#x6EE4;&#x6CE2;&#x5668;&#x4E0B;&#x65B9;&#x56FE;&#x50CF;&#x50CF;&#x7D20;&#x7684;&#x70B9;&#x4E58;&#xFF0C;&#x5F97;&#x5230;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#x7684;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x6574;&#x5F20;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x4E0A;&#x79FB;&#x52A8;&#x65F6;&#xFF0C;&#x4F1A;&#x6709;&#x4E00;&#x5F20;&#x65B0;&#x7684;&#x56FE;&#x50CF;&#x751F;&#x6210;&#x3002;</p>
<p>&#x7EA2;&#x8272;&#x7684;&#x6EE4;&#x6CE2;&#x6743;&#x91CD;&#x8868;&#x793A;&#x6EE4;&#x6CE2;&#x5668;&#x5BF9;&#x8F93;&#x5165;&#x56FE;&#x7684;&#x9ED1;&#x8272;&#x50CF;&#x7D20;&#x6709;&#x6B63;&#x54CD;&#x5E94;&#xFF0C;&#x84DD;&#x8272;&#x7684;&#x4EE3;&#x8868;&#x6709;&#x8D1F;&#x54CD;&#x5E94;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5F88;&#x660E;&#x663E;&#x8FD9;&#x4E2A;&#x6EE4;&#x6CE2;&#x5668;&#x8BC6;&#x522B;&#x6570;&#x5B57;7&#x7684;&#x6C34;&#x5E73;&#x7EBF;&#x6BB5;&#xFF0C;&#x5728;&#x8F93;&#x51FA;&#x56FE;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5B83;&#x5BF9;&#x7EBF;&#x6BB5;&#x7684;&#x5F3A;&#x70C8;&#x54CD;&#x5E94;&#x3002;</p>
<pre><code class="lang-python">Image(<span class="hljs-string">&apos;images/02_convolution.png&apos;</span>)
</code></pre>
<p><img src="output_8_0.png" alt="png"></p>
<p>&#x6EE4;&#x6CE2;&#x5668;&#x904D;&#x5386;&#x8F93;&#x5165;&#x56FE;&#x7684;&#x79FB;&#x52A8;&#x6B65;&#x957F;&#x79F0;&#x4E3A;stride&#x3002;&#x5728;&#x6C34;&#x5E73;&#x548C;&#x7AD6;&#x76F4;&#x65B9;&#x5411;&#x5404;&#x6709;&#x4E00;&#x4E2A;stride&#x3002;</p>
<p>&#x5728;&#x4E0B;&#x9762;&#x7684;&#x6E90;&#x7801;&#x4E2D;&#xFF0C;&#x4E24;&#x4E2A;&#x65B9;&#x5411;&#x7684;stride&#x90FD;&#x8BBE;&#x4E3A;1&#xFF0C;&#x8FD9;&#x8BF4;&#x660E;&#x6EE4;&#x6CE2;&#x5668;&#x4ECE;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x7684;&#x5DE6;&#x4E0A;&#x89D2;&#x5F00;&#x59CB;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x79FB;&#x52A8;&#x5230;&#x53F3;&#x8FB9;1&#x4E2A;&#x50CF;&#x7D20;&#x53BB;&#x3002;&#x5F53;&#x6EE4;&#x6CE2;&#x5668;&#x5230;&#x8FBE;&#x56FE;&#x50CF;&#x7684;&#x53F3;&#x8FB9;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x8FD4;&#x56DE;&#x6700;&#x5DE6;&#x8FB9;&#xFF0C;&#x7136;&#x540E;&#x5411;&#x4E0B;&#x79FB;&#x52A8;1&#x4E2A;&#x50CF;&#x7D20;&#x3002;&#x6301;&#x7EED;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x76F4;&#x5230;&#x6EE4;&#x6CE2;&#x5668;&#x5230;&#x8FBE;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x7684;&#x53F3;&#x4E0B;&#x89D2;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x751F;&#x6210;&#x4E86;&#x6574;&#x5F20;&#x8F93;&#x51FA;&#x56FE;&#x7247;&#x3002;</p>
<p>&#x5F53;&#x6EE4;&#x6CE2;&#x5668;&#x5230;&#x8FBE;&#x8F93;&#x5165;&#x56FE;&#x7684;&#x53F3;&#x7AEF;&#x6216;&#x5E95;&#x90E8;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x7528;&#x96F6;&#xFF08;&#x767D;&#x8272;&#x50CF;&#x7D20;&#xFF09;&#x6765;&#x586B;&#x5145;&#x3002;&#x56E0;&#x4E3A;&#x8F93;&#x51FA;&#x56FE;&#x8981;&#x548C;&#x8F93;&#x5165;&#x56FE;&#x4E00;&#x6837;&#x5927;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x53EF;&#x80FD;&#x4F1A;&#x4F20;&#x9012;&#x7ED9;&#x4FEE;&#x6B63;&#x7EBF;&#x6027;&#x5355;&#x5143;&#xFF08;ReLU&#xFF09;&#xFF0C;&#x5B83;&#x7528;&#x6765;&#x4FDD;&#x8BC1;&#x8F93;&#x51FA;&#x662F;&#x6B63;&#x503C;&#xFF0C;&#x5C06;&#x8D1F;&#x503C;&#x7F6E;&#x4E3A;&#x96F6;&#x3002;&#x8F93;&#x51FA;&#x8FD8;&#x4F1A;&#x7528;&#x6700;&#x5927;&#x6C60;&#x5316;(max-pooling)&#x8FDB;&#x884C;&#x964D;&#x91C7;&#x6837;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x4E86;2x2&#x7684;&#x5C0F;&#x7A97;&#x53E3;&#xFF0C;&#x53EA;&#x4FDD;&#x7559;&#x50CF;&#x7D20;&#x4E2D;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;&#x8FD9;&#x8BA9;&#x8F93;&#x5165;&#x56FE;&#x5206;&#x8FA8;&#x7387;&#x51CF;&#x5C0F;&#x4E00;&#x534A;&#xFF0C;&#x6BD4;&#x5982;&#x4ECE;28x28&#x5230;14x14&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6709;16&#x4E2A;&#x8F93;&#x5165;&#x901A;&#x9053;&#x3002;&#x6211;&#x4EEC;&#x60F3;&#x7ED9;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6EE4;&#x6CE2;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;16&#x4E2A;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x4ECE;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x5F97;&#x5230;36&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x56E0;&#x6B64;&#x603B;&#x5171;&#x9700;&#x8981;16 x 36 = 576&#x4E2A;&#x6EE4;&#x6CE2;&#x5668;&#x3002;&#x8981;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x53EF;&#x80FD;&#x6709;&#x4E9B;&#x56F0;&#x96BE;&#x3002;</p>
<h2 id="&#x5BFC;&#x5165;">&#x5BFC;&#x5165;</h2>
<pre><code class="lang-python">%matplotlib inline
<span class="hljs-keyword">import</span> matplotlib.pyplot <span class="hljs-keyword">as</span> plt
<span class="hljs-keyword">import</span> tensorflow <span class="hljs-keyword">as</span> tf
<span class="hljs-keyword">import</span> numpy <span class="hljs-keyword">as</span> np
<span class="hljs-keyword">from</span> sklearn.metrics <span class="hljs-keyword">import</span> confusion_matrix
<span class="hljs-keyword">import</span> time
<span class="hljs-keyword">from</span> datetime <span class="hljs-keyword">import</span> timedelta
<span class="hljs-keyword">import</span> math
</code></pre>
<p>&#x4F7F;&#x7528;Python3.5.2&#xFF08;Anaconda&#xFF09;&#x5F00;&#x53D1;&#xFF0C;TensorFlow&#x7248;&#x672C;&#x662F;&#xFF1A;</p>
<pre><code class="lang-python">tf.__version__
</code></pre>
<pre><code>&apos;0.12.0-rc0&apos;
</code></pre><h2 id="&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x914D;&#x7F6E;">&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x914D;&#x7F6E;</h2>
<p>&#x65B9;&#x4FBF;&#x8D77;&#x89C1;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x5B9A;&#x4E49;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x627E;&#x5230;&#x6216;&#x6539;&#x53D8;&#x8FD9;&#x4E9B;&#x6570;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x8FD0;&#x884C;Notebook&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-comment"># Convolutional Layer 1.</span>
filter_size1 = <span class="hljs-number">5</span>          <span class="hljs-comment"># Convolution filters are 5 x 5 pixels.</span>
num_filters1 = <span class="hljs-number">16</span>         <span class="hljs-comment"># There are 16 of these filters.</span>

<span class="hljs-comment"># Convolutional Layer 2.</span>
filter_size2 = <span class="hljs-number">5</span>          <span class="hljs-comment"># Convolution filters are 5 x 5 pixels.</span>
num_filters2 = <span class="hljs-number">36</span>         <span class="hljs-comment"># There are 36 of these filters.</span>

<span class="hljs-comment"># Fully-connected layer.</span>
fc_size = <span class="hljs-number">128</span>             <span class="hljs-comment"># Number of neurons in fully-connected layer.</span>
</code></pre>
<h2 id="&#x8F7D;&#x5165;&#x6570;&#x636E;">&#x8F7D;&#x5165;&#x6570;&#x636E;</h2>
<p>MNIST&#x6570;&#x636E;&#x96C6;&#x5927;&#x7EA6;12MB&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x5728;&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#x627E;&#x5230;&#x5C31;&#x4F1A;&#x81EA;&#x52A8;&#x4E0B;&#x8F7D;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> tensorflow.examples.tutorials.mnist <span class="hljs-keyword">import</span> input_data
data = input_data.read_data_sets(<span class="hljs-string">&apos;data/MNIST/&apos;</span>, one_hot=<span class="hljs-keyword">True</span>)
</code></pre>
<pre><code>Extracting data/MNIST/train-images-idx3-ubyte.gz
Extracting data/MNIST/train-labels-idx1-ubyte.gz
Extracting data/MNIST/t10k-images-idx3-ubyte.gz
Extracting data/MNIST/t10k-labels-idx1-ubyte.gz
</code></pre><p>&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x8F7D;&#x5165;&#x4E86;MNIST&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5B83;&#x7531;70,000&#x5F20;&#x56FE;&#x50CF;&#x548C;&#x5BF9;&#x5E94;&#x7684;&#x6807;&#x7B7E;&#xFF08;&#x6BD4;&#x5982;&#x56FE;&#x50CF;&#x7684;&#x7C7B;&#x522B;&#xFF09;&#x7EC4;&#x6210;&#x3002;&#x6570;&#x636E;&#x96C6;&#x5206;&#x6210;&#x4E09;&#x4EFD;&#x4E92;&#x76F8;&#x72EC;&#x7ACB;&#x7684;&#x5B50;&#x96C6;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x6559;&#x7A0B;&#x4E2D;&#x53EA;&#x7528;&#x8BAD;&#x7EC3;&#x96C6;&#x548C;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;</p>
<pre><code class="lang-python">print(<span class="hljs-string">&quot;Size of:&quot;</span>)
print(<span class="hljs-string">&quot;- Training-set:\t\t{}&quot;</span>.format(len(data.train.labels)))
print(<span class="hljs-string">&quot;- Test-set:\t\t{}&quot;</span>.format(len(data.test.labels)))
print(<span class="hljs-string">&quot;- Validation-set:\t{}&quot;</span>.format(len(data.validation.labels)))
</code></pre>
<pre><code>Size of:
- Training-set:        55000
- Test-set:        10000
- Validation-set:    5000
</code></pre><p>&#x7C7B;&#x578B;&#x6807;&#x7B7E;&#x4F7F;&#x7528;One-Hot&#x7F16;&#x7801;&#xFF0C;&#x8FD9;&#x610F;&#x5916;&#x6BCF;&#x4E2A;&#x6807;&#x7B7E;&#x662F;&#x957F;&#x4E3A;10&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x9664;&#x4E86;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4E4B;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x90FD;&#x4E3A;&#x96F6;&#x3002;&#x8FD9;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x7D22;&#x5F15;&#x5C31;&#x662F;&#x7C7B;&#x522B;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x5373;&#x76F8;&#x5E94;&#x56FE;&#x7247;&#x4E2D;&#x753B;&#x7684;&#x6570;&#x5B57;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x9700;&#x8981;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x96C6;&#x7C7B;&#x522B;&#x6570;&#x5B57;&#x7684;&#x6574;&#x578B;&#x503C;&#xFF0C;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x8BA1;&#x7B97;&#x3002;</p>
<pre><code class="lang-python">data.test.cls = np.argmax(data.test.labels, axis=<span class="hljs-number">1</span>)
</code></pre>
<h2 id="&#x6570;&#x636E;&#x7EF4;&#x5EA6;">&#x6570;&#x636E;&#x7EF4;&#x5EA6;</h2>
<p>&#x5728;&#x4E0B;&#x9762;&#x7684;&#x6E90;&#x7801;&#x4E2D;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x7528;&#x5230;&#x4E86;&#x6570;&#x636E;&#x7EF4;&#x5EA6;&#x3002;&#x5B83;&#x4EEC;&#x53EA;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x5B9A;&#x4E49;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x5199;&#x6570;&#x5B57;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-comment"># We know that MNIST images are 28 pixels in each dimension.</span>
img_size = <span class="hljs-number">28</span>

<span class="hljs-comment"># Images are stored in one-dimensional arrays of this length.</span>
img_size_flat = img_size * img_size

<span class="hljs-comment"># Tuple with height and width of images used to reshape arrays.</span>
img_shape = (img_size, img_size)

<span class="hljs-comment"># Number of colour channels for the images: 1 channel for gray-scale.</span>
num_channels = <span class="hljs-number">1</span>

<span class="hljs-comment"># Number of classes, one class for each of 10 digits.</span>
num_classes = <span class="hljs-number">10</span>
</code></pre>
<h3 id="&#x7528;&#x6765;&#x7ED8;&#x5236;&#x56FE;&#x7247;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;">&#x7528;&#x6765;&#x7ED8;&#x5236;&#x56FE;&#x7247;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;</h3>
<p>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7528;&#x6765;&#x5728;3x3&#x7684;&#x6805;&#x683C;&#x4E2D;&#x753B;9&#x5F20;&#x56FE;&#x50CF;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6BCF;&#x5F20;&#x56FE;&#x50CF;&#x4E0B;&#x9762;&#x5199;&#x51FA;&#x771F;&#x5B9E;&#x7C7B;&#x522B;&#x548C;&#x9884;&#x6D4B;&#x7C7B;&#x522B;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">plot_images</span><span class="hljs-params">(images, cls_true, cls_pred=None)</span>:</span>
    <span class="hljs-keyword">assert</span> len(images) == len(cls_true) == <span class="hljs-number">9</span>

    <span class="hljs-comment"># Create figure with 3x3 sub-plots.</span>
    fig, axes = plt.subplots(<span class="hljs-number">3</span>, <span class="hljs-number">3</span>)
    fig.subplots_adjust(hspace=<span class="hljs-number">0.3</span>, wspace=<span class="hljs-number">0.3</span>)

    <span class="hljs-keyword">for</span> i, ax <span class="hljs-keyword">in</span> enumerate(axes.flat):
        <span class="hljs-comment"># Plot image.</span>
        ax.imshow(images[i].reshape(img_shape), cmap=<span class="hljs-string">&apos;binary&apos;</span>)

        <span class="hljs-comment"># Show true and predicted classes.</span>
        <span class="hljs-keyword">if</span> cls_pred <span class="hljs-keyword">is</span> <span class="hljs-keyword">None</span>:
            xlabel = <span class="hljs-string">&quot;True: {0}&quot;</span>.format(cls_true[i])
        <span class="hljs-keyword">else</span>:
            xlabel = <span class="hljs-string">&quot;True: {0}, Pred: {1}&quot;</span>.format(cls_true[i], cls_pred[i])

        <span class="hljs-comment"># Show the classes as the label on the x-axis.</span>
        ax.set_xlabel(xlabel)

        <span class="hljs-comment"># Remove ticks from the plot.</span>
        ax.set_xticks([])
        ax.set_yticks([])

    <span class="hljs-comment"># Ensure the plot is shown correctly with multiple plots</span>
    <span class="hljs-comment"># in a single Notebook cell.</span>
    plt.show()
</code></pre>
<h3 id="&#x7ED8;&#x5236;&#x51E0;&#x5F20;&#x56FE;&#x50CF;&#x6765;&#x770B;&#x770B;&#x6570;&#x636E;&#x662F;&#x5426;&#x6B63;&#x786E;">&#x7ED8;&#x5236;&#x51E0;&#x5F20;&#x56FE;&#x50CF;&#x6765;&#x770B;&#x770B;&#x6570;&#x636E;&#x662F;&#x5426;&#x6B63;&#x786E;</h3>
<pre><code class="lang-python"><span class="hljs-comment"># Get the first images from the test-set.</span>
images = data.test.images[<span class="hljs-number">0</span>:<span class="hljs-number">9</span>]

<span class="hljs-comment"># Get the true classes for those images.</span>
cls_true = data.test.cls[<span class="hljs-number">0</span>:<span class="hljs-number">9</span>]

<span class="hljs-comment"># Plot the images and labels using our helper-function above.</span>
plot_images(images=images, cls_true=cls_true)
</code></pre>
<p><img src="output_30_0.png" alt="png"></p>
<h2 id="tensorflow&#x56FE;">TensorFlow&#x56FE;</h2>
<p>TensorFlow&#x7684;&#x5168;&#x90E8;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x79F0;&#x4E4B;&#x4E3A;&#x8BA1;&#x7B97;&#x56FE;&#xFF08;computational graph&#xFF09;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5B83;&#x4F1A;&#x6BD4;&#x76F4;&#x63A5;&#x5728;Python&#x4E2D;&#x8FDB;&#x884C;&#x76F8;&#x540C;&#x8BA1;&#x7B97;&#x91CF;&#x8981;&#x9AD8;&#x6548;&#x5F97;&#x591A;&#x3002;TensorFlow&#x6BD4;Numpy&#x66F4;&#x9AD8;&#x6548;&#xFF0C;&#x56E0;&#x4E3A;TensorFlow&#x4E86;&#x89E3;&#x6574;&#x4E2A;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x7684;&#x8BA1;&#x7B97;&#x56FE;&#xFF0C;&#x7136;&#x800C;Numpy&#x53EA;&#x77E5;&#x9053;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x4E0A;&#x552F;&#x4E00;&#x7684;&#x6570;&#x5B66;&#x8FD0;&#x7B97;&#x3002;</p>
<p>TensorFlow&#x4E5F;&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x5730;&#x8BA1;&#x7B97;&#x9700;&#x8981;&#x4F18;&#x5316;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x68AF;&#x5EA6;&#xFF0C;&#x4F7F;&#x5F97;&#x6A21;&#x578B;&#x6709;&#x66F4;&#x597D;&#x7684;&#x8868;&#x73B0;&#x3002;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x56FE;&#x662F;&#x7B80;&#x5355;&#x6570;&#x5B66;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7ED3;&#x5408;&#xFF0C;&#x56E0;&#x6B64;&#x6574;&#x4E2A;&#x56FE;&#x7684;&#x68AF;&#x5EA6;&#x53EF;&#x4EE5;&#x7528;&#x94FE;&#x5F0F;&#x6CD5;&#x5219;&#x63A8;&#x5BFC;&#x51FA;&#x6765;&#x3002;</p>
<p>TensorFlow&#x8FD8;&#x80FD;&#x5229;&#x7528;&#x591A;&#x6838;CPU&#x548C;GPU&#xFF0C;Google&#x4E5F;&#x4E3A;TensorFlow&#x5236;&#x9020;&#x4E86;&#x79F0;&#x4E3A;TPUs&#xFF08;Tensor Processing Units&#xFF09;&#x7684;&#x7279;&#x6B8A;&#x82AF;&#x7247;&#xFF0C;&#x5B83;&#x6BD4;GPU&#x66F4;&#x5FEB;&#x3002;</p>
<p>&#x4E00;&#x4E2A;TensorFlow&#x56FE;&#x7531;&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF0C;&#x540E;&#x9762;&#x4F1A;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#xFF1A;</p>
<ul>
<li>&#x5360;&#x4F4D;&#x7B26;&#x53D8;&#x91CF;&#xFF08;Placeholder&#xFF09;&#x7528;&#x6765;&#x6539;&#x53D8;&#x56FE;&#x7684;&#x8F93;&#x5165;&#x3002;</li>
<li>&#x6A21;&#x578B;&#x53D8;&#x91CF;&#xFF08;Model&#xFF09;&#x5C06;&#x4F1A;&#x88AB;&#x4F18;&#x5316;&#xFF0C;&#x4F7F;&#x5F97;&#x6A21;&#x578B;&#x8868;&#x73B0;&#x5F97;&#x66F4;&#x597D;&#x3002;</li>
<li>&#x6A21;&#x578B;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x6570;&#x5B66;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x6839;&#x636E;Placeholder&#x548C;&#x6A21;&#x578B;&#x7684;&#x8F93;&#x5165;&#x53D8;&#x91CF;&#x6765;&#x8BA1;&#x7B97;&#x4E00;&#x4E9B;&#x8F93;&#x51FA;&#x3002;</li>
<li>&#x4E00;&#x4E2A;cost&#x5EA6;&#x91CF;&#x7528;&#x6765;&#x6307;&#x5BFC;&#x53D8;&#x91CF;&#x7684;&#x4F18;&#x5316;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x4F1A;&#x66F4;&#x65B0;&#x6A21;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x3002;</li>
</ul>
<p>&#x53E6;&#x5916;&#xFF0C;TensorFlow&#x56FE;&#x4E5F;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E9B;&#x8C03;&#x8BD5;&#x72B6;&#x6001;&#xFF0C;&#x6BD4;&#x5982;&#x7528;TensorBoard&#x6253;&#x5370;log&#x6570;&#x636E;&#xFF0C;&#x672C;&#x6559;&#x7A0B;&#x4E0D;&#x6D89;&#x53CA;&#x8FD9;&#x4E9B;&#x3002;</p>
<h3 id="helper-functions-for-creating-new-variables">Helper-functions for creating new variables</h3>
<h3 id="&#x521B;&#x5EFA;&#x65B0;&#x53D8;&#x91CF;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;">&#x521B;&#x5EFA;&#x65B0;&#x53D8;&#x91CF;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;</h3>
<p>&#x51FD;&#x6570;&#x7528;&#x6765;&#x6839;&#x636E;&#x7ED9;&#x5B9A;&#x5927;&#x5C0F;&#x521B;&#x5EFA;TensorFlow&#x53D8;&#x91CF;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x7528;&#x968F;&#x673A;&#x503C;&#x521D;&#x59CB;&#x5316;&#x3002;&#x9700;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x5728;&#x6B64;&#x65F6;&#x5E76;&#x672A;&#x5B8C;&#x6210;&#x521D;&#x59CB;&#x5316;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x5728;TensorFlow&#x56FE;&#x91CC;&#x5B9A;&#x4E49;&#x5B83;&#x4EEC;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">new_weights</span><span class="hljs-params">(shape)</span>:</span>
    <span class="hljs-keyword">return</span> tf.Variable(tf.truncated_normal(shape, stddev=<span class="hljs-number">0.05</span>))
</code></pre>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">new_biases</span><span class="hljs-params">(length)</span>:</span>
    <span class="hljs-keyword">return</span> tf.Variable(tf.constant(<span class="hljs-number">0.05</span>, shape=[length]))
</code></pre>
<h3 id="&#x521B;&#x5EFA;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;">&#x521B;&#x5EFA;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;</h3>
<p>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4E3A;TensorFlow&#x5728;&#x8BA1;&#x7B97;&#x56FE;&#x91CC;&#x521B;&#x5EFA;&#x4E86;&#x65B0;&#x7684;&#x5377;&#x79EF;&#x5C42;&#x3002;&#x8FD9;&#x91CC;&#x5E76;&#x6CA1;&#x6709;&#x6267;&#x884C;&#x4EC0;&#x4E48;&#x8BA1;&#x7B97;&#xFF0C;&#x53EA;&#x662F;&#x5728;TensorFlow&#x56FE;&#x91CC;&#x6DFB;&#x52A0;&#x4E86;&#x6570;&#x5B66;&#x516C;&#x5F0F;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x8F93;&#x5165;&#x7684;&#x662F;&#x56DB;&#x7EF4;&#x7684;&#x5F20;&#x91CF;&#xFF0C;&#x5404;&#x4E2A;&#x7EF4;&#x5EA6;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x56FE;&#x50CF;&#x6570;&#x91CF;</li>
<li>&#x6BCF;&#x5F20;&#x56FE;&#x50CF;&#x7684;Y&#x8F74;</li>
<li>&#x6BCF;&#x5F20;&#x56FE;&#x50CF;&#x7684;X&#x8F74;</li>
<li>&#x6BCF;&#x5F20;&#x56FE;&#x50CF;&#x7684;&#x901A;&#x9053;&#x6570;</li>
</ol>
<p>&#x8F93;&#x5165;&#x901A;&#x9053;&#x53EF;&#x80FD;&#x662F;&#x5F69;&#x8272;&#x901A;&#x9053;&#xFF0C;&#x5F53;&#x8F93;&#x5165;&#x662F;&#x524D;&#x9762;&#x7684;&#x5377;&#x79EF;&#x5C42;&#x751F;&#x6210;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x6EE4;&#x6CE2;&#x901A;&#x9053;&#x3002;</p>
<p>&#x8F93;&#x51FA;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x4E2A;4&#x901A;&#x9053;&#x7684;&#x5F20;&#x91CF;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x56FE;&#x50CF;&#x6570;&#x91CF;&#xFF0C;&#x4E0E;&#x8F93;&#x5165;&#x76F8;&#x540C;</li>
<li>&#x6BCF;&#x5F20;&#x56FE;&#x50CF;&#x7684;Y&#x8F74;&#x3002;&#x5982;&#x679C;&#x7528;&#x5230;&#x4E86;2x2&#x7684;&#x6C60;&#x5316;&#xFF0C;&#x662F;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x5BBD;&#x9AD8;&#x7684;&#x4E00;&#x534A;&#x3002;</li>
<li>&#x6BCF;&#x5F20;&#x56FE;&#x50CF;&#x7684;X&#x8F74;&#x3002;&#x540C;&#x4E0A;&#x3002;</li>
<li>&#x5377;&#x79EF;&#x6EE4;&#x6CE2;&#x751F;&#x6210;&#x7684;&#x901A;&#x9053;&#x6570;&#x3002;</li>
</ol>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">new_conv_layer</span><span class="hljs-params">(input,              # The previous layer.
                   num_input_channels, # Num. channels in prev. layer.
                   filter_size,        # Width and height of each filter.
                   num_filters,        # Number of filters.
                   use_pooling=True)</span>:</span>  <span class="hljs-comment"># Use 2x2 max-pooling.</span>

    <span class="hljs-comment"># Shape of the filter-weights for the convolution.</span>
    <span class="hljs-comment"># This format is determined by the TensorFlow API.</span>
    shape = [filter_size, filter_size, num_input_channels, num_filters]

    <span class="hljs-comment"># Create new weights aka. filters with the given shape.</span>
    weights = new_weights(shape=shape)

    <span class="hljs-comment"># Create new biases, one for each filter.</span>
    biases = new_biases(length=num_filters)

    <span class="hljs-comment"># Create the TensorFlow operation for convolution.</span>
    <span class="hljs-comment"># Note the strides are set to 1 in all dimensions.</span>
    <span class="hljs-comment"># The first and last stride must always be 1,</span>
    <span class="hljs-comment"># because the first is for the image-number and</span>
    <span class="hljs-comment"># the last is for the input-channel.</span>
    <span class="hljs-comment"># But e.g. strides=[1, 2, 2, 1] would mean that the filter</span>
    <span class="hljs-comment"># is moved 2 pixels across the x- and y-axis of the image.</span>
    <span class="hljs-comment"># The padding is set to &apos;SAME&apos; which means the input image</span>
    <span class="hljs-comment"># is padded with zeroes so the size of the output is the same.</span>
    layer = tf.nn.conv2d(input=input,
                         filter=weights,
                         strides=[<span class="hljs-number">1</span>, <span class="hljs-number">1</span>, <span class="hljs-number">1</span>, <span class="hljs-number">1</span>],
                         padding=<span class="hljs-string">&apos;SAME&apos;</span>)

    <span class="hljs-comment"># Add the biases to the results of the convolution.</span>
    <span class="hljs-comment"># A bias-value is added to each filter-channel.</span>
    layer += biases

    <span class="hljs-comment"># Use pooling to down-sample the image resolution?</span>
    <span class="hljs-keyword">if</span> use_pooling:
        <span class="hljs-comment"># This is 2x2 max-pooling, which means that we</span>
        <span class="hljs-comment"># consider 2x2 windows and select the largest value</span>
        <span class="hljs-comment"># in each window. Then we move 2 pixels to the next window.</span>
        layer = tf.nn.max_pool(value=layer,
                               ksize=[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">2</span>, <span class="hljs-number">1</span>],
                               strides=[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">2</span>, <span class="hljs-number">1</span>],
                               padding=<span class="hljs-string">&apos;SAME&apos;</span>)

    <span class="hljs-comment"># Rectified Linear Unit (ReLU).</span>
    <span class="hljs-comment"># It calculates max(x, 0) for each input pixel x.</span>
    <span class="hljs-comment"># This adds some non-linearity to the formula and allows us</span>
    <span class="hljs-comment"># to learn more complicated functions.</span>
    layer = tf.nn.relu(layer)

    <span class="hljs-comment"># Note that ReLU is normally executed before the pooling,</span>
    <span class="hljs-comment"># but since relu(max_pool(x)) == max_pool(relu(x)) we can</span>
    <span class="hljs-comment"># save 75% of the relu-operations by max-pooling first.</span>

    <span class="hljs-comment"># We return both the resulting layer and the filter-weights</span>
    <span class="hljs-comment"># because we will plot the weights later.</span>
    <span class="hljs-keyword">return</span> layer, weights
</code></pre>
<h3 id="&#x8F6C;&#x6362;&#x4E00;&#x4E2A;&#x5C42;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;">&#x8F6C;&#x6362;&#x4E00;&#x4E2A;&#x5C42;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;</h3>
<p>&#x5377;&#x79EF;&#x5C42;&#x751F;&#x6210;&#x4E86;4&#x7EF4;&#x7684;&#x5F20;&#x91CF;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x5377;&#x79EF;&#x5C42;&#x4E4B;&#x540E;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x8FD9;&#x4E2A;4&#x7EF4;&#x7684;&#x5F20;&#x91CF;&#x8F6C;&#x6362;&#x6210;&#x53EF;&#x88AB;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x4F7F;&#x7528;&#x7684;2&#x7EF4;&#x5F20;&#x91CF;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">flatten_layer</span><span class="hljs-params">(layer)</span>:</span>
    <span class="hljs-comment"># Get the shape of the input layer.</span>
    layer_shape = layer.get_shape()

    <span class="hljs-comment"># The shape of the input layer is assumed to be:</span>
    <span class="hljs-comment"># layer_shape == [num_images, img_height, img_width, num_channels]</span>

    <span class="hljs-comment"># The number of features is: img_height * img_width * num_channels</span>
    <span class="hljs-comment"># We can use a function from TensorFlow to calculate this.</span>
    num_features = layer_shape[<span class="hljs-number">1</span>:<span class="hljs-number">4</span>].num_elements()

    <span class="hljs-comment"># Reshape the layer to [num_images, num_features].</span>
    <span class="hljs-comment"># Note that we just set the size of the second dimension</span>
    <span class="hljs-comment"># to num_features and the size of the first dimension to -1</span>
    <span class="hljs-comment"># which means the size in that dimension is calculated</span>
    <span class="hljs-comment"># so the total size of the tensor is unchanged from the reshaping.</span>
    layer_flat = tf.reshape(layer, [<span class="hljs-number">-1</span>, num_features])

    <span class="hljs-comment"># The shape of the flattened layer is now:</span>
    <span class="hljs-comment"># [num_images, img_height * img_width * num_channels]</span>

    <span class="hljs-comment"># Return both the flattened layer and the number of features.</span>
    <span class="hljs-keyword">return</span> layer_flat, num_features
</code></pre>
<h3 id="&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;">&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;</h3>
<p>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4E3A;TensorFlow&#x5728;&#x8BA1;&#x7B97;&#x56FE;&#x4E2D;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;&#x8FD9;&#x91CC;&#x4E5F;&#x4E0D;&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x8BA1;&#x7B97;&#xFF0C;&#x53EA;&#x662F;&#x5F80;TensorFlow&#x56FE;&#x4E2D;&#x6DFB;&#x52A0;&#x6570;&#x5B66;&#x516C;&#x5F0F;&#x3002;</p>
<p>&#x8F93;&#x5165;&#x662F;&#x5927;&#x5C0F;&#x4E3A;<code>[num_images, num_inputs]</code>&#x7684;&#x4E8C;&#x7EF4;&#x5F20;&#x91CF;&#x3002;&#x8F93;&#x51FA;&#x662F;&#x5927;&#x5C0F;&#x4E3A;<code>[num_images, num_outputs]</code>&#x7684;2&#x7EF4;&#x5F20;&#x91CF;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">new_fc_layer</span><span class="hljs-params">(input,          # The previous layer.
                 num_inputs,     # Num. inputs from prev. layer.
                 num_outputs,    # Num. outputs.
                 use_relu=True)</span>:</span> <span class="hljs-comment"># Use Rectified Linear Unit (ReLU)?</span>

    <span class="hljs-comment"># Create new weights and biases.</span>
    weights = new_weights(shape=[num_inputs, num_outputs])
    biases = new_biases(length=num_outputs)

    <span class="hljs-comment"># Calculate the layer as the matrix multiplication of</span>
    <span class="hljs-comment"># the input and weights, and then add the bias-values.</span>
    layer = tf.matmul(input, weights) + biases

    <span class="hljs-comment"># Use ReLU?</span>
    <span class="hljs-keyword">if</span> use_relu:
        layer = tf.nn.relu(layer)

    <span class="hljs-keyword">return</span> layer
</code></pre>
<h3 id="&#x5360;&#x4F4D;&#x7B26;-&#xFF08;placeholder&#xFF09;&#x53D8;&#x91CF;">&#x5360;&#x4F4D;&#x7B26; &#xFF08;Placeholder&#xFF09;&#x53D8;&#x91CF;</h3>
<p>Placeholder&#x662F;&#x4F5C;&#x4E3A;&#x56FE;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x6BCF;&#x6B21;&#x6211;&#x4EEC;&#x8FD0;&#x884C;&#x56FE;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x6539;&#x53D8;&#x5B83;&#x4EEC;&#x3002;&#x5C06;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;feeding placeholder&#x53D8;&#x91CF;&#xFF0C;&#x540E;&#x9762;&#x5C06;&#x4F1A;&#x63CF;&#x8FF0;&#x5B83;&#x3002;</p>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x4E3A;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x5B9A;&#x4E49;placeholder&#x53D8;&#x91CF;&#x3002;&#x8FD9;&#x8BA9;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x8F93;&#x5165;&#x5230;TensorFlow&#x56FE;&#x4E2D;&#x7684;&#x56FE;&#x50CF;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5F20;&#x91CF;&#xFF08;tensor&#xFF09;&#xFF0C;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x591A;&#x7EF4;&#x5411;&#x91CF;&#x6216;&#x77E9;&#x9635;&#x3002;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8BBE;&#x7F6E;&#x4E3A;float32&#xFF0C;&#x5F62;&#x72B6;&#x8BBE;&#x4E3A;<code>[None, img_size_flat]</code>&#xFF0C;<code>None</code>&#x4EE3;&#x8868;tensor&#x53EF;&#x80FD;&#x4FDD;&#x5B58;&#x7740;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x6BCF;&#x5F20;&#x56FE;&#x8C61;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;<code>img_size_flat</code>&#x7684;&#x5411;&#x91CF;&#x3002;</p>
<pre><code class="lang-python">x = tf.placeholder(tf.float32, shape=[<span class="hljs-keyword">None</span>, img_size_flat], name=<span class="hljs-string">&apos;x&apos;</span>)
</code></pre>
<p>&#x5377;&#x79EF;&#x5C42;&#x5E0C;&#x671B;<code>x</code>&#x88AB;&#x7F16;&#x7801;&#x4E3A;4&#x7EF4;&#x5F20;&#x91CF;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x5B83;&#x7684;&#x5F62;&#x72B6;&#x8F6C;&#x6362;&#x81F3;<code>[num_images, img_height, img_width, num_channels]</code>&#x3002;&#x6CE8;&#x610F;<code>img_height == img_width == img_size</code>&#xFF0C;&#x5982;&#x679C;&#x7B2C;&#x4E00;&#x7EF4;&#x7684;&#x5927;&#x5C0F;&#x8BBE;&#x4E3A;-1&#xFF0C; <code>num_images</code>&#x7684;&#x5927;&#x5C0F;&#x4E5F;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x63A8;&#x5BFC;&#x51FA;&#x6765;&#x3002;&#x8F6C;&#x6362;&#x8FD0;&#x7B97;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-python">x_image = tf.reshape(x, [<span class="hljs-number">-1</span>, img_size, img_size, num_channels])
</code></pre>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x4E3A;&#x8F93;&#x5165;&#x53D8;&#x91CF;<code>x</code>&#x4E2D;&#x7684;&#x56FE;&#x50CF;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x771F;&#x5B9E;&#x6807;&#x7B7E;&#x5B9A;&#x4E49;placeholder&#x53D8;&#x91CF;&#x3002;&#x53D8;&#x91CF;&#x7684;&#x5F62;&#x72B6;&#x662F;<code>[None, num_classes]</code>&#xFF0C;&#x8FD9;&#x4EE3;&#x8868;&#x7740;&#x5B83;&#x4FDD;&#x5B58;&#x4E86;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x6BCF;&#x4E2A;&#x6807;&#x7B7E;&#x662F;&#x957F;&#x5EA6;&#x4E3A;<code>num_classes</code>&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x672C;&#x4F8B;&#x4E2D;&#x957F;&#x5EA6;&#x4E3A;10&#x3002;</p>
<pre><code class="lang-python">y_true = tf.placeholder(tf.float32, shape=[<span class="hljs-keyword">None</span>, <span class="hljs-number">10</span>], name=<span class="hljs-string">&apos;y_true&apos;</span>)
</code></pre>
<p>&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4E3A;class-number&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;placeholder&#xFF0C;&#x4F46;&#x8FD9;&#x91CC;&#x7528;argmax&#x6765;&#x8BA1;&#x7B97;&#x5B83;&#x3002;&#x8FD9;&#x91CC;&#x53EA;&#x662F;TensorFlow&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#xFF0C;&#x6CA1;&#x6709;&#x6267;&#x884C;&#x4EC0;&#x4E48;&#x8FD0;&#x7B97;&#x3002;</p>
<pre><code class="lang-python">y_true_cls = tf.argmax(y_true, dimension=<span class="hljs-number">1</span>)
</code></pre>
<h3 id="&#x5377;&#x79EF;&#x5C42;-1">&#x5377;&#x79EF;&#x5C42; 1</h3>
<p>&#x521B;&#x5EFA;&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x3002;&#x5C06;<code>x_image</code>&#x5F53;&#x4F5C;&#x8F93;&#x5165;&#xFF0C;&#x521B;&#x5EFA;<code>num_filters1</code>&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6EE4;&#x6CE2;&#x5668;&#xFF0C;&#x6BCF;&#x4E2A;&#x6EE4;&#x6CE2;&#x5668;&#x7684;&#x5BBD;&#x9AD8;&#x90FD;&#x4E0E; <code>filter_size1</code>&#x76F8;&#x7B49;&#x3002;&#x6700;&#x7EC8;&#x6211;&#x4EEC;&#x4F1A;&#x7528;2x2&#x7684;max-pooling&#x5C06;&#x56FE;&#x50CF;&#x964D;&#x91C7;&#x6837;&#xFF0C;&#x4F7F;&#x5B83;&#x7684;&#x5C3A;&#x5BF8;&#x51CF;&#x534A;&#x3002;</p>
<pre><code class="lang-python">layer_conv1, weights_conv1 = \
    new_conv_layer(input=x_image,
                   num_input_channels=num_channels,
                   filter_size=filter_size1,
                   num_filters=num_filters1,
                   use_pooling=<span class="hljs-keyword">True</span>)
</code></pre>
<p>&#x68C0;&#x67E5;&#x5377;&#x79EF;&#x5C42;&#x8F93;&#x51FA;&#x5F20;&#x91CF;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x5B83;&#x662F;&#xFF08;&#xFF1F;,14, 14, 16&#xFF09;&#xFF0C;&#x8FD9;&#x4EE3;&#x8868;&#x7740;&#x6709;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x56FE;&#x50CF;&#xFF08;&#xFF1F;&#x4EE3;&#x8868;&#x6570;&#x91CF;&#xFF09;&#xFF0C;&#x6BCF;&#x5F20;&#x56FE;&#x50CF;&#x6709;14&#x4E2A;&#x50CF;&#x7D20;&#x7684;&#x5BBD;&#x548C;&#x9AD8;&#xFF0C;&#x6709;16&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x901A;&#x9053;&#xFF0C;&#x6BCF;&#x4E2A;&#x6EE4;&#x6CE2;&#x5668;&#x5404;&#x6709;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x3002;</p>
<pre><code class="lang-python">layer_conv1
</code></pre>
<pre><code>&lt;tf.Tensor &apos;Relu:0&apos; shape=(?, 14, 14, 16) dtype=float32&gt;
</code></pre><h3 id="&#x5377;&#x79EF;&#x5C42;-2">&#x5377;&#x79EF;&#x5C42; 2</h3>
<p>&#x521B;&#x5EFA;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#xFF0C;&#x5B83;&#x5C06;&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x3002;&#x8F93;&#x5165;&#x901A;&#x9053;&#x7684;&#x6570;&#x91CF;&#x5BF9;&#x5E94;&#x7740;&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x6EE4;&#x6CE2;&#x6570;&#x3002;</p>
<pre><code class="lang-python">layer_conv2, weights_conv2 = \
    new_conv_layer(input=layer_conv1,
                   num_input_channels=num_filters1,
                   filter_size=filter_size2,
                   num_filters=num_filters2,
                   use_pooling=<span class="hljs-keyword">True</span>)
</code></pre>
<p>&#x6838;&#x5BF9;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x8F93;&#x51FA;&#x5F20;&#x91CF;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#x662F;&#xFF08;&#xFF1F;&#xFF0C; 7&#xFF0C; 7&#xFF0C; 36&#xFF09;,&#x5176;&#x4E2D;&#xFF1F;&#x4E5F;&#x4EE3;&#x8868;&#x7740;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x6BCF;&#x5F20;&#x56FE;&#x6709;7&#x50CF;&#x7D20;&#x7684;&#x5BBD;&#x9AD8;&#xFF0C;&#x6BCF;&#x4E2A;&#x6EE4;&#x6CE2;&#x5668;&#x6709;36&#x4E2A;&#x901A;&#x9053;&#x3002;</p>
<pre><code class="lang-python">layer_conv2
</code></pre>
<pre><code>&lt;tf.Tensor &apos;Relu_1:0&apos; shape=(?, 7, 7, 36) dtype=float32&gt;
</code></pre><h3 id="&#x8F6C;&#x6362;&#x5C42;">&#x8F6C;&#x6362;&#x5C42;</h3>
<p>&#x8FD9;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;4&#x7EF4;&#x5F20;&#x91CF;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x60F3;&#x5C06;&#x5B83;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x5C06;&#x5B83;&#x8F6C;&#x6362;&#x6210;2&#x7EF4;&#x5F20;&#x91CF;&#x3002;</p>
<pre><code class="lang-python">layer_flat, num_features = flatten_layer(layer_conv2)
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x5F20;&#x91CF;&#x7684;&#x5927;&#x5C0F;&#x662F;&#xFF08;&#xFF1F;&#xFF0C; 1764&#xFF09;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5171;&#x6709;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x6BCF;&#x5F20;&#x56FE;&#x50CF;&#x88AB;&#x8F6C;&#x6362;&#x6210;&#x957F;&#x4E3A;1764&#x7684;&#x5411;&#x91CF;&#x3002;&#x5176;&#x4E2D;1764 = 7 x 7 x 36&#x3002;</p>
<pre><code class="lang-python">layer_flat
</code></pre>
<pre><code>&lt;tf.Tensor &apos;Reshape_1:0&apos; shape=(?, 1764) dtype=float32&gt;
</code></pre><pre><code class="lang-python">num_features
</code></pre>
<pre><code>1764
</code></pre><h3 id="&#x5168;&#x8FDE;&#x63A5;&#x5C42;-1">&#x5168;&#x8FDE;&#x63A5;&#x5C42; 1</h3>
<p>&#x5F80;&#x7F51;&#x7EDC;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;&#x8F93;&#x5165;&#x662F;&#x4E00;&#x4E2A;&#x524D;&#x9762;&#x5377;&#x79EF;&#x5F97;&#x5230;&#x7684;&#x88AB;&#x8F6C;&#x6362;&#x8FC7;&#x7684;&#x5C42;&#x3002;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x4E2D;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x6216;&#x8282;&#x70B9;&#x6570;&#x4E3A;<code>fc_size</code>&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;ReLU&#x6765;&#x5B66;&#x4E60;&#x975E;&#x7EBF;&#x6027;&#x5173;&#x7CFB;&#x3002;</p>
<pre><code class="lang-python">layer_fc1 = new_fc_layer(input=layer_flat,
                         num_inputs=num_features,
                         num_outputs=fc_size,
                         use_relu=<span class="hljs-keyword">True</span>)
</code></pre>
<p>&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x5C0F;&#x4E3A;&#xFF08;&#xFF1F;&#xFF0C;128&#xFF09;&#x7684;&#x5F20;&#x91CF;&#xFF0C;&#xFF1F;&#x4EE3;&#x8868;&#x7740;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x56FE;&#x50CF;&#xFF0C;&#x5E76;&#x4E14;<code>fc_size</code> == 128&#x3002;</p>
<pre><code class="lang-python">layer_fc1
</code></pre>
<pre><code>&lt;tf.Tensor &apos;Relu_2:0&apos; shape=(?, 128) dtype=float32&gt;
</code></pre><h3 id="&#x5168;&#x8FDE;&#x63A5;&#x5C42;-2">&#x5168;&#x8FDE;&#x63A5;&#x5C42; 2</h3>
<p>&#x6DFB;&#x52A0;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#xFF0C;&#x5B83;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;10&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x5B83;&#x786E;&#x5B9A;&#x4E86;&#x8F93;&#x5165;&#x56FE;&#x662F;&#x5C5E;&#x4E8E;&#x54EA;&#x4E2A;&#x7C7B;&#x522B;&#x3002;&#x8FD9;&#x5C42;&#x5E76;&#x6CA1;&#x6709;&#x7528;&#x5230;ReLU&#x3002;</p>
<pre><code class="lang-python">layer_fc2 = new_fc_layer(input=layer_fc1,
                         num_inputs=fc_size,
                         num_outputs=num_classes,
                         use_relu=<span class="hljs-keyword">False</span>)
</code></pre>
<pre><code class="lang-python">layer_fc2
</code></pre>
<pre><code>&lt;tf.Tensor &apos;add_3:0&apos; shape=(?, 10) dtype=float32&gt;
</code></pre><h3 id="&#x9884;&#x6D4B;&#x7C7B;&#x522B;">&#x9884;&#x6D4B;&#x7C7B;&#x522B;</h3>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x4F30;&#x7B97;&#x4E86;&#x8F93;&#x5165;&#x56FE;&#x6709;&#x591A;&#x5927;&#x7684;&#x53EF;&#x80FD;&#x5C5E;&#x4E8E;10&#x4E2A;&#x7C7B;&#x522B;&#x4E2D;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x7C97;&#x7565;&#x7684;&#x4F30;&#x8BA1;&#x5E76;&#x4E14;&#x5F88;&#x96BE;&#x89E3;&#x91CA;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x503C;&#x53EF;&#x80FD;&#x5F88;&#x5C0F;&#x6216;&#x5F88;&#x5927;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4F1A;&#x5BF9;&#x5B83;&#x4EEC;&#x505A;&#x5F52;&#x4E00;&#x5316;&#xFF0C;&#x5C06;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x9650;&#x5236;&#x5728;0&#x5230;1&#x4E4B;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x76F8;&#x52A0;&#x4E3A;1&#x3002;&#x8FD9;&#x7528;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;softmax&#x7684;&#x51FD;&#x6570;&#x6765;&#x8BA1;&#x7B97;&#x7684;&#xFF0C;&#x7ED3;&#x679C;&#x4FDD;&#x5B58;&#x5728;<code>y_pred</code>&#x4E2D;&#x3002;</p>
<pre><code class="lang-python">y_pred = tf.nn.softmax(layer_fc2)
</code></pre>
<p>&#x7C7B;&#x522B;&#x6570;&#x5B57;&#x662F;&#x6700;&#x5927;&#x5143;&#x7D20;&#x7684;&#x7D22;&#x5F15;&#x3002;</p>
<pre><code class="lang-python">y_pred_cls = tf.argmax(y_pred, dimension=<span class="hljs-number">1</span>)
</code></pre>
<h3 id="&#x4F18;&#x5316;&#x635F;&#x5931;&#x51FD;&#x6570;">&#x4F18;&#x5316;&#x635F;&#x5931;&#x51FD;&#x6570;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x6A21;&#x578B;&#x66F4;&#x597D;&#x5730;&#x5BF9;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x6539;&#x53D8;<code>weights</code>&#x548C;<code>biases</code>&#x53D8;&#x91CF;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x6BD4;&#x6A21;&#x578B;<code>y_pred</code>&#x7684;&#x9884;&#x6D4B;&#x8F93;&#x51FA;&#x548C;&#x671F;&#x671B;&#x8F93;&#x51FA;&#x7684;<code>y_true</code>&#xFF0C;&#x6765;&#x4E86;&#x89E3;&#x76EE;&#x524D;&#x6A21;&#x578B;&#x7684;&#x6027;&#x80FD;&#x5982;&#x4F55;&#x3002;</p>
<p>&#x4EA4;&#x53C9;&#x71B5;&#xFF08;cross-entropy&#xFF09;&#x662F;&#x5728;&#x5206;&#x7C7B;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x6027;&#x80FD;&#x5EA6;&#x91CF;&#x3002;&#x4EA4;&#x53C9;&#x71B5;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x4E3A;&#x6B63;&#x503C;&#x7684;&#x8FDE;&#x7EED;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x6A21;&#x578B;&#x7684;&#x9884;&#x6D4B;&#x503C;&#x7CBE;&#x51C6;&#x5730;&#x7B26;&#x5408;&#x671F;&#x671B;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x5B83;&#x5C31;&#x7B49;&#x4E8E;&#x96F6;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F18;&#x5316;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x53D8;&#x91CF;&#x6765;&#x6700;&#x5C0F;&#x5316;&#x4EA4;&#x53C9;&#x71B5;&#x3002;</p>
<p>TensorFlow&#x6709;&#x4E00;&#x4E2A;&#x5185;&#x7F6E;&#x7684;&#x8BA1;&#x7B97;&#x4EA4;&#x53C9;&#x71B5;&#x7684;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x8BA1;&#x7B97;&#x4E86;softmax&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8981;&#x7528;<code>layer_fc2</code>&#x7684;&#x8F93;&#x51FA;&#x800C;&#x975E;&#x76F4;&#x63A5;&#x7528;<code>y_pred</code>,&#x56E0;&#x4E3A;<code>y_pred</code>&#x4E0A;&#x5DF2;&#x7ECF;&#x8BA1;&#x7B97;&#x4E86;softmax&#x3002;</p>
<pre><code class="lang-python">cross_entropy = tf.nn.softmax_cross_entropy_with_logits(logits=layer_fc2,
                                                        labels=y_true)
</code></pre>
<p>&#x6211;&#x4EEC;&#x4E3A;&#x6BCF;&#x4E2A;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x8BA1;&#x7B97;&#x4E86;&#x4EA4;&#x53C9;&#x71B5;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x4E00;&#x4E2A;&#x5F53;&#x524D;&#x6A21;&#x578B;&#x5728;&#x6BCF;&#x5F20;&#x56FE;&#x4E0A;&#x8868;&#x73B0;&#x7684;&#x5EA6;&#x91CF;&#x3002;&#x4F46;&#x662F;&#x4E3A;&#x4E86;&#x7528;&#x4EA4;&#x53C9;&#x71B5;&#x6765;&#x6307;&#x5BFC;&#x6A21;&#x578B;&#x53D8;&#x91CF;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x6807;&#x91CF;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x7B80;&#x5355;&#x5730;&#x5229;&#x7528;&#x6240;&#x6709;&#x56FE;&#x50CF;&#x5206;&#x7C7B;&#x4EA4;&#x53C9;&#x71B5;&#x7684;&#x5747;&#x503C;&#x3002;</p>
<pre><code class="lang-python">cost = tf.reduce_mean(cross_entropy)
</code></pre>
<h3 id="&#x4F18;&#x5316;&#x65B9;&#x6CD5;">&#x4F18;&#x5316;&#x65B9;&#x6CD5;</h3>
<p>&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x88AB;&#x6700;&#x5C0F;&#x5316;&#x7684;&#x635F;&#x5931;&#x5EA6;&#x91CF;&#xFF0C;&#x63A5;&#x7740;&#x5C31;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x4F18;&#x5316;&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x53D8;&#x4F53;<code>AdamOptimizer</code>&#x3002;</p>
<p>&#x4F18;&#x5316;&#x8FC7;&#x7A0B;&#x5E76;&#x4E0D;&#x662F;&#x5728;&#x8FD9;&#x91CC;&#x6267;&#x884C;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD8;&#x6CA1;&#x8BA1;&#x7B97;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x5F80;TensorFlow&#x56FE;&#x4E2D;&#x6DFB;&#x52A0;&#x4E86;&#x4F18;&#x5316;&#x5668;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E4B;&#x540E;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<pre><code class="lang-python">optimizer = tf.train.AdamOptimizer(learning_rate=<span class="hljs-number">1e-4</span>).minimize(cost)
</code></pre>
<h3 id="&#x6027;&#x80FD;&#x5EA6;&#x91CF;">&#x6027;&#x80FD;&#x5EA6;&#x91CF;</h3>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x6027;&#x80FD;&#x5EA6;&#x91CF;&#xFF0C;&#x6765;&#x5411;&#x7528;&#x6237;&#x5C55;&#x793A;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x503C;&#x5411;&#x91CF;&#xFF0C;&#x4EE3;&#x8868;&#x9884;&#x6D4B;&#x7C7B;&#x578B;&#x662F;&#x5426;&#x7B49;&#x4E8E;&#x6BCF;&#x5F20;&#x56FE;&#x7247;&#x7684;&#x771F;&#x5B9E;&#x7C7B;&#x578B;&#x3002;</p>
<pre><code class="lang-python">correct_prediction = tf.equal(y_pred_cls, y_true_cls)
</code></pre>
<p>&#x4E0A;&#x9762;&#x7684;&#x8BA1;&#x7B97;&#x5148;&#x5C06;&#x5E03;&#x5C14;&#x503C;&#x5411;&#x91CF;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x6210;&#x6D6E;&#x70B9;&#x578B;&#x5411;&#x91CF;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;False&#x5C31;&#x53D8;&#x6210;0&#xFF0C;True&#x53D8;&#x6210;1&#xFF0C;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x8FD9;&#x4E9B;&#x503C;&#x7684;&#x5E73;&#x5747;&#x6570;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x8BA1;&#x7B97;&#x5206;&#x7C7B;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x3002;</p>
<pre><code class="lang-python">accuracy = tf.reduce_mean(tf.cast(correct_prediction, tf.float32))
</code></pre>
<h2 id="&#x8FD0;&#x884C;tensorflow">&#x8FD0;&#x884C;TensorFlow</h2>
<h3 id="&#x521B;&#x5EFA;tensorflow&#x4F1A;&#x8BDD;&#xFF08;session&#xFF09;">&#x521B;&#x5EFA;TensorFlow&#x4F1A;&#x8BDD;&#xFF08;session&#xFF09;</h3>
<p>&#x4E00;&#x65E6;&#x521B;&#x5EFA;&#x4E86;TensorFlow&#x56FE;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;TensorFlow&#x4F1A;&#x8BDD;&#xFF0C;&#x7528;&#x6765;&#x8FD0;&#x884C;&#x56FE;&#x3002;</p>
<pre><code class="lang-python">session = tf.Session()
</code></pre>
<h3 id="&#x521D;&#x59CB;&#x5316;&#x53D8;&#x91CF;">&#x521D;&#x59CB;&#x5316;&#x53D8;&#x91CF;</h3>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x5F00;&#x59CB;&#x4F18;&#x5316;weights&#x548C;biases&#x53D8;&#x91CF;&#x4E4B;&#x524D;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x3002;</p>
<pre><code class="lang-python">session.run(tf.global_variables_initializer())
</code></pre>
<h3 id="&#x7528;&#x6765;&#x4F18;&#x5316;&#x8FED;&#x4EE3;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;">&#x7528;&#x6765;&#x4F18;&#x5316;&#x8FED;&#x4EE3;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;</h3>
<p>&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x6709;50,000&#x5F20;&#x56FE;&#x3002;&#x7528;&#x8FD9;&#x4E9B;&#x56FE;&#x50CF;&#x8BA1;&#x7B97;&#x6A21;&#x578B;&#x7684;&#x68AF;&#x5EA6;&#x4F1A;&#x82B1;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5229;&#x7528;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x5728;&#x4F18;&#x5316;&#x5668;&#x7684;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x91CC;&#x53EA;&#x7528;&#x5230;&#x4E86;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x7684;&#x56FE;&#x50CF;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5185;&#x5B58;&#x8017;&#x5C3D;&#x5BFC;&#x81F4;&#x7535;&#x8111;&#x6B7B;&#x673A;&#x6216;&#x53D8;&#x5F97;&#x5F88;&#x6162;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x8BD5;&#x7740;&#x51CF;&#x5C11;&#x8FD9;&#x4E9B;&#x6570;&#x91CF;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x53EF;&#x80FD;&#x8FD8;&#x9700;&#x8981;&#x66F4;&#x4F18;&#x5316;&#x7684;&#x8FED;&#x4EE3;&#x3002;</p>
<pre><code class="lang-python">train_batch_size = <span class="hljs-number">64</span>
</code></pre>
<p>&#x51FD;&#x6570;&#x6267;&#x884C;&#x4E86;&#x591A;&#x6B21;&#x7684;&#x4F18;&#x5316;&#x8FED;&#x4EE3;&#x6765;&#x9010;&#x6B65;&#x5730;&#x63D0;&#x5347;&#x7F51;&#x7EDC;&#x5C42;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x5728;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x4E2D;&#xFF0C;&#x4ECE;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x6279;&#x65B0;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;TensorFlow&#x7528;&#x8FD9;&#x4E9B;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x6765;&#x6267;&#x884C;&#x4F18;&#x5316;&#x5668;&#x3002;&#x6BCF;100&#x6B21;&#x8FED;&#x4EE3;&#x4F1A;&#x6253;&#x5370;&#x51FA;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-comment"># Counter for total number of iterations performed so far.</span>
total_iterations = <span class="hljs-number">0</span>

<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">optimize</span><span class="hljs-params">(num_iterations)</span>:</span>
    <span class="hljs-comment"># Ensure we update the global variable rather than a local copy.</span>
    <span class="hljs-keyword">global</span> total_iterations

    <span class="hljs-comment"># Start-time used for printing time-usage below.</span>
    start_time = time.time()

    <span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> range(total_iterations,
                   total_iterations + num_iterations):

        <span class="hljs-comment"># Get a batch of training examples.</span>
        <span class="hljs-comment"># x_batch now holds a batch of images and</span>
        <span class="hljs-comment"># y_true_batch are the true labels for those images.</span>
        x_batch, y_true_batch = data.train.next_batch(train_batch_size)

        <span class="hljs-comment"># Put the batch into a dict with the proper names</span>
        <span class="hljs-comment"># for placeholder variables in the TensorFlow graph.</span>
        feed_dict_train = {x: x_batch,
                           y_true: y_true_batch}

        <span class="hljs-comment"># Run the optimizer using this batch of training data.</span>
        <span class="hljs-comment"># TensorFlow assigns the variables in feed_dict_train</span>
        <span class="hljs-comment"># to the placeholder variables and then runs the optimizer.</span>
        session.run(optimizer, feed_dict=feed_dict_train)

        <span class="hljs-comment"># Print status every 100 iterations.</span>
        <span class="hljs-keyword">if</span> i % <span class="hljs-number">100</span> == <span class="hljs-number">0</span>:
            <span class="hljs-comment"># Calculate the accuracy on the training-set.</span>
            acc = session.run(accuracy, feed_dict=feed_dict_train)

            <span class="hljs-comment"># Message for printing.</span>
            msg = <span class="hljs-string">&quot;Optimization Iteration: {0:&gt;6}, Training Accuracy: {1:&gt;6.1%}&quot;</span>

            <span class="hljs-comment"># Print it.</span>
            print(msg.format(i + <span class="hljs-number">1</span>, acc))

    <span class="hljs-comment"># Update the total number of iterations performed.</span>
    total_iterations += num_iterations

    <span class="hljs-comment"># Ending time.</span>
    end_time = time.time()

    <span class="hljs-comment"># Difference between start and end-times.</span>
    time_dif = end_time - start_time

    <span class="hljs-comment"># Print the time-usage.</span>
    print(<span class="hljs-string">&quot;Time usage: &quot;</span> + str(timedelta(seconds=int(round(time_dif)))))
</code></pre>
<h3 id="&#x7528;&#x6765;&#x7ED8;&#x5236;&#x9519;&#x8BEF;&#x6837;&#x672C;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;">&#x7528;&#x6765;&#x7ED8;&#x5236;&#x9519;&#x8BEF;&#x6837;&#x672C;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;</h3>
<p>&#x51FD;&#x6570;&#x7528;&#x6765;&#x7ED8;&#x5236;&#x6D4B;&#x8BD5;&#x96C6;&#x4E2D;&#x88AB;&#x8BEF;&#x5206;&#x7C7B;&#x7684;&#x6837;&#x672C;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">plot_example_errors</span><span class="hljs-params">(cls_pred, correct)</span>:</span>
    <span class="hljs-comment"># This function is called from print_test_accuracy() below.</span>

    <span class="hljs-comment"># cls_pred is an array of the predicted class-number for</span>
    <span class="hljs-comment"># all images in the test-set.</span>

    <span class="hljs-comment"># correct is a boolean array whether the predicted class</span>
    <span class="hljs-comment"># is equal to the true class for each image in the test-set.</span>

    <span class="hljs-comment"># Negate the boolean array.</span>
    incorrect = (correct == <span class="hljs-keyword">False</span>)

    <span class="hljs-comment"># Get the images from the test-set that have been</span>
    <span class="hljs-comment"># incorrectly classified.</span>
    images = data.test.images[incorrect]

    <span class="hljs-comment"># Get the predicted classes for those images.</span>
    cls_pred = cls_pred[incorrect]

    <span class="hljs-comment"># Get the true classes for those images.</span>
    cls_true = data.test.cls[incorrect]

    <span class="hljs-comment"># Plot the first 9 images.</span>
    plot_images(images=images[<span class="hljs-number">0</span>:<span class="hljs-number">9</span>],
                cls_true=cls_true[<span class="hljs-number">0</span>:<span class="hljs-number">9</span>],
                cls_pred=cls_pred[<span class="hljs-number">0</span>:<span class="hljs-number">9</span>])
</code></pre>
<h3 id="&#x7ED8;&#x5236;&#x6DF7;&#x6DC6;&#xFF08;confusion&#xFF09;&#x77E9;&#x9635;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;">&#x7ED8;&#x5236;&#x6DF7;&#x6DC6;&#xFF08;confusion&#xFF09;&#x77E9;&#x9635;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;</h3>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">plot_confusion_matrix</span><span class="hljs-params">(cls_pred)</span>:</span>
    <span class="hljs-comment"># This is called from print_test_accuracy() below.</span>

    <span class="hljs-comment"># cls_pred is an array of the predicted class-number for</span>
    <span class="hljs-comment"># all images in the test-set.</span>

    <span class="hljs-comment"># Get the true classifications for the test-set.</span>
    cls_true = data.test.cls

    <span class="hljs-comment"># Get the confusion matrix using sklearn.</span>
    cm = confusion_matrix(y_true=cls_true,
                          y_pred=cls_pred)

    <span class="hljs-comment"># Print the confusion matrix as text.</span>
    print(cm)

    <span class="hljs-comment"># Plot the confusion matrix as an image.</span>
    plt.matshow(cm)

    <span class="hljs-comment"># Make various adjustments to the plot.</span>
    plt.colorbar()
    tick_marks = np.arange(num_classes)
    plt.xticks(tick_marks, range(num_classes))
    plt.yticks(tick_marks, range(num_classes))
    plt.xlabel(<span class="hljs-string">&apos;Predicted&apos;</span>)
    plt.ylabel(<span class="hljs-string">&apos;True&apos;</span>)

    <span class="hljs-comment"># Ensure the plot is shown correctly with multiple plots</span>
    <span class="hljs-comment"># in a single Notebook cell.</span>
    plt.show()
</code></pre>
<h3 id="&#x5C55;&#x793A;&#x6027;&#x80FD;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;">&#x5C55;&#x793A;&#x6027;&#x80FD;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;</h3>
<p>&#x51FD;&#x6570;&#x7528;&#x6765;&#x6253;&#x5370;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x7684;&#x5206;&#x7C7B;&#x51C6;&#x786E;&#x5EA6;&#x3002;</p>
<p>&#x4E3A;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x56FE;&#x7247;&#x8BA1;&#x7B97;&#x5206;&#x7C7B;&#x4F1A;&#x82B1;&#x8D39;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x7528;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x6765;&#x8C03;&#x7528;&#x4E0A;&#x9762;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x7528;&#x6BCF;&#x6B21;&#x90FD;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x53EF;&#x80FD;&#x4F1A;&#x5360;&#x7528;&#x5F88;&#x591A;&#x7535;&#x8111;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5C06;&#x6D4B;&#x8BD5;&#x96C6;&#x5206;&#x6210;&#x66F4;&#x5C0F;&#x7684;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7535;&#x8111;&#x5185;&#x5B58;&#x6BD4;&#x8F83;&#x5C0F;&#x6216;&#x6B7B;&#x673A;&#x4E86;&#xFF0C;&#x5C31;&#x8981;&#x8BD5;&#x7740;&#x964D;&#x4F4E;batch-size&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-comment"># Split the test-set into smaller batches of this size.</span>
test_batch_size = <span class="hljs-number">256</span>

<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">print_test_accuracy</span><span class="hljs-params">(show_example_errors=False,
                        show_confusion_matrix=False)</span>:</span>

    <span class="hljs-comment"># Number of images in the test-set.</span>
    num_test = len(data.test.images)

    <span class="hljs-comment"># Allocate an array for the predicted classes which</span>
    <span class="hljs-comment"># will be calculated in batches and filled into this array.</span>
    cls_pred = np.zeros(shape=num_test, dtype=np.int)

    <span class="hljs-comment"># Now calculate the predicted classes for the batches.</span>
    <span class="hljs-comment"># We will just iterate through all the batches.</span>
    <span class="hljs-comment"># There might be a more clever and Pythonic way of doing this.</span>

    <span class="hljs-comment"># The starting index for the next batch is denoted i.</span>
    i = <span class="hljs-number">0</span>

    <span class="hljs-keyword">while</span> i &lt; num_test:
        <span class="hljs-comment"># The ending index for the next batch is denoted j.</span>
        j = min(i + test_batch_size, num_test)

        <span class="hljs-comment"># Get the images from the test-set between index i and j.</span>
        images = data.test.images[i:j, :]

        <span class="hljs-comment"># Get the associated labels.</span>
        labels = data.test.labels[i:j, :]

        <span class="hljs-comment"># Create a feed-dict with these images and labels.</span>
        feed_dict = {x: images,
                     y_true: labels}

        <span class="hljs-comment"># Calculate the predicted class using TensorFlow.</span>
        cls_pred[i:j] = session.run(y_pred_cls, feed_dict=feed_dict)

        <span class="hljs-comment"># Set the start-index for the next batch to the</span>
        <span class="hljs-comment"># end-index of the current batch.</span>
        i = j

    <span class="hljs-comment"># Convenience variable for the true class-numbers of the test-set.</span>
    cls_true = data.test.cls

    <span class="hljs-comment"># Create a boolean array whether each image is correctly classified.</span>
    correct = (cls_true == cls_pred)

    <span class="hljs-comment"># Calculate the number of correctly classified images.</span>
    <span class="hljs-comment"># When summing a boolean array, False means 0 and True means 1.</span>
    correct_sum = correct.sum()

    <span class="hljs-comment"># Classification accuracy is the number of correctly classified</span>
    <span class="hljs-comment"># images divided by the total number of images in the test-set.</span>
    acc = float(correct_sum) / num_test

    <span class="hljs-comment"># Print the accuracy.</span>
    msg = <span class="hljs-string">&quot;Accuracy on Test-Set: {0:.1%} ({1} / {2})&quot;</span>
    print(msg.format(acc, correct_sum, num_test))

    <span class="hljs-comment"># Plot some examples of mis-classifications, if desired.</span>
    <span class="hljs-keyword">if</span> show_example_errors:
        print(<span class="hljs-string">&quot;Example errors:&quot;</span>)
        plot_example_errors(cls_pred=cls_pred, correct=correct)

    <span class="hljs-comment"># Plot the confusion matrix, if desired.</span>
    <span class="hljs-keyword">if</span> show_confusion_matrix:
        print(<span class="hljs-string">&quot;Confusion Matrix:&quot;</span>)
        plot_confusion_matrix(cls_pred=cls_pred)
</code></pre>
<h2 id="&#x4F18;&#x5316;&#x4E4B;&#x524D;&#x7684;&#x6027;&#x80FD;">&#x4F18;&#x5316;&#x4E4B;&#x524D;&#x7684;&#x6027;&#x80FD;</h2>
<p>&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x5F88;&#x4F4E;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x6A21;&#x578B;&#x53EA;&#x505A;&#x4E86;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5E76;&#x6CA1;&#x505A;&#x4EFB;&#x4F55;&#x4F18;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EA;&#x662F;&#x5BF9;&#x56FE;&#x50CF;&#x505A;&#x968F;&#x673A;&#x5206;&#x7C7B;&#x3002;</p>
<pre><code class="lang-python">print_test_accuracy()
</code></pre>
<pre><code>Accuracy on Test-Set: 10.9% (1093 / 10000)
</code></pre><h2 id="1&#x6B21;&#x8FED;&#x4EE3;&#x540E;&#x7684;&#x6027;&#x80FD;">1&#x6B21;&#x8FED;&#x4EE3;&#x540E;&#x7684;&#x6027;&#x80FD;</h2>
<p>&#x505A;&#x4E86;&#x4E00;&#x6B21;&#x4F18;&#x5316;&#x540E;&#xFF0C;&#x6B64;&#x65F6;&#x4F18;&#x5316;&#x5668;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x5F88;&#x4F4E;&#xFF0C;&#x6027;&#x80FD;&#x5176;&#x5B9E;&#x5E76;&#x6CA1;&#x6709;&#x591A;&#x5927;&#x63D0;&#x5347;&#x3002;</p>
<pre><code class="lang-python">optimize(num_iterations=<span class="hljs-number">1</span>)
</code></pre>
<pre><code>Optimization Iteration:      1, Training Accuracy:   6.2%
Time usage: 0:00:00
</code></pre><pre><code class="lang-python">print_test_accuracy()
</code></pre>
<pre><code>Accuracy on Test-Set: 13.0% (1296 / 10000)
</code></pre><h2 id="100&#x6B21;&#x8FED;&#x4EE3;&#x4F18;&#x5316;&#x540E;&#x7684;&#x6027;&#x80FD;">100&#x6B21;&#x8FED;&#x4EE3;&#x4F18;&#x5316;&#x540E;&#x7684;&#x6027;&#x80FD;</h2>
<p>100&#x6B21;&#x4F18;&#x5316;&#x8FED;&#x4EE3;&#x4E4B;&#x540E;&#xFF0C;&#x6A21;&#x578B;&#x663E;&#x8457;&#x5730;&#x63D0;&#x5347;&#x4E86;&#x5206;&#x7C7B;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x3002;</p>
<pre><code class="lang-python">optimize(num_iterations=<span class="hljs-number">99</span>) <span class="hljs-comment"># We already performed 1 iteration above.</span>
</code></pre>
<pre><code>Time usage: 0:00:00
</code></pre><pre><code class="lang-python">print_test_accuracy(show_example_errors=<span class="hljs-keyword">True</span>)
</code></pre>
<pre><code>Accuracy on Test-Set: 66.6% (6656 / 10000)
Example errors:
</code></pre><p><img src="output_116_1.png" alt="png"></p>
<h2 id="1000&#x6B21;&#x4F18;&#x5316;&#x8FED;&#x4EE3;&#x540E;&#x7684;&#x6027;&#x80FD;">1000&#x6B21;&#x4F18;&#x5316;&#x8FED;&#x4EE3;&#x540E;&#x7684;&#x6027;&#x80FD;</h2>
<p>1000&#x6B21;&#x4F18;&#x5316;&#x8FED;&#x4EE3;&#x4E4B;&#x540E;&#xFF0C;&#x6A21;&#x578B;&#x5728;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x8D85;&#x8FC7;&#x4E86;90%&#x3002;</p>
<pre><code class="lang-python">optimize(num_iterations=<span class="hljs-number">900</span>) <span class="hljs-comment"># We performed 100 iterations above.</span>
</code></pre>
<pre><code>Optimization Iteration:    101, Training Accuracy:  71.9%
Optimization Iteration:    201, Training Accuracy:  76.6%
Optimization Iteration:    301, Training Accuracy:  71.9%
Optimization Iteration:    401, Training Accuracy:  85.9%
Optimization Iteration:    501, Training Accuracy:  89.1%
Optimization Iteration:    601, Training Accuracy:  95.3%
Optimization Iteration:    701, Training Accuracy:  90.6%
Optimization Iteration:    801, Training Accuracy:  92.2%
Optimization Iteration:    901, Training Accuracy:  95.3%
Time usage: 0:00:03
</code></pre><pre><code class="lang-python">print_test_accuracy(show_example_errors=<span class="hljs-keyword">True</span>)
</code></pre>
<pre><code>Accuracy on Test-Set: 93.1% (9308 / 10000)
Example errors:
</code></pre><p><img src="output_119_1.png" alt="png"></p>
<h2 id="10000&#x6B21;&#x4F18;&#x5316;&#x8FED;&#x4EE3;&#x540E;&#x7684;&#x6027;&#x80FD;">10,000&#x6B21;&#x4F18;&#x5316;&#x8FED;&#x4EE3;&#x540E;&#x7684;&#x6027;&#x80FD;</h2>
<p>&#x7ECF;&#x8FC7;10,000&#x6B21;&#x4F18;&#x5316;&#x8FED;&#x4EE3;&#x540E;&#xFF0C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x7684;&#x5206;&#x7C7B;&#x51C6;&#x786E;&#x7387;&#x9AD8;&#x8FBE;99%&#x3002;</p>
<pre><code class="lang-python">optimize(num_iterations=<span class="hljs-number">9000</span>) <span class="hljs-comment"># We performed 1000 iterations above.</span>
</code></pre>
<pre><code>Optimization Iteration:   1001, Training Accuracy:  98.4%
Optimization Iteration:   1101, Training Accuracy:  93.8%
Optimization Iteration:   1201, Training Accuracy:  92.2%
Optimization Iteration:   1301, Training Accuracy:  95.3%
Optimization Iteration:   1401, Training Accuracy:  93.8%
Optimization Iteration:   1501, Training Accuracy:  93.8%
Optimization Iteration:   1601, Training Accuracy:  92.2%
Optimization Iteration:   1701, Training Accuracy:  92.2%
Optimization Iteration:   1801, Training Accuracy:  89.1%
Optimization Iteration:   1901, Training Accuracy:  95.3%
Optimization Iteration:   2001, Training Accuracy:  93.8%
Optimization Iteration:   2101, Training Accuracy:  98.4%
Optimization Iteration:   2201, Training Accuracy:  92.2%
Optimization Iteration:   2301, Training Accuracy:  95.3%
Optimization Iteration:   2401, Training Accuracy: 100.0%
Optimization Iteration:   2501, Training Accuracy:  96.9%
Optimization Iteration:   2601, Training Accuracy:  93.8%
Optimization Iteration:   2701, Training Accuracy: 100.0%
Optimization Iteration:   2801, Training Accuracy:  95.3%
Optimization Iteration:   2901, Training Accuracy:  95.3%
Optimization Iteration:   3001, Training Accuracy:  96.9%
Optimization Iteration:   3101, Training Accuracy:  96.9%
Optimization Iteration:   3201, Training Accuracy:  95.3%
Optimization Iteration:   3301, Training Accuracy:  96.9%
Optimization Iteration:   3401, Training Accuracy:  98.4%
Optimization Iteration:   3501, Training Accuracy: 100.0%
Optimization Iteration:   3601, Training Accuracy:  98.4%
Optimization Iteration:   3701, Training Accuracy:  95.3%
Optimization Iteration:   3801, Training Accuracy:  95.3%
Optimization Iteration:   3901, Training Accuracy:  95.3%
Optimization Iteration:   4001, Training Accuracy: 100.0%
Optimization Iteration:   4101, Training Accuracy:  93.8%
Optimization Iteration:   4201, Training Accuracy:  95.3%
Optimization Iteration:   4301, Training Accuracy: 100.0%
Optimization Iteration:   4401, Training Accuracy:  96.9%
Optimization Iteration:   4501, Training Accuracy: 100.0%
Optimization Iteration:   4601, Training Accuracy: 100.0%
Optimization Iteration:   4701, Training Accuracy: 100.0%
Optimization Iteration:   4801, Training Accuracy:  98.4%
Optimization Iteration:   4901, Training Accuracy:  98.4%
Optimization Iteration:   5001, Training Accuracy:  98.4%
Optimization Iteration:   5101, Training Accuracy: 100.0%
Optimization Iteration:   5201, Training Accuracy:  95.3%
Optimization Iteration:   5301, Training Accuracy:  96.9%
Optimization Iteration:   5401, Training Accuracy: 100.0%
Optimization Iteration:   5501, Training Accuracy: 100.0%
Optimization Iteration:   5601, Training Accuracy: 100.0%
Optimization Iteration:   5701, Training Accuracy:  96.9%
Optimization Iteration:   5801, Training Accuracy:  98.4%
Optimization Iteration:   5901, Training Accuracy: 100.0%
Optimization Iteration:   6001, Training Accuracy:  95.3%
Optimization Iteration:   6101, Training Accuracy:  96.9%
Optimization Iteration:   6201, Training Accuracy: 100.0%
Optimization Iteration:   6301, Training Accuracy:  96.9%
Optimization Iteration:   6401, Training Accuracy: 100.0%
Optimization Iteration:   6501, Training Accuracy:  98.4%
Optimization Iteration:   6601, Training Accuracy:  98.4%
Optimization Iteration:   6701, Training Accuracy:  95.3%
Optimization Iteration:   6801, Training Accuracy: 100.0%
Optimization Iteration:   6901, Training Accuracy:  98.4%
Optimization Iteration:   7001, Training Accuracy:  95.3%
Optimization Iteration:   7101, Training Accuracy: 100.0%
Optimization Iteration:   7201, Training Accuracy: 100.0%
Optimization Iteration:   7301, Training Accuracy: 100.0%
Optimization Iteration:   7401, Training Accuracy: 100.0%
Optimization Iteration:   7501, Training Accuracy: 100.0%
Optimization Iteration:   7601, Training Accuracy:  96.9%
Optimization Iteration:   7701, Training Accuracy:  98.4%
Optimization Iteration:   7801, Training Accuracy:  95.3%
Optimization Iteration:   7901, Training Accuracy: 100.0%
Optimization Iteration:   8001, Training Accuracy: 100.0%
Optimization Iteration:   8101, Training Accuracy:  98.4%
Optimization Iteration:   8201, Training Accuracy:  98.4%
Optimization Iteration:   8301, Training Accuracy: 100.0%
Optimization Iteration:   8401, Training Accuracy:  96.9%
Optimization Iteration:   8501, Training Accuracy:  98.4%
Optimization Iteration:   8601, Training Accuracy:  98.4%
Optimization Iteration:   8701, Training Accuracy: 100.0%
Optimization Iteration:   8801, Training Accuracy: 100.0%
Optimization Iteration:   8901, Training Accuracy:  98.4%
Optimization Iteration:   9001, Training Accuracy:  95.3%
Optimization Iteration:   9101, Training Accuracy: 100.0%
Optimization Iteration:   9201, Training Accuracy: 100.0%
Optimization Iteration:   9301, Training Accuracy:  96.9%
Optimization Iteration:   9401, Training Accuracy:  96.9%
Optimization Iteration:   9501, Training Accuracy:  98.4%
Optimization Iteration:   9601, Training Accuracy: 100.0%
Optimization Iteration:   9701, Training Accuracy:  96.9%
Optimization Iteration:   9801, Training Accuracy:  98.4%
Optimization Iteration:   9901, Training Accuracy:  98.4%
Time usage: 0:00:26
</code></pre><pre><code class="lang-python">print_test_accuracy(show_example_errors=<span class="hljs-keyword">True</span>,
                    show_confusion_matrix=<span class="hljs-keyword">True</span>)
</code></pre>
<pre><code>Accuracy on Test-Set: 98.8% (9880 / 10000)
Example errors:
</code></pre><p><img src="output_122_1.png" alt="png"></p>
<pre><code>Confusion Matrix:
[[ 973    0    1    0    0    1    1    0    3    1]
 [   0 1129    2    1    0    0    1    1    1    0]
 [   1    2 1023    2    0    0    0    2    2    0]
 [   1    0    1 1002    0    3    0    1    2    0]
 [   0    1    0    0  974    0    1    0    2    4]
 [   2    0    0    3    0  882    2    0    1    2]
 [   4    1    0    0    1    4  948    0    0    0]
 [   1    4   11    2    0    0    0 1004    2    4]
 [   3    0    4    2    1    2    0    0  960    2]
 [   3    4    1    0    7    5    0    2    2  985]]
</code></pre><p><img src="output_122_3.png" alt="png"></p>
<h2 id="&#x6743;&#x91CD;&#x548C;&#x5C42;&#x7684;&#x53EF;&#x89C6;&#x5316;">&#x6743;&#x91CD;&#x548C;&#x5C42;&#x7684;&#x53EF;&#x89C6;&#x5316;</h2>
<p>&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x624B;&#x5199;&#x6570;&#x5B57;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5BF9;&#x5377;&#x79EF;&#x6EE4;&#x6CE2;&#x548C;&#x8F93;&#x51FA;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x53EF;&#x89C6;&#x5316;&#x3002;</p>
<h3 id="&#x7ED8;&#x5236;&#x5377;&#x79EF;&#x6743;&#x91CD;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;">&#x7ED8;&#x5236;&#x5377;&#x79EF;&#x6743;&#x91CD;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;</h3>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">plot_conv_weights</span><span class="hljs-params">(weights, input_channel=<span class="hljs-number">0</span>)</span>:</span>
    <span class="hljs-comment"># Assume weights are TensorFlow ops for 4-dim variables</span>
    <span class="hljs-comment"># e.g. weights_conv1 or weights_conv2.</span>

    <span class="hljs-comment"># Retrieve the values of the weight-variables from TensorFlow.</span>
    <span class="hljs-comment"># A feed-dict is not necessary because nothing is calculated.</span>
    w = session.run(weights)

    <span class="hljs-comment"># Get the lowest and highest values for the weights.</span>
    <span class="hljs-comment"># This is used to correct the colour intensity across</span>
    <span class="hljs-comment"># the images so they can be compared with each other.</span>
    w_min = np.min(w)
    w_max = np.max(w)

    <span class="hljs-comment"># Number of filters used in the conv. layer.</span>
    num_filters = w.shape[<span class="hljs-number">3</span>]

    <span class="hljs-comment"># Number of grids to plot.</span>
    <span class="hljs-comment"># Rounded-up, square-root of the number of filters.</span>
    num_grids = math.ceil(math.sqrt(num_filters))

    <span class="hljs-comment"># Create figure with a grid of sub-plots.</span>
    fig, axes = plt.subplots(num_grids, num_grids)

    <span class="hljs-comment"># Plot all the filter-weights.</span>
    <span class="hljs-keyword">for</span> i, ax <span class="hljs-keyword">in</span> enumerate(axes.flat):
        <span class="hljs-comment"># Only plot the valid filter-weights.</span>
        <span class="hljs-keyword">if</span> i&lt;num_filters:
            <span class="hljs-comment"># Get the weights for the i&apos;th filter of the input channel.</span>
            <span class="hljs-comment"># See new_conv_layer() for details on the format</span>
            <span class="hljs-comment"># of this 4-dim tensor.</span>
            img = w[:, :, input_channel, i]

            <span class="hljs-comment"># Plot image.</span>
            ax.imshow(img, vmin=w_min, vmax=w_max,
                      interpolation=<span class="hljs-string">&apos;nearest&apos;</span>, cmap=<span class="hljs-string">&apos;seismic&apos;</span>)

        <span class="hljs-comment"># Remove ticks from the plot.</span>
        ax.set_xticks([])
        ax.set_yticks([])

    <span class="hljs-comment"># Ensure the plot is shown correctly with multiple plots</span>
    <span class="hljs-comment"># in a single Notebook cell.</span>
    plt.show()
</code></pre>
<h3 id="&#x7ED8;&#x5236;&#x5377;&#x79EF;&#x5C42;&#x8F93;&#x51FA;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;">&#x7ED8;&#x5236;&#x5377;&#x79EF;&#x5C42;&#x8F93;&#x51FA;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;</h3>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">plot_conv_layer</span><span class="hljs-params">(layer, image)</span>:</span>
    <span class="hljs-comment"># Assume layer is a TensorFlow op that outputs a 4-dim tensor</span>
    <span class="hljs-comment"># which is the output of a convolutional layer,</span>
    <span class="hljs-comment"># e.g. layer_conv1 or layer_conv2.</span>

    <span class="hljs-comment"># Create a feed-dict containing just one image.</span>
    <span class="hljs-comment"># Note that we don&apos;t need to feed y_true because it is</span>
    <span class="hljs-comment"># not used in this calculation.</span>
    feed_dict = {x: [image]}

    <span class="hljs-comment"># Calculate and retrieve the output values of the layer</span>
    <span class="hljs-comment"># when inputting that image.</span>
    values = session.run(layer, feed_dict=feed_dict)

    <span class="hljs-comment"># Number of filters used in the conv. layer.</span>
    num_filters = values.shape[<span class="hljs-number">3</span>]

    <span class="hljs-comment"># Number of grids to plot.</span>
    <span class="hljs-comment"># Rounded-up, square-root of the number of filters.</span>
    num_grids = math.ceil(math.sqrt(num_filters))

    <span class="hljs-comment"># Create figure with a grid of sub-plots.</span>
    fig, axes = plt.subplots(num_grids, num_grids)

    <span class="hljs-comment"># Plot the output images of all the filters.</span>
    <span class="hljs-keyword">for</span> i, ax <span class="hljs-keyword">in</span> enumerate(axes.flat):
        <span class="hljs-comment"># Only plot the images for valid filters.</span>
        <span class="hljs-keyword">if</span> i&lt;num_filters:
            <span class="hljs-comment"># Get the output image of using the i&apos;th filter.</span>
            <span class="hljs-comment"># See new_conv_layer() for details on the format</span>
            <span class="hljs-comment"># of this 4-dim tensor.</span>
            img = values[<span class="hljs-number">0</span>, :, :, i]

            <span class="hljs-comment"># Plot image.</span>
            ax.imshow(img, interpolation=<span class="hljs-string">&apos;nearest&apos;</span>, cmap=<span class="hljs-string">&apos;binary&apos;</span>)

        <span class="hljs-comment"># Remove ticks from the plot.</span>
        ax.set_xticks([])
        ax.set_yticks([])

    <span class="hljs-comment"># Ensure the plot is shown correctly with multiple plots</span>
    <span class="hljs-comment"># in a single Notebook cell.</span>
    plt.show()
</code></pre>
<h3 id="&#x8F93;&#x5165;&#x56FE;&#x50CF;">&#x8F93;&#x5165;&#x56FE;&#x50CF;</h3>
<p>&#x7ED8;&#x5236;&#x56FE;&#x50CF;&#x7684;&#x5E2E;&#x52A9;&#x51FD;&#x6570;</p>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">plot_image</span><span class="hljs-params">(image)</span>:</span>
    plt.imshow(image.reshape(img_shape),
               interpolation=<span class="hljs-string">&apos;nearest&apos;</span>,
               cmap=<span class="hljs-string">&apos;binary&apos;</span>)

    plt.show()
</code></pre>
<p>&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF0C;&#x7ED8;&#x5236;&#x4E00;&#x5F20;&#x6D4B;&#x8BD5;&#x96C6;&#x4E2D;&#x7684;&#x56FE;&#x50CF;&#x3002;</p>
<pre><code class="lang-python">image1 = data.test.images[<span class="hljs-number">0</span>]
plot_image(image1)
</code></pre>
<p><img src="output_132_0.png" alt="png"></p>
<p>&#x7ED8;&#x5236;&#x6D4B;&#x8BD5;&#x96C6;&#x91CC;&#x7684;&#x53E6;&#x4E00;&#x5F20;&#x56FE;&#x50CF;&#x3002;</p>
<pre><code class="lang-python">image2 = data.test.images[<span class="hljs-number">13</span>]
plot_image(image2)
</code></pre>
<p><img src="output_134_0.png" alt="png"></p>
<h3 id="&#x5377;&#x79EF;&#x5C42;-1">&#x5377;&#x79EF;&#x5C42; 1</h3>
<p>&#x73B0;&#x5728;&#x7ED8;&#x5236;&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x6EE4;&#x6CE2;&#x6743;&#x91CD;&#x3002;</p>
<p>&#x5176;&#x4E2D;&#x6B63;&#x503C;&#x6743;&#x91CD;&#x662F;&#x7EA2;&#x8272;&#x7684;&#xFF0C;&#x8D1F;&#x503C;&#x4E3A;&#x84DD;&#x8272;&#x3002;</p>
<pre><code class="lang-python">plot_conv_weights(weights=weights_conv1)
</code></pre>
<p><img src="output_137_0.png" alt="png"></p>
<p>&#x5C06;&#x8FD9;&#x4E9B;&#x5377;&#x79EF;&#x6EE4;&#x6CE2;&#x6DFB;&#x52A0;&#x5230;&#x7B2C;&#x4E00;&#x5F20;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#xFF0C;&#x5F97;&#x5230;&#x4EE5;&#x4E0B;&#x8F93;&#x51FA;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x8F93;&#x5165;&#x3002;&#x6CE8;&#x610F;&#x8FD9;&#x4E9B;&#x56FE;&#x50CF;&#x88AB;&#x964D;&#x91C7;&#x6837;&#x5230;14 x 14&#x50CF;&#x7D20;&#xFF0C;&#x5373;&#x539F;&#x59CB;&#x8F93;&#x5165;&#x56FE;&#x5206;&#x8FA8;&#x7387;&#x7684;&#x4E00;&#x534A;&#x3002;</p>
<pre><code class="lang-python">plot_conv_layer(layer=layer_conv1, image=image1)
</code></pre>
<p><img src="output_139_0.png" alt="png"></p>
<p>&#x4E0B;&#x9762;&#x662F;&#x5C06;&#x5377;&#x79EF;&#x6EE4;&#x6CE2;&#x6DFB;&#x52A0;&#x5230;&#x7B2C;&#x4E8C;&#x5F20;&#x56FE;&#x50CF;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code class="lang-python">plot_conv_layer(layer=layer_conv1, image=image2)
</code></pre>
<p><img src="output_141_0.png" alt="png"></p>
<p>&#x4ECE;&#x8FD9;&#x4E9B;&#x56FE;&#x50CF;&#x5F88;&#x96BE;&#x770B;&#x51FA;&#x5377;&#x79EF;&#x6EE4;&#x6CE2;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x5B83;&#x4EEC;&#x751F;&#x6210;&#x4E86;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x7684;&#x4E00;&#x4E9B;&#x53D8;&#x4F53;&#xFF0C;&#x5C31;&#x50CF;&#x5149;&#x7EBF;&#x4ECE;&#x4E0D;&#x540C;&#x89D2;&#x5EA6;&#x6253;&#x5230;&#x56FE;&#x50CF;&#x4E0A;&#x5E76;&#x4EA7;&#x751F;&#x9634;&#x5F71;&#x4E00;&#x6837;&#x3002;</p>
<h3 id="&#x5377;&#x79EF;&#x5C42;-2">&#x5377;&#x79EF;&#x5C42; 2</h3>
<p>&#x73B0;&#x5728;&#x7ED8;&#x5236;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x6EE4;&#x6CE2;&#x6743;&#x91CD;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x6709;16&#x4E2A;&#x8F93;&#x51FA;&#x901A;&#x9053;&#xFF0C;&#x4EE3;&#x8868;&#x7740;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x57FA;&#x5C42;&#x6709;16&#x4E2A;&#x8F93;&#x5165;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x901A;&#x9053;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x6743;&#x91CD;&#x6EE4;&#x6CE2;&#x3002;&#x6211;&#x4EEC;&#x5148;&#x7ED8;&#x5236;&#x7B2C;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x7684;&#x6743;&#x91CD;&#x6EE4;&#x6CE2;&#x3002;</p>
<p>&#x540C;&#x6837;&#x7684;&#xFF0C;&#x6B63;&#x503C;&#x662F;&#x7EA2;&#x8272;&#xFF0C;&#x8D1F;&#x503C;&#x662F;&#x84DD;&#x8272;&#x3002;</p>
<pre><code class="lang-python">plot_conv_weights(weights=weights_conv2, input_channel=<span class="hljs-number">0</span>)
</code></pre>
<p><img src="output_145_0.png" alt="png"></p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x5171;&#x6709;16&#x4E2A;&#x8F93;&#x5165;&#x901A;&#x9053;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x540C;&#x6837;&#x5730;&#x753B;&#x51FA;&#x5176;&#x4ED6;&#x56FE;&#x50CF;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x753B;&#x51FA;&#x7B2C;&#x4E8C;&#x4E2A;&#x901A;&#x9053;&#x7684;&#x56FE;&#x50CF;&#x3002;</p>
<pre><code class="lang-python">plot_conv_weights(weights=weights_conv2, input_channel=<span class="hljs-number">1</span>)
</code></pre>
<p><img src="output_147_0.png" alt="png"></p>
<p>&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x6EE4;&#x6CE2;&#x662F;&#x9AD8;&#x7EF4;&#x5EA6;&#x7684;&#xFF0C;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x5B83;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x5E94;&#x7528;&#x7684;&#x3002;</p>
<p>&#x7ED9;&#x7B2C;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x52A0;&#x4E0A;&#x8FD9;&#x4E9B;&#x6EE4;&#x6CE2;&#xFF0C;&#x5F97;&#x5230;&#x4E0B;&#x9762;&#x7684;&#x56FE;&#x50CF;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x56FE;&#x50CF;&#x88AB;&#x964D;&#x91C7;&#x6837;&#x81F3;7 x 7&#x7684;&#x50CF;&#x7D20;&#xFF0C;&#x5373;&#x4E0A;&#x4E00;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x8F93;&#x51FA;&#x7684;&#x4E00;&#x534A;&#x3002;</p>
<pre><code class="lang-python">plot_conv_layer(layer=layer_conv2, image=image1)
</code></pre>
<p><img src="output_149_0.png" alt="png"></p>
<p>&#x8FD9;&#x662F;&#x7ED9;&#x7B2C;&#x4E8C;&#x5F20;&#x56FE;&#x50CF;&#x52A0;&#x4E0A;&#x6EE4;&#x6CE2;&#x6743;&#x91CD;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code class="lang-python">plot_conv_layer(layer=layer_conv2, image=image2)
</code></pre>
<p><img src="output_151_0.png" alt="png"></p>
<p>&#x4ECE;&#x8FD9;&#x4E9B;&#x56FE;&#x50CF;&#x6765;&#x770B;&#xFF0C;&#x4F3C;&#x4E4E;&#x7B2C;&#x4E8C;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x4F1A;&#x68C0;&#x6D4B;&#x8F93;&#x5165;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x7EBF;&#x6BB5;&#x548C;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x5BF9;&#x8F93;&#x5165;&#x56FE;&#x4E2D;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x5316;&#x4E0D;&#x90A3;&#x4E48;&#x654F;&#x611F;&#x3002;</p>
<h3 id="&#x5173;&#x95ED;tensorflow&#x4F1A;&#x8BDD;">&#x5173;&#x95ED;TensorFlow&#x4F1A;&#x8BDD;</h3>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x7528;TensorFlow&#x5B8C;&#x6210;&#x4E86;&#x4EFB;&#x52A1;&#xFF0C;&#x5173;&#x95ED;session&#xFF0C;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#x3002;</p>
<pre><code class="lang-python"><span class="hljs-comment"># This has been commented out in case you want to modify and experiment</span>
<span class="hljs-comment"># with the Notebook without having to restart it.</span>
<span class="hljs-comment"># session.close()</span>
</code></pre>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x6211;&#x4EEC;&#x770B;&#x5230;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x8BC6;&#x522B;&#x624B;&#x5199;&#x6570;&#x5B57;&#x4E0A;&#x7684;&#x8868;&#x73B0;&#x8981;&#x6BD4;&#x6559;&#x7A0B;#01&#x4E2D;&#x7B80;&#x5355;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x8981;&#x597D;&#x5F97;&#x591A;&#x3002;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x80FD;&#x8FBE;&#x5230;99%&#x7684;&#x5206;&#x7C7B;&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x505A;&#x4E00;&#x4E9B;&#x8C03;&#x6574;&#xFF0C;&#x8FD8;&#x53EF;&#x80FD;&#x8868;&#x73B0;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x800C;&#x7B80;&#x5355;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x53EA;&#x6709;91%&#x7684;&#x6B63;&#x786E;&#x7387;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x66F4;&#x590D;&#x6742;&#xFF0C;&#x5E76;&#x4E14;&#x5149;&#x770B;&#x6743;&#x91CD;&#x6EE4;&#x6CE2;&#x4E5F;&#x4E0D;&#x597D;&#x7406;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x80FD;&#x594F;&#x6548;&#x6216;&#x8005;&#x5931;&#x8D25;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x73B0;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8981;&#x5BFB;&#x627E;&#x4E00;&#x79CD;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5BF9;&#x5B83;&#x4EEC;&#x5185;&#x90E8;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x8FDB;&#x884C;&#x53EF;&#x89C6;&#x5316;&#x3002;</p>
<h2 id="&#x7EC3;&#x4E60;">&#x7EC3;&#x4E60;</h2>
<p>&#x4E0B;&#x9762;&#x4F7F;&#x4E00;&#x4E9B;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4F60;&#x63D0;&#x5347;TensorFlow&#x6280;&#x80FD;&#x7684;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#x7EC3;&#x4E60;&#x3002;&#x4E3A;&#x4E86;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x66F4;&#x5408;&#x9002;&#x5730;&#x4F7F;&#x7528;TensorFlow&#xFF0C;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<p>&#x5728;&#x4F60;&#x5BF9;&#x8FD9;&#x4E2A;Notebook&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x4E4B;&#x524D;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5148;&#x5907;&#x4EFD;&#x4E00;&#x4E0B;&#x3002;</p>
<ul>
<li><p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x6539;&#x53D8;&#x4EFB;&#x4F55;&#x53C2;&#x6570;&#xFF0C;&#x591A;&#x6B21;&#x8FD0;&#x884C;Notebook&#xFF0C;&#x4F1A;&#x5F97;&#x5230;&#x5B8C;&#x6210;&#x4E00;&#x6837;&#x7684;&#x7ED3;&#x679C;&#x5417;&#xFF1F;&#x968F;&#x673A;&#x6027;&#x7684;&#x6765;&#x6E90;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
</li>
<li><p>&#x518D;&#x8FDB;&#x884C;10,000&#x6B21;&#x4F18;&#x5316;&#x3002;&#x7ED3;&#x679C;&#x6709;&#x53D8;&#x597D;&#x4E48;&#xFF1F;</p>
</li>
<li><p>&#x6539;&#x53D8;&#x4F18;&#x5316;&#x5668;&#x7684;&#x5B66;&#x4E60;&#x7387;&#x3002;</p>
</li>
<li><p>&#x6539;&#x53D8;&#x5C42;&#x6B21;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x5377;&#x79EF;&#x6EE4;&#x6CE2;&#x5668;&#x6570;&#x91CF;&#x3001;&#x6EE4;&#x6CE2;&#x5668;&#x7684;&#x5927;&#x5C0F;&#x3001;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x4E2D;&#x7684;&#x795E;&#x7ECF;&#x5143;&#x6570;&#x91CF;&#x7B49;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x5728;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x4E4B;&#x540E;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;drop-out&#x5C42;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x5206;&#x7C7B;&#x51C6;&#x786E;&#x7387;&#x7684;&#x65F6;&#x5019;&#xFF0C;drop-out&#x5C42;&#x53EF;&#x80FD;&#x4E3A;0&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;placeholder&#x53D8;&#x91CF;&#x3002;</p>
</li>
<li><p>&#x6539;&#x53D8;ReLU&#x548C;max-pooling&#x7684;&#x987A;&#x5E8F;&#x3002;&#x5B83;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x76F8;&#x540C;&#x4E48;&#xFF1F;&#x6700;&#x5FEB;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x8282;&#x7701;&#x4E86;&#x591A;&#x5C11;&#x8BA1;&#x7B97;&#x91CF;&#xFF1F;&#x8FD9;&#x4E5F;&#x9002;&#x7528;&#x4E8E;Sigmoid-function&#x548C;average-pooling&#x5417;&#xFF1F;</p>
</li>
<li><p>&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5377;&#x79EF;&#x5C42;&#x548C;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x3002;&#x8FD9;&#x5BF9;&#x6027;&#x80FD;&#x6709;&#x5E2E;&#x52A9;&#x5417;&#xFF1F;</p>
</li>
<li><p>&#x80FD;&#x5F97;&#x5230;&#x826F;&#x597D;&#x7ED3;&#x679C;&#x7684;&#x6700;&#x5C0F;&#x53EF;&#x80FD;&#x914D;&#x7F6E;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
</li>
<li><p>&#x8BD5;&#x7740;&#x5728;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5168;&#x8FDE;&#x63A5;&#x5C42;&#x4E2D;&#x4F7F;&#x7528;ReLU&#x3002;&#x6027;&#x80FD;&#x6709;&#x53D8;&#x5316;&#x5417;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;</p>
</li>
<li><p>&#x5377;&#x79EF;&#x5C42;&#x91CC;&#x4E0D;&#x7528;pooling&#x3002;&#x8FD9;&#x5BF9;&#x5206;&#x7C7B;&#x51C6;&#x786E;&#x7387;&#x548C;&#x8BAD;&#x7EC3;&#x65F6;&#x95F4;&#x6709;&#x5F71;&#x54CD;&#x5417;&#xFF1F;</p>
</li>
<li><p>&#x5728;&#x5377;&#x79EF;&#x5C42;&#x91CC;&#x7528;2x2&#x7684;stride&#x4EE3;&#x66FF;max-pooling&#xFF1F;&#x6709;&#x4EC0;&#x4E48;&#x53D8;&#x5316;&#x5417;&#xFF1F;</p>
</li>
<li><p>&#x4E0D;&#x770B;&#x6E90;&#x7801;&#xFF0C;&#x81EA;&#x5DF1;&#x91CD;&#x5199;&#x7A0B;&#x5E8F;&#x3002;</p>
</li>
<li><p>&#x5411;&#x670B;&#x53CB;&#x89E3;&#x91CA;&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x3002;</p>
</li>
</ul>
<h2 id="license-mit">License (MIT)</h2>
<p>Copyright (c) 2016 by <a href="http://www.hvass-labs.org/" target="_blank">Magnus Erik Hvass Pedersen</a></p>
<p>Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the &quot;Software&quot;), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:</p>
<p>The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.</p>
<p>THE SOFTWARE IS PROVIDED &quot;AS IS&quot;, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../01_Simple_Linear_Model_zh_CN/01_Simple_Linear_Model_zh_CN.html" class="navigation navigation-prev " aria-label="Previous page: 简单线性模型">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../03_PrettyTensor_zh_CN/03_PrettyTensor_zh_CN.html" class="navigation navigation-next " aria-label="Next page: PrettyTensor">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"卷积神经网络","level":"1.3","depth":1,"next":{"title":"PrettyTensor","level":"1.4","depth":1,"path":"03_PrettyTensor_zh_CN/03_PrettyTensor_zh_CN.md","ref":"03_PrettyTensor_zh_CN/03_PrettyTensor_zh_CN.md","articles":[]},"previous":{"title":"简单线性模型","level":"1.2","depth":1,"path":"01_Simple_Linear_Model_zh_CN/01_Simple_Linear_Model_zh_CN.md","ref":"01_Simple_Linear_Model_zh_CN/01_Simple_Linear_Model_zh_CN.md","articles":[]},"dir":"ltr"},"config":{"plugins":["comment"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"comment":{"highlightCommented":true},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"wizardforcel","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"TensorFlow 教程（Hvass）","language":"zh","links":{"sidebar":{"TensorFlow 教程（Hvass）":"https://www.gitbook.com/book/wizardforcel/tf-tut-hvass"},"gitbook":true},"gitbook":"*","description":"Tensorflow 教程（Hvass）"},"file":{"path":"02_Convolutional_Neural_Network_zh_CN/02_Convolutional_Neural_Network_zh_CN.md","mtime":"2017-09-18T01:21:37.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2017-09-18T01:34:14.068Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-comment/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

