
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一章 起步 · Kali Linux 网络扫描秘籍</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="wizardforcel">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-comment/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/wizardforcel/kali-linux-network-scanning-cookbook" target="_blank" class="custom-link">Kali Linux 网络扫描秘籍</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Kali Linux 网络扫描秘籍 中文版
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章 起步
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章 探索扫描
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章 端口扫描
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章 指纹识别
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章 漏洞扫描
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章 拒绝服务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章 Web 应用扫描
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章 自动化 Kali 工具
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一章 起步</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E00;&#x7AE0;-&#x8D77;&#x6B65;">&#x7B2C;&#x4E00;&#x7AE0; &#x8D77;&#x6B65;</h1>
<blockquote>
<p>&#x4F5C;&#x8005;&#xFF1A;Justin Hutchens</p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
</blockquote>
<p>&#x7B2C;&#x4E00;&#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x8BBE;&#x7F6E;&#x548C;&#x914D;&#x7F6E;&#x865A;&#x62DF;&#x5B89;&#x5168;&#x73AF;&#x5883;&#x7684;&#x57FA;&#x672C;&#x77E5;&#x8BC6;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x5927;&#x591A;&#x6570;&#x573A;&#x666F;&#x548C;&#x7EC3;&#x4E60;&#x3002; &#x672C;&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x4E3B;&#x9898;&#x5305;&#x62EC;&#x865A;&#x62DF;&#x5316;&#x8F6F;&#x4EF6;&#x7684;&#x5B89;&#x88C5;&#xFF0C;&#x865A;&#x62DF;&#x73AF;&#x5883;&#x4E2D;&#x5404;&#x79CD;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x88C5;&#x4EE5;&#x53CA;&#x7EC3;&#x4E60;&#x4E2D;&#x5C06;&#x4F7F;&#x7528;&#x7684;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x7684;&#x914D;&#x7F6E;&#x3002;</p>
<h2 id="11-&#x4F7F;&#x7528;-vmware-player&#xFF08;windows&#xFF09;&#x914D;&#x7F6E;&#x5B89;&#x5168;&#x73AF;&#x5883;">1.1 &#x4F7F;&#x7528; VMware Player&#xFF08;Windows&#xFF09;&#x914D;&#x7F6E;&#x5B89;&#x5168;&#x73AF;&#x5883;</h2>
<p>&#x901A;&#x8FC7;&#x5728; Windows &#x5DE5;&#x4F5C;&#x7AD9;&#x4E0A;&#x5B89;&#x88C5;VMware Player&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x5177;&#x6709;&#x76F8;&#x5BF9;&#x8F83;&#x4F4E;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#x7684; Windows PC &#x4E0A;&#x8FD0;&#x884C;&#x865A;&#x62DF;&#x5B89;&#x5168;&#x73AF;&#x5883;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x514D;&#x8D39;&#x83B7;&#x5F97; VMware Player&#xFF0C;&#x6216;&#x8005;&#x4EE5;&#x4F4E;&#x6210;&#x672C;&#x83B7;&#x5F97;&#x529F;&#x80FD;&#x66F4;&#x4E3A;&#x5F3A;&#x5927;&#x7684; VMware Player Plus&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x5728; Windows &#x5DE5;&#x4F5C;&#x7AD9;&#x4E0A;&#x5B89;&#x88C5; VMware Player&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x4E0B;&#x8F7D;&#x8F6F;&#x4EF6;&#x3002; VMware Player &#x514D;&#x8D39;&#x7248;&#x672C;&#x7684;&#x4E0B;&#x8F7D;&#xFF0C;&#x8BF7;&#x8BBF;&#x95EE;<code>https&#xFF1A;// my.vmware.com/web/vmware/free</code>&#x3002; &#x5728;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x4E2D;&#xFF0C;&#x5411;&#x4E0B;&#x6EDA;&#x52A8;&#x5230; VMware Player &#x94FE;&#x63A5;&#xFF0C;&#x7136;&#x540E;&#x5355;&#x51FB;&#x4E0B;&#x8F7D;&#x3002; &#x5728;&#x4E0B;&#x4E00;&#x9875;&#x4E2D;&#xFF0C;&#x9009;&#x62E9; Windows 32 &#x6216; 64 &#x4F4D;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x7136;&#x540E;&#x5355;&#x51FB;&#x4E0B;&#x8F7D;&#x3002; &#x8FD8;&#x6709;&#x53EF;&#x7528;&#x4E8E; Linux 32 &#x4F4D;&#x548C; 64 &#x4F4D;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x88C5;&#x5305;&#x3002;</p>
<p><img src="img/1-1-1.jpg" alt=""></p>
<p>&#x6253;&#x5F00;VMware Player&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x521B;&#x5EFA;&#x65B0;&#x865A;&#x62DF;&#x673A;&#x6765;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x3002; &#x8FD9;&#x4F1A;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#x7684;&#x865A;&#x62DF;&#x673A;&#x5B89;&#x88C5;&#x5411;&#x5BFC;&#xFF1A;</p>
<p><img src="img/1-1-2.jpg" alt=""></p>
<p>&#x4F60;&#x9700;&#x8981;&#x5728;&#x5B89;&#x88C5;&#x5411;&#x5BFC;&#x4E2D;&#x6267;&#x884C;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x662F;&#x5B9A;&#x4E49;&#x5B89;&#x88C5;&#x4ECB;&#x8D28;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x76F4;&#x63A5;&#x4ECE;&#x4E3B;&#x673A;&#x7684;&#x5149;&#x76D8;&#x9A71;&#x52A8;&#x5668;&#x8FDB;&#x884C;&#x5B89;&#x88C5;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; ISO &#x6620;&#x50CF;&#x6587;&#x4EF6;&#x3002;  &#x672C;&#x8282;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x5927;&#x591A;&#x6570;&#x5B89;&#x88C5;&#x90FD;&#x4F7F;&#x7528; ISO&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x79D8;&#x7C4D;&#x4E2D;&#x90FD;&#x4F1A;&#x63D0;&#x5230;&#x4F60;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5B83;&#x4EEC;&#x7684;&#x5730;&#x65B9;&#x3002; &#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x6D4F;&#x89C8;&#x73B0;&#x6709;&#x7684;ISO&#x6587;&#x4EF6;&#x5E76;&#x70B9;&#x51FB;<code>Next</code>&#xFF0C;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-1-3.jpg" alt=""></p>
<p>&#x7136;&#x540E;&#x9700;&#x8981;&#x4E3A;&#x865A;&#x62DF;&#x673A;&#x5206;&#x914D;&#x540D;&#x79F0;&#x3002; &#x865A;&#x62DF;&#x673A;&#x540D;&#x79F0;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x4EFB;&#x610F;&#x503C;&#xFF0C;&#x7528;&#x4F5C;&#x6807;&#x8BC6;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E0E;&#x5E93;&#x4E2D;&#x7684;&#x5176;&#x4ED6; VM &#x8FDB;&#x884C;&#x6807;&#x8BC6;&#x548C;&#x533A;&#x5206;&#x3002; &#x7531;&#x4E8E;&#x5B89;&#x5168;&#x73AF;&#x5883;&#x901A;&#x5E38;&#x5206;&#x4E3A;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x5C06;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6307;&#x5B9A;&#x4E3A;&#x865A;&#x62DF;&#x673A;&#x540D;&#x79F0;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x53EF;&#x80FD;&#x5F88;&#x6709;&#x7528;&#x3002; &#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x663E;&#x793A;<code>Specify Disk Capacity</code>&#x7A97;&#x53E3;&#xFF1A;</p>
<p><img src="img/1-1-4.jpg" alt=""></p>
<p>&#x4E0B;&#x4E00;&#x4E2A;&#x5C4F;&#x5E55;&#x8BF7;&#x6C42;&#x5B89;&#x88C5;&#x7684;&#x6700;&#x5927;&#x5C3A;&#x5BF8;&#x503C;&#x3002; &#x865A;&#x62DF;&#x673A;&#x4F1A;&#x6309;&#x9700;&#x4F7F;&#x7528;&#x786C;&#x76D8;&#x9A71;&#x52A8;&#x5668;&#x7A7A;&#x95F4;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;&#x6B64;&#x5904;&#x6307;&#x5B9A;&#x7684;&#x503C;&#x3002; &#x6B64;&#x5916;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x865A;&#x62DF;&#x673A;&#x662F;&#x5305;&#x542B;&#x5728;&#x5355;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#x8FD8;&#x662F;&#x5206;&#x5E03;&#x5728;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#x3002; &#x5B8C;&#x6210;&#x6307;&#x5B9A;&#x78C1;&#x76D8;&#x5BB9;&#x91CF;&#x540E;&#xFF0C;&#x4F60;&#x5C06;&#x770B;&#x5230;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#xFF1A;</p>
<p><img src="img/1-1-5.jpg" alt=""></p>
<p>&#x6700;&#x540E;&#x4E00;&#x6B65;&#x63D0;&#x4F9B;&#x4E86;&#x914D;&#x7F6E;&#x7684;&#x6458;&#x8981;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;<code>Finish</code>&#x6309;&#x94AE;&#x6765;&#x5B8C;&#x6210;&#x865A;&#x62DF;&#x673A;&#x7684;&#x521B;&#x5EFA;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;<code>Customize Hardware&#x2026;</code>&#x6309;&#x94AE;&#x6765;&#x64CD;&#x4F5C;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x914D;&#x7F6E;&#x3002; &#x770B;&#x4E00;&#x770B;&#x9AD8;&#x7EA7;&#x914D;&#x7F6E;&#x7684;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#xFF1A;</p>
<p><img src="img/1-1-6.jpg" alt=""></p>
<p>&#x9AD8;&#x7EA7;&#x914D;&#x7F6E;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x63A7;&#x5236;&#x5171;&#x4EAB;&#x8D44;&#x6E90;&#xFF0C;&#x865A;&#x62DF;&#x786C;&#x4EF6;&#x914D;&#x7F6E;&#x548C;&#x7F51;&#x7EDC;&#x3002; &#x5927;&#x591A;&#x6570;&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#x5BF9;&#x4E8E;&#x4F60;&#x7684;&#x5B89;&#x5168;&#x914D;&#x7F6E;&#x5E94;&#x8BE5;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x9700;&#x8981;&#x5728;&#x4EE5;&#x540E;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBF;&#x95EE;&#x865A;&#x62DF;&#x673A;&#x8BBE;&#x7F6E;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#x3002; &#x5B8C;&#x6210;&#x9AD8;&#x7EA7;&#x914D;&#x7F6E;&#x8BBE;&#x7F6E;&#x540E;&#xFF0C;&#x4F60;&#x5C06;&#x770B;&#x5230;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#xFF1A;</p>
<p><img src="img/1-1-7.jpg" alt=""></p>
<p>&#x5B89;&#x88C5;&#x5411;&#x5BFC;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4F1A;&#x770B;&#x5230;&#x865A;&#x62DF;&#x673A;&#x5E93;&#x4E2D;&#x5217;&#x51FA;&#x4E86;&#x65B0;&#x7684;&#x865A;&#x62DF;&#x673A;&#x3002; &#x5B83;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x91CC;&#x901A;&#x8FC7;&#x6309;&#x4E0B;&#x64AD;&#x653E;&#x6309;&#x94AE;&#x542F;&#x52A8;&#x3002; &#x901A;&#x8FC7;&#x6253;&#x5F00; VMware Player &#x7684;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x548C;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x4E2D;&#x7684;&#x552F;&#x4E00; VM&#xFF0C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>VMware &#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x5316;&#x73AF;&#x5883;&#xFF0C;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x6765;&#x81EA;&#x5355;&#x4E2A;&#x4E3B;&#x673A;&#x7CFB;&#x7EDF;&#x7684;&#x8D44;&#x6E90;&#x6765;&#x521B;&#x5EFA;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x3002; &#x865A;&#x62DF;&#x5316;&#x8F6F;&#x4EF6;&#xFF08;&#x5982; VMware&#xFF09;&#x4F7F;&#x4E2A;&#x4EBA;&#xFF0C;&#x72EC;&#x7ACB;&#x7814;&#x7A76;&#x8005;&#x6784;&#x5EFA;&#x5B89;&#x5168;&#x73AF;&#x5883;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x548C;&#x4FBF;&#x5B9C;&#x3002;</p>
<h2 id="12-&#x4F7F;&#x7528;-vmware-player&#xFF08;mac-os-x&#xFF09;&#x914D;&#x7F6E;&#x5B89;&#x5168;&#x73AF;&#x5883;">1.2 &#x4F7F;&#x7528; VMware Player&#xFF08;Mac OS X&#xFF09;&#x914D;&#x7F6E;&#x5B89;&#x5168;&#x73AF;&#x5883;</h2>
<p>&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728; Mac &#x4E0A;&#x5B89;&#x88C5; VMware Fusion&#xFF0C;&#x5728; Mac OS X &#x4E0A;&#x8FD0;&#x884C;&#x865A;&#x62DF;&#x5B89;&#x5168;&#x73AF;&#x5883;&#x3002; VMware Fusion &#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5FC5;&#x987B;&#x8D2D;&#x4E70;&#x7684;&#x8BB8;&#x53EF;&#x8BC1;&#xFF0C;&#x4F46;&#x5B83;&#x7684;&#x4EF7;&#x683C;&#x975E;&#x5E38;&#x5408;&#x7406;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x8981;&#x5728; Mac &#x4E0A;&#x5B89;&#x88C5; VMware Player&#xFF0C;&#x60A8;&#x9996;&#x5148;&#x9700;&#x8981;&#x4E0B;&#x8F7D;&#x8F6F;&#x4EF6;&#x3002; &#x8981;&#x4E0B;&#x8F7D;&#x514D;&#x8D39;&#x8BD5;&#x7528;&#x7248;&#x6216;&#x8D2D;&#x4E70;&#x8F6F;&#x4EF6;&#xFF0C;&#x8BF7;&#x8BBF;&#x95EE;&#x4EE5;&#x4E0B;URL&#xFF1A;<code>https&#xFF1A;//www.vmware.com/products/ fusion /</code>&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E0B;&#x8F7D;&#x8F6F;&#x4EF6;&#x5305;&#x540E;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5728;&#x9ED8;&#x8BA4;&#x4E0B;&#x8F7D;&#x76EE;&#x5F55;&#x4E2D;&#x627E;&#x5230;&#x5B83;&#x3002; &#x8FD0;&#x884C;<code>.dmg</code>&#x5B89;&#x88C5;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x6309;&#x7167;&#x5C4F;&#x5E55;&#x4E0A;&#x7684;&#x8BF4;&#x660E;&#x8FDB;&#x884C;&#x5B89;&#x88C5;&#x3002; &#x5B89;&#x88C5;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE; Dock &#x6216; Dock &#x4E2D;&#x7684; Applications &#x76EE;&#x5F55;&#x542F;&#x52A8; VMware Fusion&#x3002; &#x52A0;&#x8F7D;&#x540E;&#xFF0C;&#x4F60;&#x5C06;&#x770B;&#x5230;&#x865A;&#x62DF;&#x673A;&#x5E93;&#x3002; &#x6B64;&#x5E93;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x4F46;&#x4F60;&#x5728;&#x5C4F;&#x5E55;&#x5DE6;&#x4FA7;&#x521B;&#x5EFA;&#x5B83;&#x4EEC;&#x65F6;&#x4F1A;&#x586B;&#x5145;&#x5B83;&#x4EEC;&#x3002; &#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x663E;&#x793A;&#x4E86;&#x865A;&#x62DF;&#x673A;&#x5E93;&#xFF1A;</p>
<p><img src="img/1-2-1.jpg" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x5F00;&#x59CB;&#xFF0C;&#x8BF7;&#x70B9;&#x51FB;&#x5C4F;&#x5E55;&#x5DE6;&#x4E0A;&#x89D2;&#x7684;<code>Add</code>&#x6309;&#x94AE;&#xFF0C;&#x7136;&#x540E;&#x70B9;&#x51FB;<code>New</code>&#x3002; &#x8FD9;&#x4F1A;&#x542F;&#x52A8;&#x865A;&#x62DF;&#x673A;&#x5B89;&#x88C5;&#x5411;&#x5BFC;&#x3002; &#x5B89;&#x88C5;&#x5411;&#x5BFC;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x6307;&#x5BFC;&#x8FC7;&#x7A0B;&#xFF0C;&#x7528;&#x4E8E;&#x8BBE;&#x7F6E;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-2-2.jpg" alt=""></p>
<p>&#x7B2C;&#x4E00;&#x6B65;&#x8BF7;&#x6C42;&#x4F60;&#x9009;&#x62E9;&#x5B89;&#x88C5;&#x65B9;&#x6CD5;&#x3002; VMware Fusion &#x63D0;&#x4F9B;&#x4E86;&#x4ECE;&#x78C1;&#x76D8;&#x6216;&#x6620;&#x50CF;&#xFF08;ISO &#x6587;&#x4EF6;&#xFF09;&#x5B89;&#x88C5;&#x7684;&#x9009;&#x9879;&#xFF0C;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x591A;&#x79CD;&#x6280;&#x672F;&#x5C06;&#x73B0;&#x6709;&#x7CFB;&#x7EDF;&#x8FC1;&#x79FB;&#x5230;&#x65B0;&#x865A;&#x62DF;&#x673A;&#x3002; &#x5BF9;&#x4E8E;&#x672C;&#x8282;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x6240;&#x6709;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x9009;&#x62E9;&#x7B2C;&#x4E00;&#x4E2A;&#x9009;&#x9879;&#x3002; </p>
<p>&#x9009;&#x62E9;&#x7B2C;&#x4E00;&#x4E2A;&#x9009;&#x9879;<code>Install from disc or image</code>&#x503C;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x6536;&#x5230;&#x63D0;&#x793A;&#xFF0C;&#x9009;&#x62E9;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x5B89;&#x88C5;&#x5149;&#x76D8;&#x6216;&#x6620;&#x50CF;&#x3002; &#x5982;&#x679C;&#x6CA1;&#x6709;&#x81EA;&#x52A8;&#x586B;&#x5145;&#xFF0C;&#x6216;&#x8005;&#x81EA;&#x52A8;&#x586B;&#x5145;&#x7684;&#x9009;&#x9879;&#x4E0D;&#x662F;&#x4F60;&#x8981;&#x5B89;&#x88C5;&#x7684;&#x6620;&#x50CF;&#xFF0C;&#x8BF7;&#x5355;&#x51FB;<code>Use another disc or disc image</code>&#x6309;&#x94AE;&#x3002; &#x8FD9;&#x5E94;&#x8BE5;&#x4F1A;&#x6253;&#x5F00; <code>Finder</code>&#xFF0C;&#x5B83;&#x8BA9;&#x4F60;&#x80FD;&#x591F;&#x6D4F;&#x89C8;&#x5230;&#x60A8;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x955C;&#x50CF;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x7279;&#x5B9A;&#x7CFB;&#x7EDF;&#x6620;&#x50CF;&#x6587;&#x4EF6;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5C06;&#x5728;&#x672C;&#x8282;&#x540E;&#x9762;&#x7684;&#x79D8;&#x7C4D;&#x4E2D;&#x8BA8;&#x8BBA;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x88AB;&#x5B9A;&#x5411;&#x5230;<code>Finish</code>&#x7A97;&#x53E3;&#xFF1A;</p>
<p><img src="img/1-2-3.jpg" alt=""></p>
<p>&#x9009;&#x62E9;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x955C;&#x50CF;&#x6587;&#x4EF6;&#x540E;&#xFF0C;&#x5355;&#x51FB;<code>Continue</code>&#x6309;&#x94AE;&#xFF0C;&#x4F60;&#x4F1A;&#x8FDB;&#x5165;&#x6458;&#x8981;&#x5C4F;&#x5E55;&#x3002; &#x8FD9;&#x4F1A;&#x5411;&#x4F60;&#x63D0;&#x4F9B;&#x6240;&#x9009;&#x914D;&#x7F6E;&#x7684;&#x6982;&#x8FF0;&#x3002; &#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x66F4;&#x6539;&#x8FD9;&#x4E9B;&#x8BBE;&#x7F6E;&#xFF0C;&#x8BF7;&#x5355;&#x51FB;<code>Customize Settings</code>&#x6309;&#x94AE;&#x3002; &#x5426;&#x5219;&#xFF0C;&#x5355;&#x51FB;<code>Finish</code>&#x6309;&#x94AE;&#x521B;&#x5EFA;&#x865A;&#x62DF;&#x673A;&#x3002; &#x5F53;&#x4F60;&#x5355;&#x51FB;&#x5B83;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x88AB;&#x8981;&#x6C42;&#x4FDD;&#x5B58;&#x4E0E;&#x865A;&#x62DF;&#x673A;&#x5173;&#x8054;&#x7684;&#x6587;&#x4EF6;&#x3002; &#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x5B83;&#x7684;&#x540D;&#x79F0;&#x662F;&#x865A;&#x62DF;&#x673A;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5E76;&#x5C06;&#x663E;&#x793A;&#x5728;&#x865A;&#x62DF;&#x673A;&#x5E93;&#x4E2D;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-2-4.jpg" alt=""></p>
<p>&#x5F53;&#x4F60;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x865A;&#x62DF;&#x673A;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x5B83;&#x4EEC;&#x5305;&#x542B;&#x5728;&#x5C4F;&#x5E55;&#x5DE6;&#x4FA7;&#x7684;&#x865A;&#x62DF;&#x673A;&#x5E93;&#x4E2D;&#x3002; &#x901A;&#x8FC7;&#x9009;&#x62E9;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x7684;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5355;&#x51FB;&#x9876;&#x90E8;&#x7684;<code>Start Up</code>&#x6309;&#x94AE;&#x542F;&#x52A8;&#x5B83;&#x3002; &#x6B64;&#x5916;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>Settings</code>&#x6309;&#x94AE;&#x4FEE;&#x6539;&#x914D;&#x7F6E;&#xFF0C;&#x6216;&#x4F7F;&#x7528;<code>Snapshots</code>&#x6309;&#x94AE;&#x5728;&#x5404;&#x79CD;&#x65F6;&#x95F4;&#x4FDD;&#x5B58;&#x865A;&#x62DF;&#x673A;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4ECE;&#x5E93;&#x4E2D;&#x72EC;&#x7ACB;&#x542F;&#x52A8;&#x6BCF;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x6765;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x901A;&#x8FC7;&#x5728; Mac OS X &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x4F7F;&#x7528; VMware Fusion&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x865A;&#x62DF;&#x5316;&#x5B9E;&#x9A8C;&#x73AF;&#x5883;&#xFF0C;&#x4EE5;&#x5728; Apple &#x4E3B;&#x673A;&#x4E0A;&#x521B;&#x5EFA;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x3002; &#x865A;&#x62DF;&#x5316;&#x8F6F;&#x4EF6;&#xFF08;&#x5982; VMware&#xFF09;&#x4F7F;&#x4E2A;&#x4EBA;&#xFF0C;&#x72EC;&#x7ACB;&#x7814;&#x7A76;&#x8005;&#x6784;&#x5EFA;&#x5B89;&#x5168;&#x73AF;&#x5883;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x548C;&#x4FBF;&#x5B9C;&#x3002;</p>
<h2 id="13-&#x5B89;&#x88C5;--ubuntu-server">1.3 &#x5B89;&#x88C5;  Ubuntu Server</h2>
<p>Ubuntu Server &#x662F;&#x4E00;&#x4E2A;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#x7684; Linux &#x53D1;&#x884C;&#x7248;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x6258;&#x7BA1;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x548C;&#x6F0F;&#x6D1E;&#x8F6F;&#x4EF6;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x5B89;&#x5168;&#x73AF;&#x5883;&#x4E2D;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002; &#x5982;&#x679C;&#x4F60;&#x613F;&#x610F;&#xFF0C;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x4F7F;&#x7528;&#x5176;&#x4ED6; Linux &#x53D1;&#x884C;&#x7248;; &#x7136;&#x800C;&#xFF0C;Ubuntu &#x662F;&#x521D;&#x5B66;&#x8005;&#x7684;&#x826F;&#x597D;&#x9009;&#x62E9;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x5927;&#x91CF;&#x7684;&#x516C;&#x5F00;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x548C;&#x8D44;&#x6E90;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x5728; VMware &#x4E2D;&#x5B89;&#x88C5; Ubuntu Server &#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E0B;&#x8F7D;&#x78C1;&#x76D8;&#x955C;&#x50CF;&#xFF08;ISO &#x6587;&#x4EF6;&#xFF09;&#x3002; &#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x4ECE; Ubuntu &#x7684;&#x7F51;&#x7AD9;&#x4E0B;&#x8F7D;&#xFF0C;&#x7F51;&#x5740;&#x5982;&#x4E0B;&#xFF1A;<code>http://www.ubuntu.com/server</code>&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x5728;&#x52A0;&#x8F7D;&#x6620;&#x50CF;&#x6587;&#x4EF6;&#x5E76;&#x4ECE;&#x865A;&#x62DF;&#x673A;&#x542F;&#x52A8;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x9ED8;&#x8BA4;&#x7684; Ubuntu &#x83DC;&#x5355;&#xFF0C;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x622A;&#x56FE;&#x6240;&#x793A;&#x3002; &#x8FD9;&#x5305;&#x62EC;&#x591A;&#x4E2A;&#x5B89;&#x88C5;&#x548C;&#x8BCA;&#x65AD;&#x9009;&#x9879;&#x3002; &#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x952E;&#x76D8;&#x5BFC;&#x822A;&#x83DC;&#x5355;&#x3002; &#x5BF9;&#x4E8E;&#x6807;&#x51C6;&#x5B89;&#x88C5;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x9009;&#x4E2D;<code>Install Ubuntu Server</code>&#x9009;&#x9879;&#xFF0C;&#x7136;&#x540E;&#x6309;<code>Enter</code>&#x952E;&#x3002;</p>
<p><img src="img/1-3-1.jpg" alt=""></p>
<p>&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x8BE2;&#x95EE;&#x4F60;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#xFF0C;&#x6765;&#x5B9A;&#x4E49;&#x7CFB;&#x7EDF;&#x7684;&#x914D;&#x7F6E;&#x3002; &#x524D;&#x4E24;&#x4E2A;&#x9009;&#x9879;&#x8981;&#x6C42;&#x4F60;&#x6307;&#x5B9A;&#x60A8;&#x7684;&#x8BED;&#x8A00;&#x548C;&#x5C45;&#x4F4F;&#x56FD;&#x3002; &#x56DE;&#x7B54;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x540E;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4F60;&#x7684;&#x952E;&#x76D8;&#x5E03;&#x5C40;&#x914D;&#x7F6E;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-3-2.jpg" alt=""></p>
<p>&#x6709;&#x591A;&#x4E2A;&#x9009;&#x9879;&#x53EF;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x952E;&#x76D8;&#x5E03;&#x5C40;&#x3002; &#x4E00;&#x4E2A;&#x9009;&#x9879;&#x662F;&#x68C0;&#x6D4B;&#xFF0C;&#x5176;&#x4E2D;&#x7CFB;&#x7EDF;&#x4F1A;&#x63D0;&#x793A;&#x4F60;&#x6309;&#x4E00;&#x7CFB;&#x5217;&#x952E;&#xFF0C;&#x8FD9;&#x4F1A;&#x8BA9; Ubuntu &#x68C0;&#x6D4B;&#x4F60;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x952E;&#x76D8;&#x5E03;&#x5C40;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5355;&#x51FB;<code>Yes</code>&#x4F7F;&#x7528;&#x952E;&#x76D8;&#x68C0;&#x6D4B;&#x3002; &#x6216;&#x8005;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5355;&#x51FB;<code>No</code>&#x624B;&#x52A8;&#x9009;&#x62E9;&#x952E;&#x76D8;&#x5E03;&#x5C40;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x5C06;&#x6839;&#x636E;&#x4F60;&#x7684;&#x56FD;&#x5BB6;/&#x5730;&#x533A;&#x548C;&#x8BED;&#x8A00;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;&#x4F60;&#x505A;&#x51FA;&#x6700;&#x53EF;&#x80FD;&#x7684;&#x9009;&#x62E9;&#x3002; &#x5B9A;&#x4E49;&#x952E;&#x76D8;&#x5E03;&#x5C40;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8BF7;&#x6C42;&#x4F60;&#x8F93;&#x5165;&#x7CFB;&#x7EDF;&#x7684;&#x4E3B;&#x673A;&#x540D;&#x3002; &#x5982;&#x679C;&#x4F60;&#x8981;&#x5C06;&#x7CFB;&#x7EDF;&#x52A0;&#x5165;&#x57DF;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x4E3B;&#x673A;&#x540D;&#x662F;&#x552F;&#x4E00;&#x7684;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x8F93;&#x5165;&#x65B0;&#x7528;&#x6237;&#x548C;&#x7528;&#x6237;&#x540D;&#x7684;&#x5168;&#x540D;&#x3002; &#x4E0E;&#x7528;&#x6237;&#x7684;&#x5168;&#x540D;&#x4E0D;&#x540C;&#xFF0C;&#x7528;&#x6237;&#x540D;&#x5E94;&#x7531;&#x5355;&#x4E2A;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#x5B57;&#x7B26;&#x4E32;&#x7EC4;&#x6210;&#x3002; &#x6570;&#x5B57;&#x4E5F;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5728;&#x7528;&#x6237;&#x540D;&#x4E2D;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4E0D;&#x80FD;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x3002; &#x770B;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x622A;&#x56FE;&#xFF1A;</p>
<p><img src="img/1-3-3.jpg" alt=""></p>
<p>&#x5728;&#x4F60;&#x63D0;&#x4F9B;&#x65B0;&#x5E10;&#x6237;&#x7684;&#x7528;&#x6237;&#x540D;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x88AB;&#x8981;&#x6C42;&#x63D0;&#x4F9B;&#x5BC6;&#x7801;&#x3002; &#x786E;&#x4FDD;&#x4F60;&#x53EF;&#x4EE5;&#x8BB0;&#x4F4F;&#x5BC6;&#x7801;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x6B64;&#x7CFB;&#x7EDF;&#x6765;&#x4FEE;&#x6539;&#x914D;&#x7F6E;&#x3002; &#x770B;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x622A;&#x56FE;&#xFF1A;</p>
<p><img src="img/1-3-4.jpg" alt=""></p>
<p>&#x63D0;&#x4F9B;&#x5BC6;&#x7801;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x5E94;&#x52A0;&#x5BC6;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x4E3B;&#x76EE;&#x5F55;&#x3002; &#x867D;&#x7136;&#x8FD9;&#x63D0;&#x4F9B;&#x4E86;&#x989D;&#x5916;&#x7684;&#x5B89;&#x5168;&#x5C42;&#xFF0C;&#x4F46;&#x5728;&#x5B9E;&#x9A8C;&#x73AF;&#x5883;&#x4E2D;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x7CFB;&#x7EDF;&#x4E0D;&#x4F1A;&#x6301;&#x6709;&#x4EFB;&#x4F55;&#x771F;&#x5B9E;&#x7684;&#x654F;&#x611F;&#x6570;&#x636E;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x5728;&#x7CFB;&#x7EDF;&#x4E0A;&#x914D;&#x7F6E;&#x65F6;&#x949F;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-3-5.jpg" alt=""></p>
<p>&#x5373;&#x4F7F;&#x60A8;&#x7684;&#x7CFB;&#x7EDF;&#x4F4D;&#x4E8E;&#x5185;&#x90E8;IP&#x5730;&#x5740;&#x4E0A;&#xFF0C;&#x5B83;&#x4E5F;&#x4F1A;&#x5C1D;&#x8BD5;&#x786E;&#x5B9A;&#x8DEF;&#x7531;&#x7684;&#x516C;&#x5171;IP&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x6B64;&#x4FE1;&#x606F;&#x6765;&#x731C;&#x6D4B;&#x4F60;&#x7684;&#x65F6;&#x533A;&#x3002; &#x5982;&#x679C; Ubuntu &#x63D0;&#x4F9B;&#x7684;&#x731C;&#x6D4B;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x9009;&#x62E9;<code>Yes</code>; &#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x8BF7;&#x9009;&#x62E9;<code>No</code>&#x6765;&#x624B;&#x52A8;&#x9009;&#x62E9;&#x65F6;&#x533A;&#x3002; &#x9009;&#x62E9;&#x65F6;&#x533A;&#x540E;&#xFF0C;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x5B9A;&#x4E49;&#x78C1;&#x76D8;&#x5206;&#x533A;&#x914D;&#x7F6E;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-3-6.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F60;&#x4FDD;&#x7559;&#x9ED8;&#x8BA4;&#x3002; &#x4F60;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x5B89;&#x5168;&#x73AF;&#x5883;&#x4E2D;&#x6267;&#x884C;&#x4EFB;&#x4F55;&#x624B;&#x52A8;&#x5206;&#x533A;&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x901A;&#x5E38;&#x90FD;&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x4E13;&#x7528;&#x5206;&#x533A;&#x3002; &#x9009;&#x62E9;&#x5206;&#x533A;&#x65B9;&#x6CD5;&#x540E;&#xFF0C;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x9009;&#x62E9;&#x78C1;&#x76D8;&#x3002; &#x9664;&#x975E;&#x4F60;&#x5DF2;&#x5C06;&#x5176;&#x4ED6;&#x78C1;&#x76D8;&#x6DFB;&#x52A0;&#x5230;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x53EA;&#x5E94;&#x5728;&#x6B64;&#x5904;&#x770B;&#x5230;&#x4EE5;&#x4E0B;&#x9009;&#x9879;&#xFF1A;</p>
<p><img src="img/1-3-7.jpg" alt=""></p>
<p>&#x9009;&#x62E9;&#x78C1;&#x76D8;&#x540E;&#xFF0C;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x68C0;&#x67E5;&#x914D;&#x7F6E;&#x3002; &#x9A8C;&#x8BC1;&#x4E00;&#x5207;&#x662F;&#x5426;&#x6B63;&#x786E;&#xFF0C;&#x7136;&#x540E;&#x786E;&#x8BA4;&#x5B89;&#x88C5;&#x3002; &#x5728;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#x4E4B;&#x524D;&#xFF0C;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x914D;&#x7F6E;HTTP&#x4EE3;&#x7406;&#x3002; &#x51FA;&#x4E8E;&#x672C;&#x4E66;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5355;&#x72EC;&#x7684;&#x4EE3;&#x7406;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x6B64;&#x5B57;&#x6BB5;&#x7559;&#x7A7A;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x4F1A;&#x8BE2;&#x95EE;&#x4F60;&#x662F;&#x5426;&#x8981;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x5B89;&#x88C5;&#x4EFB;&#x4F55;&#x8F6F;&#x4EF6;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-3-8.jpg" alt=""></p>
<p>&#x8981;&#x9009;&#x62E9;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;&#x7A7A;&#x683C;&#x952E;&#x3002; &#x4E3A;&#x4E86;&#x589E;&#x52A0;&#x653B;&#x51FB;&#x9762;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x9009;&#x4E2D;&#x4E86;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#xFF0C;&#x4EC5;&#x6392;&#x9664;&#x4E86;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x548C;&#x989D;&#x5916;&#x7684;&#x624B;&#x52A8;&#x5305;&#x9009;&#x5ACC;&#x3002; &#x4E00;&#x65E6;&#x9009;&#x62E9;&#x4E86;&#x6240;&#x9700;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x8BF7;&#x6309;<code>Enter</code>&#x952E;&#x5B8C;&#x6210;&#x8BE5;&#x8FC7;&#x7A0B;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Ubuntu Server &#x6CA1;&#x6709; GUI&#xFF0C;&#x662F;&#x7279;&#x5730;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x9A71;&#x52A8;&#x3002; &#x4E3A;&#x4E86;&#x6709;&#x6548;&#x5730;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F60;&#x4F7F;&#x7528;SSH&#x3002; &#x4E3A;&#x4E86;&#x914D;&#x7F6E;&#x548C;&#x4F7F;&#x7528;SSH&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x672C;&#x8282;&#x540E;&#x9762;&#x7684;&#x201C;&#x914D;&#x7F6E;&#x548C;&#x4F7F;&#x7528;SSH&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h2 id="14-&#x5B89;&#x88C5;-metasploitable2">1.4 &#x5B89;&#x88C5; Metasploitable2</h2>
<p>Metasploitable2 &#x662F;&#x4E00;&#x4E2A;&#x6545;&#x610F;&#x5B58;&#x5728;&#x6F0F;&#x6D1E;&#x7684; Linux&#x53D1;&#x884C;&#x7248;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x9AD8;&#x6548;&#x7684;&#x5B89;&#x5168;&#x57F9;&#x8BAD;&#x5DE5;&#x5177;&#x3002;&#x5B83;&#x5145;&#x6EE1;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x6F0F;&#x6D1E;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x51E0;&#x4E2A;&#x6F0F;&#x6D1E; Web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x5728;&#x4F60;&#x7684;&#x865A;&#x62DF;&#x5B89;&#x5168;&#x5B9E;&#x9A8C;&#x5BA4;&#x4E2D;&#x5B89;&#x88C5; Metasploitable2 &#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x9996;&#x5148;&#x9700;&#x8981;&#x4ECE;Web&#x4E0B;&#x8F7D;&#x5B83;&#x3002;&#x6709;&#x8BB8;&#x591A;&#x53EF;&#x7528;&#x4E8E;&#x6B64;&#x7684;&#x955C;&#x50CF;&#x548C; torrent&#x3002;&#x83B7;&#x53D6; Metasploitable &#x7684;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x4ECE; SourceForge &#x7684; URL &#x4E0B;&#x8F7D;&#x5B83;&#xFF1A;<code>http://sourceforge.net/projects/metasploitable/files/Metasploitable2/</code>&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>Metasploitable2 &#x7684;&#x5B89;&#x88C5;&#x53EF;&#x80FD;&#x662F;&#x4F60;&#x5728;&#x5B89;&#x5168;&#x73AF;&#x5883;&#x4E2D;&#x6267;&#x884C;&#x7684;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5B89;&#x88C5;&#x4E4B;&#x4E00;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5F53;&#x4ECE; SourceForge &#x4E0B;&#x8F7D;&#x65F6;&#xFF0C;&#x5B83;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x4E86; VMware &#x865A;&#x62DF;&#x673A;&#x3002;&#x4E0B;&#x8F7D; ZIP &#x6587;&#x4EF6;&#x540E;&#xFF0C;&#x5728; Windows &#x6216; Mac OS X &#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728; Explorer &#x6216; Finder &#x4E2D;&#x53CC;&#x51FB;&#xFF0C;&#x5206;&#x522B;&#x8F7B;&#x677E;&#x63D0;&#x53D6;&#x6B64;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x770B;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x622A;&#x56FE;&#xFF1A;</p>
<p><img src="img/1-4-1.jpg" alt=""></p>
<p>&#x89E3;&#x538B;&#x7F29;&#x4E4B;&#x540E;&#xFF0C;ZIP &#x6587;&#x4EF6;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E94;&#x4E2A;&#x9644;&#x52A0;&#x6587;&#x4EF6;&#x3002; &#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x4E2D;&#x5305;&#x62EC; VMware VMX &#x6587;&#x4EF6;&#x3002; &#x8981;&#x5728; VMware &#x4E2D;&#x4F7F;&#x7528; Metasploitable&#xFF0C;&#x53EA;&#x9700;&#x5355;&#x51FB;<code>File</code>&#x4E0B;&#x62C9;&#x83DC;&#x5355;&#xFF0C;&#x7136;&#x540E;&#x5355;&#x51FB;<code>Open</code>&#x3002; &#x7136;&#x540E;&#xFF0C;&#x6D4F;&#x89C8;&#x7531;ZIP&#x63D0;&#x53D6;&#x8FC7;&#x7A0B;&#x521B;&#x5EFA;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x5E76;&#x6253;&#x5F00;<code>Metasploitable.vmx</code>&#xFF0C;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-4-2.jpg" alt=""></p>
<p>&#x4E00;&#x65E6;&#x6253;&#x5F00;&#x4E86; VMX &#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x5305;&#x542B;&#x5728;&#x4F60;&#x7684;&#x865A;&#x62DF;&#x673A;&#x5E93;&#x4E2D;&#x3002; &#x4ECE;&#x5E93;&#x4E2D;&#x9009;&#x62E9;&#x5B83;&#x5E76;&#x5355;&#x51FB;<code>Run</code>&#x6765;&#x542F;&#x52A8;VM&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4EE5;&#x4E0B;&#x754C;&#x9762;&#xFF1A;</p>
<p><img src="img/1-4-3.jpg" alt=""></p>
<p>VM&#x52A0;&#x8F7D;&#x540E;&#xFF0C;&#x4F1A;&#x663E;&#x793A;&#x542F;&#x52A8;&#x5C4F;&#x5E55;&#x5E76;&#x8BF7;&#x6C42;&#x767B;&#x5F55;&#x51ED;&#x636E;&#x3002; &#x9ED8;&#x8BA4;&#x767B;&#x5F55;&#x51ED;&#x8BC1;&#x7684;&#x7528;&#x6237;&#x540D;&#x548C;&#x5BC6;&#x7801;&#x662F;<code>msfadmin</code>&#x3002; &#x6B64;&#x673A;&#x5668;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;SSH&#x8BBF;&#x95EE;&#xFF0C;&#x5728;&#x672C;&#x8282;&#x540E;&#x9762;&#x7684;&#x201C;&#x914D;&#x7F6E;&#x548C;&#x4F7F;&#x7528;SSH&#x201D;&#x4E2D;&#x4F1A;&#x6D89;&#x53CA;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Metasploitable &#x4E3A;&#x5B89;&#x5168;&#x6D4B;&#x8BD5;&#x6559;&#x5B66;&#x7684;&#x76EE;&#x7684;&#x800C;&#x5EFA;&#x7ACB;&#x3002; &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x5FC5;&#x987B;&#x5C0F;&#x5FC3;&#x4F7F;&#x7528;&#x3002; Metasploitable &#x7CFB;&#x7EDF;&#x4E0D;&#x5E94;&#x8BE5;&#x66B4;&#x9732;&#x4E8E;&#x4EFB;&#x4F55;&#x4E0D;&#x53EF;&#x4FE1;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#x3002; &#x4E0D;&#x5E94;&#x8BE5;&#x4E3A;&#x5176;&#x5206;&#x914D;&#x516C;&#x5171;&#x53EF;&#x8BBF;&#x95EE;&#x7684;IP&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x5E94;&#x4F7F;&#x7528;&#x7AEF;&#x53E3;&#x8F6C;&#x53D1;&#x6765;&#x4F7F;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5730;&#x5740;&#x8F6C;&#x6362;&#xFF08;NAT&#xFF09;&#x63A5;&#x53E3;&#x8BBF;&#x95EE;&#x3002;</p>
<h2 id="15-&#x5B89;&#x88C5;-windows-server">1.5 &#x5B89;&#x88C5; Windows Server</h2>
<p>&#x5728;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x4E2D;&#x5B89;&#x88C5; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5BF9;&#x4E8E;&#x5B66;&#x4E60;&#x5B89;&#x5168;&#x6280;&#x80FD;&#x81F3;&#x5173;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x3002;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x573A;&#x666F;&#x4F7F;&#x7528; Windows XP SP2&#xFF08;Service Pack 2&#xFF09;&#x3002;&#x7531;&#x4E8E; Windows XP &#x662F;&#x8F83;&#x65E7;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x4E2D;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8BB8;&#x591A;&#x7F3A;&#x9677;&#x548C;&#x6F0F;&#x6D1E;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x8981;&#x5B8C;&#x6210;&#x672C;&#x6559;&#x7A0B;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x4EFB;&#x52A1;&#x548C;&#x672C;&#x4E66;&#x540E;&#x9762;&#x7684;&#x4E00;&#x4E9B;&#x7EC3;&#x4E60;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x83B7;&#x53D6; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x526F;&#x672C;&#x3002;&#x5982;&#x679C;&#x53EF;&#x80FD;&#xFF0C;&#x5E94;&#x8BE5;&#x4F7F;&#x7528; Windows XP SP2&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x5728;&#x7F16;&#x5199;&#x672C;&#x4E66;&#x65F6;&#x4F7F;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x9009;&#x62E9;&#x6B64;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x518D;&#x53D7;&#x5FAE;&#x8F6F;&#x652F;&#x6301;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x5730;&#x83B7;&#x53D6;&#xFF0C;&#x4EE5;&#x53CA;&#x6210;&#x672C;&#x5F88;&#x4F4E;&#x751A;&#x81F3;&#x65E0;&#x6210;&#x672C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x4E0D;&#x518D;&#x652F;&#x6301;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x4ECE;&#x7B2C;&#x4E09;&#x65B9;&#x4F9B;&#x5E94;&#x5546;&#x5904;&#x8D2D;&#x4E70;&#x6216;&#x901A;&#x8FC7;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#x83B7;&#x53D6;&#x3002;&#x8FD9;&#x4E2A;&#x4EA7;&#x54C1;&#x7684;&#x83B7;&#x5F97;&#x8FC7;&#x7A0B;&#x9760;&#x4F60;&#x6765;&#x5B8C;&#x6210;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4ECE; Windows XP &#x6620;&#x50CF;&#x6587;&#x4EF6;&#x542F;&#x52A8;&#x540E;&#xFF0C;&#x4F1A;&#x52A0;&#x8F7D;&#x4E00;&#x4E2A;&#x84DD;&#x8272;&#x83DC;&#x5355;&#x5C4F;&#x5E55;&#xFF0C;&#x5B83;&#x4F1A;&#x95EE;&#x4F60;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#xFF0C;&#x6765;&#x6307;&#x5BFC;&#x4F60;&#x5B8C;&#x6210;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x5B83;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x5B9A;&#x4E49;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5C06;&#x5B89;&#x88C5;&#x5230;&#x7684;&#x5206;&#x533A;&#x3002;&#x9664;&#x975E;&#x4F60;&#x5BF9;&#x865A;&#x62DF;&#x673A;&#x8FDB;&#x884C;&#x4E86;&#x81EA;&#x5B9A;&#x4E49;&#x66F4;&#x6539;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x53EA;&#x80FD;&#x5728;&#x6B64;&#x5904;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x9009;&#x9879;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5FEB;&#x901F;&#x6216;&#x5168;&#x78C1;&#x76D8;&#x683C;&#x5F0F;&#x3002;&#x4EFB;&#x4E00;&#x9009;&#x9879;&#x90FD;&#x5E94;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x865A;&#x62DF;&#x673A;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x56DE;&#x7B54;&#x4E86;&#x8FD9;&#x4E9B;&#x521D;&#x6B65;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x5C06;&#x6536;&#x5230;&#x6709;&#x5173;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x88AB;&#x5F15;&#x5BFC;&#x5230;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#xFF1A;</p>
<p><img src="img/1-5-1.jpg" alt=""></p>
<p>&#x9996;&#x5148;&#xFF0C;&#x4F60;&#x4F1A;&#x88AB;&#x8981;&#x6C42;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#x548C;&#x7EC4;&#x7EC7;&#x3002; &#x8BE5;&#x540D;&#x79F0;&#x5206;&#x914D;&#x7ED9;&#x5DF2;&#x521B;&#x5EFA;&#x7684;&#x521D;&#x59CB;&#x5E10;&#x6237;&#xFF0C;&#x4F46;&#x7EC4;&#x7EC7;&#x540D;&#x79F0;&#x4EC5;&#x4F5C;&#x4E3A;&#x5143;&#x6570;&#x636E;&#x800C;&#x5305;&#x542B;&#xFF0C;&#x5BF9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x6CA1;&#x6709;&#x5F71;&#x54CD;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x63D0;&#x4F9B;&#x8BA1;&#x7B97;&#x673A;&#x540D;&#x79F0;&#x548C;&#x7BA1;&#x7406;&#x5458;&#x5BC6;&#x7801;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-5-2.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x8981;&#x5C06;&#x7CFB;&#x7EDF;&#x6DFB;&#x52A0;&#x5230;&#x57DF;&#x4E2D;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F60;&#x4F7F;&#x7528;&#x552F;&#x4E00;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x540D;&#x79F0;&#x3002; &#x7BA1;&#x7406;&#x5458;&#x5BC6;&#x7801;&#x5E94;&#x8BE5;&#x662F;&#x4F60;&#x80FD;&#x591F;&#x8BB0;&#x4F4F;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x9700;&#x8981;&#x767B;&#x5F55;&#x5230;&#x6B64;&#x7CFB;&#x7EDF;&#x4EE5;&#x6D4B;&#x8BD5;&#x6216;&#x66F4;&#x6539;&#x914D;&#x7F6E;&#x3002; &#x7136;&#x540E;&#x5C06;&#x8981;&#x6C42;&#x4F60;&#x8BBE;&#x7F6E;&#x65E5;&#x671F;&#xFF0C;&#x65F6;&#x95F4;&#x548C;&#x65F6;&#x533A;&#x3002; &#x8FD9;&#x4E9B;&#x53EF;&#x80FD;&#x4F1A;&#x81EA;&#x52A8;&#x586B;&#x5145;&#xFF0C;&#x4F46;&#x786E;&#x4FDD;&#x5B83;&#x4EEC;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x9519;&#x8BEF;&#x914D;&#x7F6E;&#x65E5;&#x671F;&#x548C;&#x65F6;&#x95F4;&#x53EF;&#x80FD;&#x4F1A;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x3002; &#x770B;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x622A;&#x56FE;&#xFF1A;</p>
<p><img src="img/1-5-3.jpg" alt=""></p>
<p>&#x914D;&#x7F6E;&#x65F6;&#x95F4;&#x548C;&#x65E5;&#x671F;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x5C06;&#x7CFB;&#x7EDF;&#x5206;&#x914D;&#x5230;&#x5DE5;&#x4F5C;&#x7EC4;&#x6216;&#x57DF;&#x3002; &#x672C;&#x4E66;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x5927;&#x591A;&#x6570;&#x7EC3;&#x4E60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4E00;&#x914D;&#x7F6E;&#x6267;&#x884C;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x8FDC;&#x7A0B; SMB &#x5BA1;&#x8BA1;&#x4EFB;&#x52A1;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x7CFB;&#x7EDF;&#x52A0;&#x5165;&#x57DF;&#xFF0C;&#x8FD9;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x8BA8;&#x8BBA;&#x3002; &#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x663E;&#x793A;<code>Help Protect your PC</code>&#x7A97;&#x53E3;&#xFF1A;</p>
<p><img src="img/1-5-4.jpg" alt=""></p>
<p>&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x63D0;&#x793A;&#x4F60;&#x4F7F;&#x7528;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x4FDD;&#x62A4;&#x60A8;&#x7684;&#x7535;&#x8111;&#x3002; &#x9ED8;&#x8BA4;&#x9009;&#x62E9;&#x662F;&#x542F;&#x7528;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x589E;&#x52A0;&#x6211;&#x4EEC;&#x53EF;&#x7528;&#x7684;&#x6D4B;&#x8BD5;&#x673A;&#x4F1A;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x9009;&#x62E9;<code>Not right now</code>&#x9009;&#x9879;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Windows XP SP2 &#x5BF9;&#x4EFB;&#x4F55;&#x521D;&#x5B66;&#x8005;&#x7684;&#x5B89;&#x5168;&#x73AF;&#x5883;&#xFF0C;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x8865;&#x5145;&#x3002; &#x7531;&#x4E8E;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x8F83;&#x65E7;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x53EF;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#x548C;&#x5229;&#x7528;&#x7684;&#x6F0F;&#x6D1E;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x968F;&#x7740;&#x6E17;&#x900F;&#x6D4B;&#x8BD5;&#x9886;&#x57DF;&#x7684;&#x6280;&#x672F;&#x6C34;&#x5E73;&#x7684;&#x63D0;&#x9AD8;&#xFF0C;&#x5F00;&#x59CB;&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x66F4;&#x65B0;&#x548C;&#x66F4;&#x5B89;&#x5168;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF08;&#x5982;Windows 7&#xFF09;&#x6765;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x6280;&#x80FD;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<h2 id="16-&#x589E;&#x52A0;-windows-&#x7684;&#x653B;&#x51FB;&#x9762;">1.6 &#x589E;&#x52A0; Windows &#x7684;&#x653B;&#x51FB;&#x9762;</h2>
<p>&#x4E3A;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;Windows&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x53EF;&#x7528;&#x7684;&#x653B;&#x51FB;&#x9762;&#xFF0C;&#x6DFB;&#x52A0;&#x6613;&#x53D7;&#x653B;&#x51FB;&#x7684;&#x8F6F;&#x4EF6;&#x4EE5;&#x53CA;&#x542F;&#x7528;&#x6216;&#x7981;&#x7528;&#x67D0;&#x4E9B;&#x96C6;&#x6210;&#x7EC4;&#x4EF6;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x5728;&#x4FEE;&#x6539;Windows&#x4E2D;&#x7684;&#x914D;&#x7F6E;&#x6765;&#x589E;&#x52A0;&#x653B;&#x51FB;&#x9762;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5728;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x4E0A;&#x5B89;&#x88C5;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002; &#x5982;&#x679C;&#x5C1A;&#x672A;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x672C;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5;Windows Server&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x542F;&#x7528;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x672A;&#x6253;&#x8865;&#x4E01;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x5C06;&#x4E00;&#x4E9B;&#x6F0F;&#x6D1E;&#x5F15;&#x5165;&#x7CFB;&#x7EDF;&#x7684;&#x6709;&#x6548;&#x65B9;&#x6CD5;&#x3002; &#x9996;&#x5148;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5728;Windows&#x7CFB;&#x7EDF;&#x4E0A;&#x542F;&#x7528;&#x7B80;&#x5355;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x534F;&#x8BAE;&#xFF08;SNMP&#xFF09;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x8BF7;&#x6253;&#x5F00;&#x5DE6;&#x4E0B;&#x89D2;&#x7684;&#x5F00;&#x59CB;&#x83DC;&#x5355;&#xFF0C;&#x7136;&#x540E;&#x5355;&#x51FB;<code>Control Panel</code>&#xFF08;&#x63A7;&#x5236;&#x9762;&#x677F;&#xFF09;&#x3002; &#x53CC;&#x51FB;<code>Add or Remove Programs</code>&#xFF08;&#x6DFB;&#x52A0;&#x6216;&#x5220;&#x9664;&#x7A0B;&#x5E8F;&#xFF09;&#x56FE;&#x6807;&#xFF0C;&#x7136;&#x540E;&#x5355;&#x51FB;&#x5C4F;&#x5E55;&#x5DE6;&#x4FA7;&#x7684;<code>Add/Remove Windows Components</code>&#xFF08;&#x6DFB;&#x52A0;/&#x5220;&#x9664;Windows&#x7EC4;&#x4EF6;&#xFF09;&#x94FE;&#x63A5;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x4EE5;&#x4E0B;&#x754C;&#x9762;&#xFF1A;</p>
<p><img src="img/1-6-1.jpg" alt=""></p>
<p>&#x4ECE;&#x8FD9;&#x91CC;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x53EF;&#x4EE5;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x542F;&#x7528;&#x6216;&#x7981;&#x7528;&#x7684;&#x7EC4;&#x4EF6;&#x5217;&#x8868;&#x3002; &#x5411;&#x4E0B;&#x6EDA;&#x52A8;&#x5230;<code>Management and Monitoring Tools</code>&#xFF08;&#x7BA1;&#x7406;&#x548C;&#x76D1;&#x63A7;&#x5DE5;&#x5177;&#xFF09;&#xFF0C;&#x5E76;&#x53CC;&#x51FB;&#x5B83;&#x6765;&#x6253;&#x5F00;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x9009;&#x9879;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-6-2.jpg" alt=""></p>
<p>&#x6253;&#x5F00;&#x540E;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x9009;&#x4E2D; SNMP &#x548C; WMI SNMP Provider &#x7684;&#x590D;&#x9009;&#x6846;&#x3002; &#x8FD9;&#x5C06;&#x5141;&#x8BB8;&#x5728;&#x7CFB;&#x7EDF;&#x4E0A;&#x6267;&#x884C;&#x8FDC;&#x7A0B;SNMP&#x67E5;&#x8BE2;&#x3002; &#x5355;&#x51FB;&#x786E;&#x5B9A;&#x540E;&#xFF0C;&#x4F1A;&#x5F00;&#x59CB;&#x5B89;&#x88C5;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x3002; &#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x7684;&#x5B89;&#x88C5;&#x9700;&#x8981; Windows XP &#x6620;&#x50CF;&#x5149;&#x76D8;&#xFF0C;VMware &#x53EF;&#x80FD;&#x5728;&#x865A;&#x62DF;&#x673A;&#x6620;&#x50CF;&#x540E;&#x5220;&#x9664;&#x3002; &#x5982;&#x679C;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4F60;&#x4F1A;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x5F39;&#x51FA;&#x8BF7;&#x6C42;&#x8BA9;&#x4F60;&#x63D2;&#x5165;&#x5149;&#x76D8;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-6-3.jpg" alt=""></p>
<p>&#x4E3A;&#x6B64;&#xFF0C;&#x8BF7;&#x8BBF;&#x95EE;&#x865A;&#x62DF;&#x673A;&#x8BBE;&#x7F6E;&#x3002; &#x786E;&#x4FDD;&#x5DF2;&#x542F;&#x7528;&#x865A;&#x62DF;&#x5149;&#x9A71;&#xFF0C;&#x7136;&#x540E;&#x6D4F;&#x89C8;&#x4E3B;&#x673A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;ISO&#x6587;&#x4EF6;&#x6765;&#x6DFB;&#x52A0;&#x5149;&#x76D8;&#xFF1A;</p>
<p><img src="img/1-6-4.jpg" alt=""></p>
<p>&#x4E00;&#x65E6;&#x68C0;&#x6D4B;&#x5230;&#x5149;&#x76D8;&#xFF0C;SNMP&#x670D;&#x52A1;&#x7684;&#x5B89;&#x88C5;&#x4F1A;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x3002; <code>Windows Components Wizard</code>&#xFF08;Windows&#x7EC4;&#x4EF6;&#x5411;&#x5BFC;&#xFF09;&#x5E94;&#x5728;&#x5B89;&#x88C5;&#x5B8C;&#x6210;&#x65F6;&#x901A;&#x77E5;&#x4F60;&#x3002; &#x9664;&#x4E86;&#x6DFB;&#x52A0;&#x670D;&#x52A1;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x5E94;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x4E00;&#x4E9B;&#x9ED8;&#x8BA4;&#x670D;&#x52A1;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x8BF7;&#x518D;&#x6B21;&#x6253;&#x5F00;<code>Control Panel</code>&#xFF08;&#x63A7;&#x5236;&#x9762;&#x677F;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x53CC;&#x51FB;<code>Security Center</code>&#xFF08;&#x5B89;&#x5168;&#x4E2D;&#x5FC3;&#xFF09;&#x56FE;&#x6807;&#x3002; &#x6EDA;&#x52A8;&#x5230;&#x9875;&#x9762;&#x5E95;&#x90E8;&#xFF0C;&#x5355;&#x51FB;<code>Windows Firewall</code>&#xFF08;Windows&#x9632;&#x706B;&#x5899;&#xFF09;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x6B64;&#x529F;&#x80FD;&#x5DF2;&#x5173;&#x95ED;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-6-5.jpg" alt=""></p>
<p>&#x5173;&#x95ED;Windows&#x9632;&#x706B;&#x5899;&#x529F;&#x80FD;&#x540E;&#xFF0C;&#x5355;&#x51FB;<code>OK</code>&#x8FD4;&#x56DE;&#x4E0A;&#x4E00;&#x7EA7;&#x83DC;&#x5355;&#x3002; &#x518D;&#x6B21;&#x6EDA;&#x52A8;&#x5230;&#x5E95;&#x90E8;&#xFF0C;&#x7136;&#x540E;&#x5355;&#x51FB;<code>Automatic Updates</code>&#xFF08;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#xFF09;&#x94FE;&#x63A5;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x5B83;&#x4E5F;&#x5173;&#x95ED;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x542F;&#x7528;&#x529F;&#x80FD;&#x670D;&#x52A1;&#x548C;&#x7981;&#x7528;&#x5B89;&#x5168;&#x670D;&#x52A1;&#x5927;&#x5927;&#x589E;&#x52A0;&#x4E86;&#x6CC4;&#x5BC6;&#x7684;&#x98CE;&#x9669;&#x3002; &#x901A;&#x8FC7;&#x589E;&#x52A0;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x5B58;&#x5728;&#x7684;&#x6F0F;&#x6D1E;&#x6570;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x589E;&#x52A0;&#x4E86;&#x53EF;&#x7528;&#x4E8E;&#x5B66;&#x4E60;&#x653B;&#x51FB;&#x6A21;&#x5F0F;&#x548C;&#x5229;&#x7528;&#x7684;&#x673A;&#x4F1A;&#x7684;&#x6570;&#x91CF;&#x3002; &#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x79D8;&#x7C4D;&#x53EA;&#x6CE8;&#x91CD; Windows &#x4E2D;&#x96C6;&#x6210;&#x7EC4;&#x4EF6;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x6765;&#x589E;&#x52A0;&#x653B;&#x51FB;&#x9762;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x5B89;&#x88C5;&#x5404;&#x79CD;&#x5177;&#x6709;&#x5DF2;&#x77E5;&#x6F0F;&#x6D1E;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x8F6F;&#x4EF6;&#x5305;&#x4E5F;&#x5F88;&#x6709;&#x7528;&#x3002; &#x53EF;&#x4EE5;&#x5728;&#x4EE5;&#x4E0B; URL &#x4E2D;&#x627E;&#x5230;&#x6613;&#x53D7;&#x653B;&#x51FB;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#xFF1A;</p>
<ul>
<li><a href="http://www.exploit-db.com/" target="_blank">http://www.exploit-db.com/</a> </li>
<li><a href="http://www.oldversion.com/" target="_blank">http://www.oldversion.com/</a></li>
</ul>
<h2 id="17-&#x5B89;&#x88C5;-kali-linux">1.7 &#x5B89;&#x88C5; Kali Linux</h2>
<p>Kali Linux &#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x6E17;&#x900F;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#x5E93;&#xFF0C;&#x4E5F;&#x53EF;&#x7528;&#x4F5C;&#x8BB8;&#x591A;&#x626B;&#x63CF;&#x811A;&#x672C;&#x7684;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#xFF0C;&#x8FD9;&#x5C06;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x8BA8;&#x8BBA;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x5728;&#x4F60;&#x7684;&#x865A;&#x62DF;&#x5B89;&#x5168;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x4E2D;&#x5B89;&#x88C5; Kali Linux &#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4ECE;&#x53D7;&#x4FE1;&#x4EFB;&#x7684;&#x6765;&#x6E90;&#x83B7;&#x53D6; ISO &#x6587;&#x4EF6;&#xFF08;&#x6620;&#x50CF;&#x6587;&#x4EF6;&#xFF09;&#x3002; Kali Linux ISO &#x53EF;&#x4EE5;&#x4ECE;<code>http://www.kali.org/downloads/</code>&#x4E0B;&#x8F7D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4ECE; Kali Linux &#x6620;&#x50CF;&#x6587;&#x4EF6;&#x542F;&#x52A8;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x521D;&#x59CB;&#x542F;&#x52A8;&#x83DC;&#x5355;&#x3002; &#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x5411;&#x4E0B;&#x6EDA;&#x52A8;&#x5230;&#x7B2C;&#x56DB;&#x4E2A;&#x9009;&#x9879;&#xFF0C;<code>Install</code>&#xFF0C;&#x7136;&#x540E;&#x6309;<code>Enter</code>&#x952E;&#x5F00;&#x59CB;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img src="img/1-7-1.jpg" alt=""></p>
<p>&#x4E00;&#x65E6;&#x5F00;&#x59CB;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x5F15;&#x5BFC;&#x4F60;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#x5B8C;&#x6210;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#x3002; &#x6700;&#x521D;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x63D0;&#x4F9B;&#x4F60;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;&#x56FD;&#x5BB6;&#xFF09;&#x548C;&#x8BED;&#x8A00;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x9009;&#x9879;&#xFF0C;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x9009;&#x62E9;&#x952E;&#x76D8;&#x914D;&#x7F6E;&#x6216;&#x4F7F;&#x7528;&#x6307;&#x5BFC;&#x68C0;&#x6D4B;&#x8FC7;&#x7A0B;&#x3002; &#x4E0B;&#x4E00;&#x6B65;&#x56DE;&#x8BF7;&#x6C42;&#x4F60;&#x4E3A;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x4E3B;&#x673A;&#x540D;&#x3002; &#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x52A0;&#x5165;&#x57DF;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x4E3B;&#x673A;&#x540D;&#x662F;&#x552F;&#x4E00;&#x7684;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-7-2.jpg" alt=""></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8BBE;&#x7F6E; root &#x5E10;&#x6237;&#x7684;&#x5BC6;&#x7801;&#x3002; &#x5EFA;&#x8BAE;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x590D;&#x6742;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x4E0D;&#x4F1A;&#x8F7B;&#x6613;&#x653B;&#x7834;&#x3002; &#x770B;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x622A;&#x56FE;&#xFF1A;</p>
<p><img src="img/1-7-3.jpg" alt=""></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x63D0;&#x4F9B;&#x6240;&#x5728;&#x65F6;&#x533A;&#x3002;&#x7CFB;&#x7EDF;&#x5C06;&#x4F7F;&#x7528;IP&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x4F5C;&#x4E3A;&#x4F60;&#x7684;&#x4F4D;&#x7F6E;&#x7684;&#x6700;&#x4F73;&#x731C;&#x6D4B;&#x3002; &#x5982;&#x679C;&#x8FD9;&#x4E0D;&#x6B63;&#x786E;&#xFF0C;&#x8BF7;&#x624B;&#x52A8;&#x9009;&#x62E9;&#x6B63;&#x786E;&#x7684;&#x65F6;&#x533A;&#xFF1A;</p>
<p><img src="img/1-7-4.jpg" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x8BBE;&#x7F6E;&#x78C1;&#x76D8;&#x5206;&#x533A;&#xFF0C;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x65B9;&#x6CD5;&#x548C;&#x5206;&#x533A;&#x65B9;&#x6848;&#x5E94;&#x8DB3;&#x4EE5;&#x7528;&#x4E8E;&#x5B9E;&#x9A8C;&#x76EE;&#x7684;&#xFF1A;</p>
<p><img src="img/1-7-5.jpg" alt=""></p>
<p>&#x5EFA;&#x8BAE;&#x4F60;&#x4F7F;&#x7528;&#x955C;&#x50CF;&#x6765;&#x786E;&#x4FDD; Kali Linux &#x4E2D;&#x7684;&#x8F6F;&#x4EF6;&#x4FDD;&#x6301;&#x6700;&#x65B0;&#xFF1A;</p>
<p><img src="img/1-7-6.jpg" alt=""></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x63D0;&#x4F9B; HTTP &#x4EE3;&#x7406;&#x5730;&#x5740;&#x3002; &#x672C;&#x4E66;&#x4E2D;&#x6240;&#x8FF0;&#x7684;&#x4EFB;&#x4F55;&#x7EC3;&#x4E60;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x5916;&#x90E8; HTTP &#x4EE3;&#x7406;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x7559;&#x7A7A;&#xFF1A;</p>
<p><img src="img/1-7-7.jpg" alt=""></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x9009;&#x62E9;<code>Yes</code>&#x6765;&#x5B89;&#x88C5; GRUB &#x5F15;&#x5BFC;&#x52A0;&#x8F7D;&#x7A0B;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x6309;<code>Enter</code>&#x952E;&#x5B8C;&#x6210;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#x3002; &#x5F53;&#x7CFB;&#x7EDF;&#x52A0;&#x8F7D;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B89;&#x88C5;&#x671F;&#x95F4;&#x63D0;&#x4F9B;&#x7684; root &#x5E10;&#x6237;&#x548C;&#x5BC6;&#x7801;&#x767B;&#x5F55;&#xFF1A;</p>
<p><img src="img/1-7-8.jpg" alt=""></p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Kali Linux &#x662F;&#x4E00;&#x4E2A; Debian Linux &#x53D1;&#x884C;&#x7248;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x5927;&#x91CF;&#x9884;&#x5B89;&#x88C5;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x6E17;&#x900F;&#x5DE5;&#x5177;&#x3002; &#x867D;&#x7136;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x90FD;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x83B7;&#x53D6;&#x548C;&#x5B89;&#x88C5;&#xFF0C;Kali Linux &#x63D0;&#x4F9B;&#x7684;&#x7EC4;&#x7EC7;&#x548C;&#x5B9E;&#x73B0;&#x4F7F;&#x5176;&#x6210;&#x4E3A;&#x4EFB;&#x4F55;&#x6E17;&#x900F;&#x6D4B;&#x8BD5;&#x8005;&#x7684;&#x6709;&#x529B;&#x5DE5;&#x5177;&#x3002;</p>
<h2 id="18-&#x914D;&#x7F6E;&#x548C;&#x4F7F;&#x7528;-ssh">1.8 &#x914D;&#x7F6E;&#x548C;&#x4F7F;&#x7528; SSH</h2>
<p>&#x540C;&#x65F6;&#x5904;&#x7406;&#x591A;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x53EF;&#x80FD;&#x4F1A;&#x53D8;&#x5F97;&#x4E4F;&#x5473;&#xFF0C;&#x8017;&#x65F6;&#x548C;&#x4EE4;&#x4EBA;&#x6CAE;&#x4E27;&#x3002; &#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x4ECE;&#x4E00;&#x4E2A; VMware &#x5C4F;&#x5E55;&#x8DF3;&#x5230;&#x53E6;&#x4E00;&#x4E2A; VMware &#x5C4F;&#x5E55;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x5E76;&#x589E;&#x52A0;&#x865A;&#x62DF;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x4FBF;&#x5229;&#x6027;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x865A;&#x62DF;&#x7CFB;&#x7EDF;&#x4E0A;&#x914D;&#x7F6E;&#x548C;&#x542F;&#x7528;SSH&#x975E;&#x5E38;&#x6709;&#x5E2E;&#x52A9;&#x3002; &#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x8BA8;&#x8BBA;&#x4E86;&#x5982;&#x4F55;&#x5728;&#x6BCF;&#x4E2A; Linux &#x865A;&#x62DF;&#x673A;&#x4E0A;&#x4F7F;&#x7528; SSH&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E0A;&#x4F7F;&#x7528; SSH&#xFF0C;&#x5FC5;&#x987B;&#x5148;&#x5728;&#x4E3B;&#x673A;&#x7CFB;&#x7EDF;&#x4E0A;&#x5B89;&#x88C5; SSH &#x5BA2;&#x6237;&#x7AEF;&#x3002; SSH &#x5BA2;&#x6237;&#x7AEF;&#x96C6;&#x6210;&#x5230;&#x5927;&#x591A;&#x6570; Linux &#x548C; OS X &#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x4ECE;&#x7EC8;&#x7AEF;&#x63A5;&#x53E3;&#x8BBF;&#x95EE;&#x3002; &#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528; Windows&#x4E3B;&#x673A;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x4E0B;&#x8F7D;&#x5E76;&#x5B89;&#x88C5; Windows &#x7EC8;&#x7AEF;&#x670D;&#x52A1;&#x5BA2;&#x6237;&#x7AEF;&#x3002; &#x4E00;&#x4E2A;&#x514D;&#x8D39;&#x548C;&#x5BB9;&#x6613;&#x4F7F;&#x7528;&#x7684;&#x662F;PuTTY&#x3002; PuTTY&#x53EF;&#x4EE5;&#x4ECE;<code>http://www.putty.org/</code>&#x4E0B;&#x8F7D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4F60;&#x9996;&#x5148;&#x9700;&#x8981;&#x5728;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x4E2D;&#x76F4;&#x63A5;&#x4ECE;&#x7EC8;&#x7AEF;&#x542F;&#x7528; SSH&#x3002; &#x6B64;&#x547D;&#x4EE4;&#x9700;&#x8981;&#x5728;&#x865A;&#x62DF;&#x673A;&#x5BA2;&#x6237;&#x7AEF;&#x4E2D;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x3002; &#x9664;&#x4E86; Windows XP &#x865A;&#x62DF;&#x673A;&#xFF0C;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x865A;&#x62DF;&#x673A;&#x90FD;&#x662F; Linux &#x53D1;&#x884C;&#x7248;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x539F;&#x751F;&#x652F;&#x6301; SSH&#x3002; &#x542F;&#x7528;&#x6B64;&#x529F;&#x80FD;&#x7684;&#x6B65;&#x9AA4;&#x5728;&#x51E0;&#x4E4E;&#x6240;&#x6709; Linux &#x53D1;&#x884C;&#x7248;&#x4E2D;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-8-1.jpg" alt=""></p>
<p><code>/etc/init.d/ssh start</code>&#x547D;&#x4EE4;&#x53EF;&#x7528;&#x4E8E;&#x542F;&#x52A8;&#x670D;&#x52A1;&#x3002; &#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x4F7F;&#x7528;<code>root</code>&#x767B;&#x5F55;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5C06;<code>sudo</code>&#x9884;&#x7F6E;&#x5230;&#x6B64;&#x547D;&#x4EE4;&#x3002; &#x5982;&#x679C;&#x63A5;&#x6536;&#x5230;&#x9519;&#x8BEF;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x662F;&#x8BBE;&#x5907;&#x4E0A;&#x672A;&#x5B89;&#x88C5; SSH &#x5B88;&#x62A4;&#x7A0B;&#x5E8F;&#x3002; &#x5982;&#x679C;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6267;&#x884C;<code>apt-get install ssh</code>&#x547D;&#x4EE4;&#x53EF;&#x7528;&#x4E8E;&#x5B89;&#x88C5; SSH &#x5B88;&#x62A4;&#x7A0B;&#x5E8F;&#x3002; &#x7136;&#x540E;&#xFF0C;<code>ifconfig</code>&#x53EF;&#x7528;&#x4E8E;&#x83B7;&#x53D6;&#x7CFB;&#x7EDF;&#x7684;IP&#x5730;&#x5740;&#xFF0C;&#x8FD9;&#x5C06;&#x7528;&#x4E8E;&#x5EFA;&#x7ACB;SSH&#x8FDE;&#x63A5;&#x3002; &#x6FC0;&#x6D3B;&#x540E;&#xFF0C;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; SSH &#x4ECE;&#x4E3B;&#x673A;&#x7CFB;&#x7EDF;&#x8BBF;&#x95EE; VMware &#x5BA2;&#x6237;&#x7CFB;&#x7EDF;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x8BF7;&#x6700;&#x5C0F;&#x5316;&#x865A;&#x62DF;&#x673A;&#x5E76;&#x6253;&#x5F00;&#x4E3B;&#x673A;&#x7684; SSH &#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528; Mac OSX &#x6216; Linux &#x4F5C;&#x4E3A;&#x4E3B;&#x673A;&#x7CFB;&#x7EDF;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4ECE;&#x7EC8;&#x7AEF;&#x8C03;&#x7528;&#x5BA2;&#x6237;&#x7AEF;&#x3002; &#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728; Windows &#x4E3B;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7EC8;&#x7AEF;&#x6A21;&#x62DF;&#x5668;&#xFF0C;&#x5982;PuTTY&#x3002; &#x5728;&#x4EE5;&#x4E0B;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x63D0;&#x4F9B; Kali &#x865A;&#x62DF;&#x673A;&#x7684; IP &#x5730;&#x5740;&#x5EFA;&#x7ACB; SSH &#x4F1A;&#x8BDD;&#xFF1A;</p>
<pre><code>DEMOSYS:~ jhutchens$ ssh root@172.16.36.244 
The authenticity of host &apos;172.16.36.244 (172.16.36.244)&apos; can&apos;t be established. 
RSA key fingerprint is c7:13:ed:c4:71:4f:89:53:5b:ee:cf:1f:40:06:d9:11. 
Are you sure you want to continue connecting (yes/no)? yes 
Warning: Permanently added &apos;172.16.36.244&apos; (RSA) to the list of known hosts. 
root@172.16.36.244&apos;s password: 
Linux kali 3.7-trunk-686-pae #1 SMP Debian 3.7.2-0+kali5 i686

The programs included with the Kali GNU/Linux system are free software; the exact distribution terms for each program are described in the individual files in /usr/share/doc/*/copyright.

Kali GNU/Linux comes with ABSOLUTELY NO WARRANTY, to the extent permitted by applicable law. root@kali:~#
</code></pre><blockquote>
<p>&#x4E0B;&#x8F7D;&#x793A;&#x4F8B;&#x4EE3;&#x7801;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;<code>http://www.packtpub.com</code>&#x4E0B;&#x8F7D;&#x4F60;&#x4ECE;&#x5E10;&#x6237;&#x4E2D;&#x8D2D;&#x4E70;&#x7684;&#x6240;&#x6709;Packt&#x56FE;&#x4E66;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x6587;&#x4EF6;&#x3002; &#x5982;&#x679C;&#x4F60;&#x5728;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x8D2D;&#x4E70;&#x6B64;&#x4E66;&#xFF0C;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;<code>http&#xFF1A;//www.packtpub&#x3002; com / support</code>&#x5E76;&#x6CE8;&#x518C;&#xFF0C;&#x4EE5;&#x4F7F;&#x6587;&#x4EF6;&#x80FD;&#x591F;&#x76F4;&#x63A5;&#x53D1;&#x9001;&#x7ED9;&#x4F60;&#x3002;</p>
</blockquote>
<p>SSH&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x9002;&#x5F53;&#x7528;&#x6CD5;&#x662F;<code>ssh [user] @ [IP address]</code>&#x3002; &#x5728;&#x63D0;&#x4F9B;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;SSH &#x5C06;&#x4F7F;&#x7528;<code>root</code>&#x5E10;&#x6237;&#x8BBF;&#x95EE; Kali &#x7CFB;&#x7EDF;&#xFF08;&#x7531;&#x63D0;&#x4F9B;&#x7684; IP &#x5730;&#x5740;&#x6807;&#x8BC6;&#xFF09;&#x3002; &#x7531;&#x4E8E;&#x4E3B;&#x673A;&#x672A;&#x5305;&#x542B;&#x5728;&#x5DF2;&#x77E5;&#x4E3B;&#x673A;&#x5217;&#x8868;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x5C06;&#x9996;&#x6B21;&#x63D0;&#x793A;&#x4F60;&#x786E;&#x8BA4;&#x8FDE;&#x63A5;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x8BF7;&#x8F93;&#x5165;<code>yes</code>&#x3002; &#x7136;&#x540E;&#x4F1A;&#x63D0;&#x793A;&#x4F60;&#x8F93;&#x5165;<code>root</code>&#x5E10;&#x6237;&#x7684;&#x5BC6;&#x7801;&#x3002; &#x8F93;&#x5165;&#x540E;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FDC;&#x7A0B;shell&#x8BBF;&#x95EE;&#x7CFB;&#x7EDF;&#x3002; &#x76F8;&#x540C;&#x7684;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x5728;Windows&#x4E2D;&#x4F7F;&#x7528;PuTTY&#x5B8C;&#x6210;&#x3002; &#x5B83;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x672C;&#x79D8;&#x7C4D;&#x7684;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#x90E8;&#x5206;&#x63D0;&#x4F9B;&#x7684;&#x94FE;&#x63A5;&#x4E0B;&#x8F7D;&#x3002; &#x4E0B;&#x8F7D;&#x540E;&#xFF0C;&#x6253;&#x5F00;PuTTY&#x5E76;&#x5728;&#x201C;&#x4E3B;&#x673A;&#x540D;&#x201D;&#x5B57;&#x6BB5;&#x4E2D;&#x8F93;&#x5165;&#x865A;&#x62DF;&#x673A;&#x7684;IP&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x786E;&#x4FDD; SSH &#x5355;&#x9009;&#x6309;&#x94AE;&#x9009;&#x4E2D;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-8-2.jpg" alt=""></p>
<p>&#x4E00;&#x65E6;&#x8BBE;&#x7F6E;&#x4E86;&#x8FDE;&#x63A5;&#x914D;&#x7F6E;&#xFF0C;&#x5355;&#x51FB;<code>Open</code>&#x6309;&#x94AE;&#x542F;&#x52A8;&#x4F1A;&#x8BDD;&#x3002; &#x7CFB;&#x7EDF;&#x4F1A;&#x63D0;&#x793A;&#x6211;&#x4EEC;&#x8F93;&#x5165;&#x7528;&#x6237;&#x540D;&#x548C;&#x5BC6;&#x7801;&#x3002; &#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x8F93;&#x5165;&#x6211;&#x4EEC;&#x8FDE;&#x63A5;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x51ED;&#x636E;&#x3002; &#x4E00;&#x65E6;&#x8BA4;&#x8BC1;&#x8FC7;&#x7A0B;&#x5B8C;&#x6210;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x88AB;&#x8FDC;&#x7A0B;&#x7EC8;&#x7AEF;&#x6388;&#x4E88;&#x7CFB;&#x7EDF;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-8-3.jpg" alt=""></p>
<p>&#x901A;&#x8FC7;&#x5C06;&#x516C;&#x94A5;&#x63D0;&#x4F9B;&#x7ED9;&#x8FDC;&#x7A0B;&#x4E3B;&#x673A;&#x4E0A;&#x7684;<code>authorized_keys</code>&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x6BCF;&#x6B21;&#x90FD;&#x8FDB;&#x884C;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#x3002; &#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x7684;&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>root@kali:~# ls .ssh 
ls: cannot access .ssh: No such file or directory 
root@kali:~# mkdir .ssh 
root@kali:~# cd .ssh/ r
oot@kali:~/.ssh# nano authorized_keys
</code></pre><p>&#x9996;&#x5148;&#xFF0C;&#x786E;&#x4FDD;<code>.ssh</code>&#x9690;&#x85CF;&#x76EE;&#x5F55;&#x5DF2;&#x5B58;&#x5728;&#x4E8E;&#x6839;&#x76EE;&#x5F55;&#x4E2D;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x8BF7;&#x4EE5;&#x76EE;&#x5F55;&#x540D;&#x79F0;&#x4F7F;&#x7528;<code>ls</code>&#x3002; &#x5982;&#x679C;&#x5B83;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;<code>mkdir</code>&#x521B;&#x5EFA;&#x76EE;&#x5F55;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x4F7F;&#x7528;<code>cd</code>&#x547D;&#x4EE4;&#x5C06;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x66F4;&#x6539;&#x4E3A;&#x8BE5;&#x76EE;&#x5F55;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x4F7F;&#x7528;Nano&#x6216;VIM&#x521B;&#x5EFA;&#x540D;&#x4E3A;<code>authorized_keys</code>&#x7684;&#x6587;&#x4EF6;&#x3002; &#x5982;&#x679C;&#x4F60;&#x4E0D;&#x719F;&#x6089;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x672C;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF08;VIM&#x548C;Nano&#xFF09;&#x201D;&#x79D8;&#x7C4D;&#x3002; &#x5728;&#x6B64;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x7C98;&#x8D34;SSH&#x5BA2;&#x6237;&#x7AEF;&#x4F7F;&#x7528;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>DEMOSYS:~ jhutchens$ ssh root@172.16.36.244 
Linux kali 3.7-trunk-686-pae #1 SMP Debian 3.7.2-0+kali5 i686

The programs included with the Kali GNU/Linux system are free software; the exact distribution terms for each program are described in the individual files in /usr/share/doc/*/copyright.

Kali GNU/Linux comes with ABSOLUTELY NO WARRANTY, to the extent permitted by applicable law. 
Last login: Sat May 10 22:38:31 2014 from 172.16.36.1 
root@kali:~#
</code></pre><p>&#x4E00;&#x65E6;&#x64CD;&#x4F5C;&#x5B8C;&#x6BD5;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x8FDE;&#x63A5;&#x5230;SSH&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x63D0;&#x4F9B;&#x9A8C;&#x8BC1;&#x7684;&#x5BC6;&#x7801;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>SSH&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x52A0;&#x5BC6;&#x7684;&#x901A;&#x4FE1;&#x901A;&#x9053;&#x3002; &#x6B64;&#x901A;&#x9053;&#x53EF;&#x7528;&#x4E8E;&#x63D0;&#x4F9B;&#x8FDC;&#x7A0B;&#x7BA1;&#x7406;&#x670D;&#x52A1;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5B89;&#x5168;&#x590D;&#x5236;&#xFF08;SCP&#xFF09;&#x5B89;&#x5168;&#x5730;&#x4F20;&#x8F93;&#x6587;&#x4EF6;&#x3002;</p>
<h2 id="19-&#x5728;-kali-&#x4E0A;&#x5B89;&#x88C5;-nessus">1.9 &#x5728; Kali &#x4E0A;&#x5B89;&#x88C5; Nessus</h2>
<p>Nessus&#x662F;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x7684;&#x6F0F;&#x6D1E;&#x626B;&#x63CF;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x5B89;&#x88C5;&#x5728;Kali Linux&#x5E73;&#x53F0;&#x4E0A;&#x3002;&#x8BE5;&#x79D8;&#x7C4D;&#x8BA8;&#x8BBA;&#x4E86;&#x5B89;&#x88C5;&#xFF0C;&#x542F;&#x52A8;&#x548C;&#x6FC0;&#x6D3B;Nessus&#x670D;&#x52A1;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x5728;&#x5C1D;&#x8BD5;&#x5728; Kali Linux &#x4E2D;&#x5B89;&#x88C5;Nessus&#x6F0F;&#x6D1E;&#x626B;&#x63CF;&#x7A0B;&#x5E8F;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x6FC0;&#x6D3B;&#x4EE3;&#x7801;&#x3002;&#x6B64;&#x6FC0;&#x6D3B;&#x4EE3;&#x7801;&#x662F;&#x83B7;&#x53D6;&#x5BA1;&#x8BA1;&#x63D2;&#x4EF6;&#x6240;&#x5FC5;&#x9700;&#x7684;&#xFF0C;Nessus&#x7528;&#x5B83;&#x6765;&#x8BC4;&#x4F30;&#x8054;&#x7F51;&#x7CFB;&#x7EDF;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6253;&#x7B97;&#x5728;&#x5BB6;&#x91CC;&#x6216;&#x8005;&#x5728;&#x4F60;&#x7684;&#x5B9E;&#x9A8C;&#x5BA4;&#x4E2D;&#x4F7F;&#x7528;Nessus&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x514D;&#x8D39;&#x83B7;&#x5F97;&#x5BB6;&#x5EAD;&#x7248;&#x5BC6;&#x94A5;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8981;&#x4F7F;&#x7528;Nessus&#x5BA1;&#x8BA1;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x4E13;&#x4E1A;&#x7248;&#x5BC6;&#x94A5;&#x3002;&#x5728;&#x4EFB;&#x4E00;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x90FD;&#x53EF;&#x4EE5;&#x5728;<code>http&#xFF1A;// www. tenable.com/products/nessus/nessus-plugins/obtain-an-activation-code</code>&#x83B7;&#x53D6;&#x6B64;&#x6FC0;&#x6D3B;&#x7801;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E00;&#x65E6;&#x4F60;&#x83B7;&#x5F97;&#x4E86;&#x4F60;&#x7684;&#x6FC0;&#x6D3B;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x5C06;&#x9700;&#x8981;&#x5728;<code>http://www.tenable.com/products/nessus/ select-your-operating-system</code>&#x4E0B;&#x8F7D;Nessus&#x5B89;&#x88C5;&#x5305;&#x3002;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x663E;&#x793A;&#x4E86;Nessus&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x7684;&#x5404;&#x79CD;&#x5E73;&#x53F0;&#x53CA;&#x5176;&#x76F8;&#x5E94;&#x7684;&#x5B89;&#x88C5;&#x5305;&#x7684;&#x5217;&#x8868;&#xFF1A;</p>
<p><img src="img/1-9-1.jpg" alt=""></p>
<p>&#x4E3A;&#x5DF2;&#x5B89;&#x88C5;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x9009;&#x62E9;&#x9002;&#x5F53;&#x7684;&#x5B89;&#x88C5;&#x5305;&#x3002; &#x4E00;&#x65E6;&#x4F60;&#x9009;&#x62E9;&#x5B83;&#xFF0C;&#x9605;&#x8BFB;&#x5E76;&#x540C;&#x610F;Tenable&#x63D0;&#x4F9B;&#x7684;&#x8BA2;&#x9605;&#x534F;&#x8BAE;&#x3002; &#x7136;&#x540E;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x5C06;&#x4E0B;&#x8F7D;&#x5B89;&#x88C5;&#x5305;&#x3002; &#x5355;&#x51FB;&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x6D4F;&#x89C8;&#x8981;&#x4FDD;&#x5B58;&#x5230;&#x7684;&#x4F4D;&#x7F6E;&#xFF1A;</p>
<p><img src="img/1-9-2.jpg" alt=""></p>
<p>&#x5728;&#x63D0;&#x4F9B;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6211;&#x5DF2;&#x5C06;&#x5B89;&#x88C5;&#x7A0B;&#x5E8F;&#x5305;&#x4FDD;&#x5B58;&#x5230;&#x6839;&#x76EE;&#x5F55;&#x3002; &#x4E0B;&#x8F7D;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x547D;&#x4EE4;&#x884C;&#x5B8C;&#x6210;&#x5B89;&#x88C5;&#x3002; &#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; SSH &#x6216;&#x901A;&#x8FC7;&#x56FE;&#x5F62;&#x684C;&#x9762;&#x4E0A;&#x7684;&#x7EC8;&#x7AEF;&#x4EE5;&#x4E0B;&#x5217;&#x65B9;&#x5F0F;&#x5B8C;&#x6210;&#xFF1A;</p>
<pre><code>root@kali:~# ls 
Desktop  Nessus-5.2.6-debian6_i386.deb 
root@kali:~# dpkg -i Nessus-5.2.6-debian6_i386.deb 
Selecting previously unselected package nessus. 
(Reading database ... 231224 files and directories currently installed.) 
Unpacking nessus 
(from Nessus-5.2.6-debian6_i386.deb) ... 
Setting up nessus (5.2.6) ... 
nessusd (Nessus) 5.2.6 [build N25116] for Linux 
Copyright (C) 1998 - 2014 Tenable Network Security, Inc

Processing the Nessus plugins... [##################################################]

All plugins loaded

  - You can start nessusd by typing /etc/init.d/nessusd start 
  - Then go to https://kali:8834/ to configure your scanner

root@kali:~# /etc/init.d/nessusd start 
$Starting Nessus : .
</code></pre><p>&#x4F7F;&#x7528;<code>ls</code>&#x547D;&#x4EE4;&#x9A8C;&#x8BC1;&#x5B89;&#x88C5;&#x5305;&#x662F;&#x5426;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E2D;&#x3002; &#x4F60;&#x5E94;&#x8BE5;&#x4F1A;&#x5728;&#x54CD;&#x5E94;&#x4E2D;&#x770B;&#x5230;&#x5B83;&#x3002; &#x7136;&#x540E;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Debian&#x8F6F;&#x4EF6;&#x5305;&#x7BA1;&#x7406;&#x5668;&#xFF08;<code>dpkg</code>&#xFF09;&#x5DE5;&#x5177;&#x5B89;&#x88C5;&#x670D;&#x52A1;&#x3002; <code>-i</code>&#x53C2;&#x6570;&#x544A;&#x8BC9;&#x8F6F;&#x4EF6;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x5B89;&#x88C5;&#x6307;&#x5B9A;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x3002; &#x5B89;&#x88C5;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x547D;&#x4EE4;<code>/etc/init.d/nessusd start</code>&#x542F;&#x52A8;&#x670D;&#x52A1;&#x3002; Nessus&#x5B8C;&#x5168;&#x4ECE;Web&#x754C;&#x9762;&#x8FD0;&#x884C;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x5176;&#x4ED6;&#x673A;&#x5668;&#x8F7B;&#x677E;&#x8BBF;&#x95EE;&#x3002; &#x5982;&#x679C;&#x4F60;&#x60F3;&#x4ECE;Kali&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;Nessus&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x6D4F;&#x89C8;&#x5668;&#x8BBF;&#x95EE;&#x5B83;&#xFF1A;<code>https&#xFF1A;//127.0.0.1:8834/</code>&#x3002; &#x6216;&#x8005;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;Web&#x6D4F;&#x89C8;&#x5668;&#x4F7F;&#x7528;Kali Linux&#x865A;&#x62DF;&#x673A;&#x7684;IP&#x5730;&#x5740;&#x4ECE;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#xFF08;&#x5982;&#x4E3B;&#x673A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF09;&#x8BBF;&#x95EE;&#x5B83;&#x3002; &#x5728;&#x63D0;&#x4F9B;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x4ECE;&#x4E3B;&#x673A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BBF;&#x95EE;Nessus&#x670D;&#x52A1;&#x7684;&#x54CD;&#x5E94;URL&#x662F;<code>https://172.16.36.244:8834</code>&#xFF1A;</p>
<p><img src="img/1-9-3.jpg" alt=""></p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Nessus&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x81EA;&#x7B7E;&#x540D;SSL&#x8BC1;&#x4E66;&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x5C06;&#x6536;&#x5230;&#x4E0D;&#x53D7;&#x4FE1;&#x4EFB;&#x7684;&#x8FDE;&#x63A5;&#x8B66;&#x544A;&#x3002; &#x5BF9;&#x4E8E;&#x5B89;&#x5168;&#x5B9E;&#x9A8C;&#x5BA4;&#x4F7F;&#x7528;&#x76EE;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x6B64;&#x8B66;&#x544A;&#x5E76;&#x7EE7;&#x7EED;&#x3002; &#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C55;&#x5F00;<code>I Understand the Risks</code>&#x9009;&#x9879;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-9-4.jpg" alt=""></p>
<p>&#x5F53;&#x4F60;&#x5C55;&#x5F00;&#x4E86;&#x6B64;&#x9009;&#x9879;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5355;&#x51FB;<code>Add Exception</code>&#x6309;&#x94AE;&#x3002; &#x8FD9;&#x4F1A;&#x9632;&#x6B62;&#x6BCF;&#x6B21;&#x5C1D;&#x8BD5;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x65F6;&#x90FD;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x6B64;&#x8B66;&#x544A;&#x3002; &#x5C06;&#x670D;&#x52A1;&#x4F5C;&#x4E3A;&#x4F8B;&#x5916;&#x6DFB;&#x52A0;&#x540E;&#xFF0C;&#x4F60;&#x5C06;&#x770B;&#x5230;&#x6B22;&#x8FCE;&#x5C4F;&#x5E55;&#x3002; &#x4ECE;&#x8FD9;&#x91CC;&#xFF0C;&#x70B9;&#x51FB;<code>Get Started</code>&#x6309;&#x94AE;&#x3002; &#x8FD9;&#x4F1A;&#x5C06;&#x4F60;&#x5E26;&#x5230;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#xFF1A;</p>
<p><img src="img/1-9-5.jpg" alt=""></p>
<p>&#x5FC5;&#x987B;&#x8BBE;&#x7F6E;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x662F;&#x7BA1;&#x7406;&#x5458;&#x7684;&#x7528;&#x6237;&#x5E10;&#x6237;&#x548C;&#x5173;&#x8054;&#x7684;&#x5BC6;&#x7801;&#x3002; &#x8FD9;&#x4E9B;&#x51ED;&#x636E;&#x4F1A;&#x7528;&#x4E8E;&#x767B;&#x5F55;&#x548C;&#x4F7F;&#x7528;Nessus&#x670D;&#x52A1;&#x3002; &#x8F93;&#x5165;&#x65B0;&#x7684;&#x7528;&#x6237;&#x540D;&#x548C;&#x5BC6;&#x7801;&#x540E;&#xFF0C;&#x5355;&#x51FB;<code>Next</code>&#x7EE7;&#x7EED;; &#x60A8;&#x4F1A;&#x770B;&#x5230;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#xFF1A;</p>
<p><img src="img/1-9-6.jpg" alt=""></p>
<p>&#x7136;&#x540E;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8F93;&#x5165;&#x6FC0;&#x6D3B;&#x4EE3;&#x7801;&#x3002; &#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x6FC0;&#x6D3B;&#x7801;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x672C;&#x79D8;&#x7C4D;&#x7684;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#x90E8;&#x5206;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x8F93;&#x5165;&#x6FC0;&#x6D3B;&#x7801;&#x540E;&#xFF0C;&#x4F60;&#x4F1A;&#x8FD4;&#x56DE;&#x5230;&#x767B;&#x5F55;&#x9875;&#x9762;&#xFF0C;&#x5E76;&#x8981;&#x6C42;&#x8F93;&#x5165;&#x4F60;&#x7684;&#x7528;&#x6237;&#x540D;&#x548C;&#x5BC6;&#x7801;&#x3002; &#x5728;&#x6B64;&#x5904;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8F93;&#x5165;&#x5728;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#x4E2D;&#x521B;&#x5EFA;&#x7684;&#x76F8;&#x540C;&#x51ED;&#x636E;&#x3002; &#x4EE5;&#x4E0B;&#x662F;&#x4E4B;&#x540E;&#x6BCF;&#x6B21;&#x8BBF;&#x95EE;URL&#x65F6;&#xFF0C;Nessus &#x4F1A;&#x52A0;&#x8F7D;&#x7684;&#x9ED8;&#x8BA4;&#x5C4F;&#x5E55;&#xFF1A;</p>
<p><img src="img/1-9-7.jpg" alt=""></p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x6B63;&#x786E;&#x5B89;&#x88C5;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x4E3B;&#x673A;&#x7CFB;&#x7EDF;&#x548C;&#x5B89;&#x88C5;&#x4E86;&#x56FE;&#x5F62;Web&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x6240;&#x6709;&#x865A;&#x62DF;&#x673A;&#x8BBF;&#x95EE;Nessus&#x6F0F;&#x6D1E;&#x626B;&#x63CF;&#x7A0B;&#x5E8F;&#x3002; &#x8FD9;&#x662F;&#x56E0;&#x4E3A;Nessus&#x670D;&#x52A1;&#x6258;&#x7BA1;&#x5728;TCP&#x7AEF;&#x53E3;8834&#x4E0A;&#xFF0C;&#x5E76;&#x4E14;&#x4E3B;&#x673A;&#x548C;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x865A;&#x62DF;&#x7CFB;&#x7EDF;&#x62E5;&#x6709;&#x4F4D;&#x4E8E;&#x76F8;&#x540C;&#x79C1;&#x6709;IP&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x7F51;&#x7EDC;&#x63A5;&#x53E3;&#x3002;</p>
<h2 id="110-&#x5728;-kali-&#x4E0A;&#x914D;&#x7F6E;-burp-suite">1.10 &#x5728; Kali &#x4E0A;&#x914D;&#x7F6E; Burp Suite</h2>
<p>Burp Suite Proxy&#x662F;&#x5B9E;&#x7528;&#x800C;&#x5F3A;&#x5927;&#x7684; Web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BA1;&#x8BA1;&#x5DE5;&#x5177;&#x4E4B;&#x4E00;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x5355;&#x51FB;&#x6765;&#x542F;&#x52A8;&#x7684;&#x5DE5;&#x5177;&#x3002; &#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4FEE;&#x6539;Burp Suite &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x76F8;&#x5173; Web &#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x914D;&#x7F6E;&#x4E0E;&#x5176;&#x4ED6;&#x8BBE;&#x5907;&#x6B63;&#x786E;&#x901A;&#x4FE1;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x5728; Kali Linux &#x4E2D;&#x9996;&#x6B21;&#x542F;&#x52A8; Burp Suite &#x4E0D;&#x9700;&#x8981;&#x505A;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x3002; &#x514D;&#x8D39;&#x7248;&#x662F;&#x4E00;&#x4E2A;&#x96C6;&#x6210;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x5DF2;&#x7ECF;&#x5B89;&#x88C5;&#x4E86;&#x3002; &#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x4E13;&#x4E1A;&#x7248;&#x672C;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;<code>https://pro.portswigger.net/buy/</code>&#x8D2D;&#x4E70;&#x8BB8;&#x53EF;&#x8BC1;&#x3002; &#x8BB8;&#x53EF;&#x8BC1;&#x76F8;&#x5BF9;&#x4FBF;&#x5B9C;&#xFF0C;&#x5BF9;&#x4E8E;&#x989D;&#x5916;&#x7684;&#x529F;&#x80FD;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x514D;&#x8D39;&#x7248;&#x4ECD;&#x7136;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x4E3A;&#x7528;&#x6237;&#x514D;&#x8D39;&#x63D0;&#x4F9B;&#x5927;&#x591A;&#x6570;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>Burp Suite &#x662F;&#x4E00;&#x4E2A; GUI &#x5DE5;&#x5177;&#xFF0C;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x56FE;&#x5F62;&#x684C;&#x9762;&#x624D;&#x80FD;&#x8FD0;&#x884C;&#x3002; &#x56E0;&#x6B64;&#xFF0C;Burp Suite &#x4E0D;&#x80FD;&#x901A;&#x8FC7; SSH &#x4F7F;&#x7528;&#x3002; &#x5728; Kali Linux &#x4E2D;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x542F;&#x52A8; Burp Suite&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x5728;<code>Applications</code>&#x83DC;&#x5355;&#x4E2D;&#x6D4F;&#x89C8;<code>Applications | Kali Linux | Top 10 Security Tools | burpsuite</code>&#x3002; &#x6216;&#x8005;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C06;&#x5176;&#x4F20;&#x7ED9; bash &#x7EC8;&#x7AEF;&#x4E2D;&#x7684; Java &#x89E3;&#x91CA;&#x5668;&#x6765;&#x6267;&#x884C;&#x5B83;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>root@kali:~# java -jar /usr/bin/burpsuite.jar
</code></pre><p>&#x52A0;&#x8F7D; Burp Suite &#x540E;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x4EE3;&#x7406;&#x76D1;&#x542C;&#x5668;&#x5904;&#x4E8E;&#x6D3B;&#x52A8;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x5728;&#x6240;&#x9700;&#x7684;&#x7AEF;&#x53E3;&#x4E0A;&#x8FD0;&#x884C;&#x3002; &#x63D0;&#x4F9B;&#x7684;&#x793A;&#x4F8B;&#x4F7F;&#x7528; TCP &#x7AEF;&#x53E3; 8080&#x3002; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9009;&#x62E9;<code>Proxy</code>&#x9009;&#x9879;&#x5361;&#xFF0C;&#x7136;&#x540E;&#x9009;&#x62E9;&#x4E0B;&#x9762;&#x7684;<code>Options</code>&#x9009;&#x9879;&#x5361;&#x6765;&#x9A8C;&#x8BC1;&#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-10-1.jpg" alt=""></p>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x6240;&#x6709;&#x4EE3;&#x7406;&#x76D1;&#x542C;&#x5668;&#x7684;&#x5217;&#x8868;&#x3002; &#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x8BF7;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x3002; &#x8981;&#x4E0E; Kali Linux &#x4E2D;&#x7684; IceWeasel Web &#x6D4F;&#x89C8;&#x5668;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x8BF7;&#x5C06;&#x76D1;&#x542C;&#x5668;&#x914D;&#x7F6E;&#x4E3A;&#x4FA6;&#x542C;<code>127.0.0.1</code>&#x5730;&#x5740;&#x4E0A;&#x7684;&#x7279;&#x5B9A;&#x7AEF;&#x53E3;&#x3002; &#x6B64;&#x5916;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x6FC0;&#x6D3B;<code>Running</code>&#x590D;&#x9009;&#x6846;&#x3002; &#x5728;Burp Suite &#x4E2D;&#x914D;&#x7F6E;&#x76D1;&#x542C;&#x5668;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4FEE;&#x6539; IceWeasel &#x6D4F;&#x89C8;&#x5668;&#x914D;&#x7F6E;&#x6765;&#x901A;&#x8FC7;&#x4EE3;&#x7406;&#x8F6C;&#x53D1;&#x6D41;&#x91CF;&#x3002; &#x4E3A;&#x6B64;&#xFF0C;&#x8BF7;&#x901A;&#x8FC7;&#x5355;&#x51FB;&#x5C4F;&#x5E55;&#x9876;&#x90E8;&#x7684;<code>weasel globe</code>&#x56FE;&#x6807;&#x6253;&#x5F00; IceWeasel&#x3002; &#x6253;&#x5F00;&#x540E;&#xFF0C;&#x5C55;&#x5F00;<code>Edit</code>&#x4E0B;&#x62C9;&#x83DC;&#x5355;&#xFF0C;&#x7136;&#x540E;&#x5355;&#x51FB;<code>Preferences</code>&#x4EE5;&#x83B7;&#x53D6;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#xFF1A;</p>
<p><img src="img/1-10-2.jpg" alt=""></p>
<p>&#x5728; IceWeasel &#x9996;&#x9009;&#x9879;&#x83DC;&#x5355;&#x4E2D;&#xFF0C;&#x5355;&#x51FB;&#x9876;&#x90E8;&#x7684;&#x9AD8;&#x7EA7;<code>Advanced</code>&#x9009;&#x9879;&#x6309;&#x94AE;&#xFF0C;&#x7136;&#x540E;&#x9009;&#x62E9;<code>Network</code>&#x9009;&#x9879;&#x5361;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x5355;&#x51FB;<code>Connection</code>&#x6807;&#x9898;&#x4E0B;&#x7684;<code>Settings</code>&#x6309;&#x94AE;&#x3002; &#x8FD9;&#x5C06;&#x6253;&#x5F00;<code>Connection Settings</code>&#x914D;&#x7F6E;&#x83DC;&#x5355;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-10-3.jpg" alt=""></p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EE3;&#x7406;&#x5355;&#x9009;&#x6309;&#x94AE;&#x8BBE;&#x7F6E;&#x4E3A;<code>Use system proxy settings</code>&#xFF08;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x4EE3;&#x7406;&#x8BBE;&#x7F6E;&#xFF09;&#x3002; &#x8FD9;&#x9700;&#x8981;&#x66F4;&#x6539;&#x4E3A;<code>Manual proxy configuration</code>&#xFF08;&#x624B;&#x52A8;&#x4EE3;&#x7406;&#x914D;&#x7F6E;&#xFF09;&#x3002; &#x624B;&#x52A8;&#x4EE3;&#x7406;&#x914D;&#x7F6E;&#x5E94;&#x4E0E; Burp Suite &#x4EE3;&#x7406;&#x76D1;&#x542C;&#x5668;&#x914D;&#x7F6E;&#x76F8;&#x540C;&#x3002; &#x5728;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;HTTP &#x4EE3;&#x7406;&#x5730;&#x5740;&#x8BBE;&#x7F6E;&#x4E3A;<code>127.0.0.1</code>&#xFF0C;&#x7AEF;&#x53E3;&#x503C;&#x8BBE;&#x7F6E;&#x4E3A; TCP 8080.&#x8981;&#x6355;&#x83B7;&#x5176;&#x4ED6;&#x6D41;&#x91CF;&#xFF08;&#x5982; HTTPS&#xFF09;&#xFF0C;&#x8BF7;&#x5355;&#x51FB;<code>Use this proxy server for all protocols</code>&#xFF08;&#x4E3A;&#x6240;&#x6709;&#x534F;&#x8BAE;&#x4F7F;&#x7528;&#x6B64;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#xFF09;&#x590D;&#x9009;&#x6846;&#x3002; &#x8981;&#x9A8C;&#x8BC1;&#x4E00;&#x5207;&#x662F;&#x5426;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528; IceWeasel &#x6D4F;&#x89C8;&#x5668;&#x6D4F;&#x89C8;&#x7F51;&#x7AD9;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-10-4.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x914D;&#x7F6E;&#x6B63;&#x786E;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x5C1D;&#x8BD5;&#x8FDE;&#x63A5;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x5C06;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x5448;&#x73B0;&#x3002; &#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x4ECE;&#x6D4F;&#x89C8;&#x5668;&#x53D1;&#x9001;&#x7684;&#x8BF7;&#x6C42;&#x88AB;&#x4EE3;&#x7406;&#x62E6;&#x622A;&#x3002; &#x4EE3;&#x7406;&#x62E6;&#x622A;&#x662F; Burp Suite &#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#x3002; &#x8981;&#x786E;&#x8BA4;&#x8BF7;&#x6C42;&#x5DF2;&#x6210;&#x529F;&#x6355;&#x83B7;&#xFF0C;&#x8BF7;&#x8FD4;&#x56DE; Burp Suite &#x4EE3;&#x7406;&#x63A5;&#x53E3;&#xFF0C;&#x5982;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="img/1-10-5.jpg" alt=""></p>
<p>&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x6355;&#x83B7;&#x7684;&#x8BF7;&#x6C42;&#x3002; &#x8981;&#x7EE7;&#x7EED;&#x5C06;&#x6D4F;&#x89C8;&#x5668;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x7528;&#x9014;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x4EE3;&#x7406;&#x914D;&#x7F6E;&#x66F4;&#x6539;&#x4E3A;&#x88AB;&#x52A8;&#x76D1;&#x542C;&#xFF0C;&#x53EA;&#x9700;&#x70B9;&#x51FB;<code>Intercept is on</code>&#xFF08;&#x62E6;&#x622A;&#x5F00;&#x542F;&#xFF09;&#x6309;&#x94AE;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x7981;&#x7528;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7684;&#x4EE3;&#x7406;&#x8BBE;&#x7F6E;&#x66F4;&#x6539;&#x56DE;<code>Use system proxy settings</code>&#xFF08;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x4EE3;&#x7406;&#x8BBE;&#x7F6E;&#x9009;&#x9879;&#xFF09;&#xFF0C;&#x4F7F;&#x7528; Burp &#x65F6;&#x4F7F;&#x7528;&#x624B;&#x52A8;&#x4EE3;&#x7406;&#x8BBE;&#x7F6E;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x5728; Burp Suite &#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x521D;&#x59CB;&#x914D;&#x7F6E;&#x5728; TCP 8080 &#x4E0A;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x76D1;&#x542C;&#x7AEF;&#x53E3;&#x3002;&#x8BE5;&#x7AEF;&#x53E3;&#x7531; Burp Suite &#x7528;&#x4E8E;&#x62E6;&#x622A;&#x6240;&#x6709; Web &#x6D41;&#x91CF;&#xFF0C;&#x5E76;&#x63A5;&#x6536;&#x7531;&#x54CD;&#x5E94;&#x8FD4;&#x56DE;&#x7684;&#x5165;&#x7AD9;&#x6D41;&#x91CF;&#x3002; &#x901A;&#x8FC7;&#x5C06; IceWeasel Web &#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4EE3;&#x7406;&#x914D;&#x7F6E;&#x6307;&#x5411;&#x6B64;&#x7AEF;&#x53E3;&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x751F;&#x6210;&#x7684;&#x6240;&#x6709;&#x6D41;&#x91CF;&#x90FD;&#x901A;&#x8FC7; Burp Suite &#x4EE3;&#x7406;&#x8FDB;&#x884C;&#x8DEF;&#x7531;&#x3002; &#x7531;&#x4E8E; Burp &#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x4FEE;&#x6539;&#x9014;&#x4E2D;&#x7684;&#x6D41;&#x91CF;&#x3002;</p>
<h2 id="111-&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF08;vim-&#x548C;-nano&#xFF09;">1.11 &#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF08;VIM &#x548C; Nano&#xFF09;</h2>
<p>&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x4F1A;&#x7ECF;&#x5E38;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x6216;&#x4FEE;&#x6539;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x73B0;&#x6709;&#x6587;&#x4EF6;&#x3002; &#x4F60;&#x5E94;&#x8BE5;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x5728; Kali &#x4E2D;&#x521B;&#x5EFA;&#x81EA;&#x5B9A;&#x4E49;&#x811A;&#x672C;&#x3002; &#x4F60;&#x8FD8;&#x5E94;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x4FEE;&#x6539;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6216;&#x73B0;&#x6709;&#x6E17;&#x900F;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x5728; Kali Linux &#x4E2D;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x5DE5;&#x5177;&#x4E4B;&#x524D;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6267;&#x884C;&#x5176;&#x4ED6;&#x6B65;&#x9AA4;&#x3002; VIM&#x548C;Nano&#x90FD;&#x662F;&#x96C6;&#x6210;&#x5DE5;&#x5177;&#xFF0C;&#x5DF2;&#x7ECF;&#x5B89;&#x88C5;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Kali &#x4E2D;&#x7684; VIM &#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x521B;&#x5EFA;&#x6587;&#x4EF6;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;<code>vim</code>&#x547D;&#x4EE4;&#xFF0C;&#x5E76;&#x5E26;&#x6709;&#x8981;&#x521B;&#x5EFA;&#x6216;&#x4FEE;&#x6539;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x79F0;&#xFF1A;</p>
<pre><code>root@kali:~# vim vim_demo.txt
</code></pre><p>&#x5728;&#x63D0;&#x4F9B;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;VIM &#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x540D;&#x4E3A;<code>vim_demo.txt</code>&#x7684;&#x6587;&#x4EF6;&#x3002; &#x7531;&#x4E8E;&#x5F53;&#x524D;&#x6CA1;&#x6709;&#x6587;&#x4EF6;&#x4EE5;&#x8BE5;&#x540D;&#x79F0;&#x5B58;&#x5728;&#x4E8E;&#x6D3B;&#x52A8;&#x76EE;&#x5F55;&#x4E2D;&#xFF0C;VIM &#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x6587;&#x4EF6;&#x5E76;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x7A7A;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x3002; &#x4E3A;&#x4E86;&#x5F00;&#x59CB;&#x5728;&#x7F16;&#x8F91;&#x5668;&#x4E2D;&#x8F93;&#x5165;&#x6587;&#x672C;&#xFF0C;&#x8BF7;&#x6309;<code>I</code>&#x6216;<code>Insert</code>&#x6309;&#x94AE;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x5F00;&#x59CB;&#x8F93;&#x5165;&#x6240;&#x9700;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>Write to file demonstration with VIM 
~                                                                       
~                                                                        
~                                                                        
~
</code></pre><p>&#x5728;&#x63D0;&#x4F9B;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x884C;&#x6DFB;&#x52A0;&#x5230;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x591A;&#x884C;&#x3002; &#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x6309;<code>Esc</code>&#x952E;&#x9000;&#x51FA;&#x63D2;&#x5165;&#x6A21;&#x5F0F;&#x5E76;&#x5728; VIM &#x4E2D;&#x8FDB;&#x5165;&#x547D;&#x4EE4;&#x6A21;&#x5F0F;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x952E;&#x5165;<code>:wq</code>&#x5E76;&#x6309;<code>Enter</code>&#x952E;&#x4FDD;&#x5B58;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B; bash &#x547D;&#x4EE4;&#x9A8C;&#x8BC1;&#x6587;&#x4EF6;&#x662F;&#x5426;&#x5B58;&#x5728;&#x5E76;&#x9A8C;&#x8BC1;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#xFF1A;</p>
<pre><code>root@kali:~# ls 
Desktop  vim_demo.txt 
root@kali:~# cat vim_demo.txt 
Write to file demonstration with VIM
</code></pre><p><code>ls</code>&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x67E5;&#x770B;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x7684;&#x5185;&#x5BB9;&#x3002; &#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;<code>vim_demo.txt</code>&#x6587;&#x4EF6;&#x5DF2;&#x521B;&#x5EFA;&#x3002; <code>cat</code>&#x547D;&#x4EE4;&#x53EF;&#x7528;&#x4E8E;&#x8BFB;&#x53D6;&#x548C;&#x663E;&#x793A;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x3002; &#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x66FF;&#x4EE3;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x662F; Nano&#x3002; Nano &#x7684;&#x57FA;&#x672C;&#x7528;&#x6CD5;&#x4E0E; VIM &#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002; &#x4E3A;&#x4E86;&#x5F00;&#x59CB;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;<code>nano</code>&#x547D;&#x4EE4;&#xFF0C;&#x540E;&#x9762;&#x5E26;&#x6709;&#x8981;&#x521B;&#x5EFA;&#x6216;&#x4FEE;&#x6539;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x79F0;&#xFF1A;</p>
<pre><code>root@kali:~# nano nano_demo.txt
</code></pre><p>&#x5728;&#x63D0;&#x4F9B;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;<code>nano</code>&#x7528;&#x4E8E;&#x6253;&#x5F00;&#x540D;&#x4E3A;<code>nano_demo.txt</code>&#x7684;&#x6587;&#x4EF6;&#x3002; &#x7531;&#x4E8E;&#x5F53;&#x524D;&#x4E0D;&#x5B58;&#x5728;&#x5177;&#x6709;&#x8BE5;&#x540D;&#x79F0;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x56E0;&#x6B64;&#x5C06;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x6587;&#x4EF6;&#x3002; &#x4E0E; VIM &#x4E0D;&#x540C;&#xFF0C;&#x6CA1;&#x6709;&#x5355;&#x72EC;&#x7684;&#x547D;&#x4EE4;&#x548C;&#x5199;&#x5165;&#x6A21;&#x5F0F;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x6309;<code>Ctrl</code>&#x952E;&#x548C;&#x7279;&#x5B9A;&#x7684;&#x5B57;&#x6BCD;&#x952E;&#x6765;&#x6267;&#x884C;&#x547D;&#x4EE4;&#x3002; &#x8FD9;&#x4E9B;&#x547D;&#x4EE4;&#x7684;&#x5217;&#x8868;&#x53EF;&#x4EE5;&#x59CB;&#x7EC8;&#x5728;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x754C;&#x9762;&#x7684;&#x5E95;&#x90E8;&#x770B;&#x5230;&#xFF1A;</p>
<pre><code>GNU nano 2.2.6             File: nano_demo.txt                                

Write to file demonstration with Nano
</code></pre><p>&#x63D0;&#x4F9B;&#x7684;&#x793A;&#x4F8B;&#x5411;<code>nano_demo.txt</code>&#x6587;&#x4EF6;&#x5199;&#x5165;&#x4E86;&#x4E00;&#x884C;&#x3002; &#x8981;&#x5173;&#x95ED;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>Ctrl + X</code>&#xFF0C;&#x7136;&#x540E;&#x4F1A;&#x63D0;&#x793A;&#x60A8;&#x4F7F;&#x7528;<code>y</code>&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#x6216;&#x4F7F;&#x7528;<code>n</code>&#x4E0D;&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#x3002; &#x7CFB;&#x7EDF;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x786E;&#x8BA4;&#x8981;&#x5199;&#x5165;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x3002; &#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F1A;&#x4F7F;&#x7528; Nano &#x6267;&#x884C;&#x65F6;&#x63D0;&#x4F9B;&#x7684;&#x540D;&#x79F0;&#x586B;&#x5145;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x6B64;&#x503C;&#xFF0C;&#x5E76;&#x5C06;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x53E6;&#x5B58;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>root@kali:~# ls 
Desktop  nano_demo.txt  vim_demo.txt 
root@kali:~# cat nano_demo.txt 
Write to file demonstration with Nano
</code></pre><p>&#x4E00;&#x65E6;&#x5B8C;&#x6210;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x4F7F;&#x7528;<code>ls</code>&#x548C;<code>cat</code>&#x547D;&#x4EE4;&#x6765;&#x9A8C;&#x8BC1;&#x6587;&#x4EF6;&#x662F;&#x5426;&#x5199;&#x5165;&#x76EE;&#x5F55;&#xFF0C;&#x5E76;&#x5206;&#x522B;&#x9A8C;&#x8BC1;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x3002; &#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x7684;&#x76EE;&#x7684;&#x662F;&#x8BA8;&#x8BBA;&#x6BCF;&#x4E2A;&#x8FD9;&#x4E9B;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x57FA;&#x672C;&#x4F7F;&#x7528;&#x6765;&#x7F16;&#x5199;&#x548C;&#x64CD;&#x7EB5;&#x6587;&#x4EF6;&#x3002; &#x7136;&#x800C;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x6709;&#x5927;&#x91CF;&#x5176;&#x4ED6;&#x7528;&#x4E8E;&#x6587;&#x4EF6;&#x7F16;&#x8F91;&#x7684;&#x529F;&#x80FD;&#x3002; &#x6709;&#x5173;&#x5176;&#x7528;&#x6CD5;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;<code>man</code>&#x547D;&#x4EE4;&#x8BBF;&#x95EE;&#x624B;&#x518C;&#x9875;&#xFF0C;&#x540E;&#x9762;&#x5E26;&#x6709;&#x7279;&#x5B9A;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x540D;&#x79F0;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x547D;&#x4EE4;&#x884C;&#x9A71;&#x52A8;&#x7684;&#x5B57;&#x7B26;&#x5904;&#x7406;&#x5DE5;&#x5177;&#x3002; &#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x53CA;&#x5176;&#x6240;&#x6709;&#x76F8;&#x5173;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x800C;&#x6267;&#x884C;&#x3002; &#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x56FE;&#x5F62;&#x7EC4;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x9700;&#x8981;&#x975E;&#x5E38;&#x5C11;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x5E76;&#x4E14;&#x6781;&#x5FEB;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x975E;&#x5E38;&#x6709;&#x6548;&#x5E76;&#x5FEB;&#x901F;&#x4FEE;&#x6539;&#x6587;&#x4EF6;&#xFF0C;&#x6216;&#x901A;&#x8FC7;&#x8FDC;&#x7A0B;&#x7EC8;&#x7AEF;&#x63A5;&#x53E3;&#xFF08;&#x5982; SSH &#x6216; Telnet&#xFF09;&#x5904;&#x7406;&#x6587;&#x4EF6;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Kali Linux 网络扫描秘籍 中文版">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch2.html" class="navigation navigation-next " aria-label="Next page: 第二章 探索扫描">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一章 起步","level":"1.2","depth":1,"next":{"title":"第二章 探索扫描","level":"1.3","depth":1,"path":"ch2.md","ref":"ch2.md","articles":[]},"previous":{"title":"Kali Linux 网络扫描秘籍 中文版","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["comment"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"comment":{"highlightCommented":true},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"wizardforcel","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Kali Linux 网络扫描秘籍","language":"zh","links":{"sidebar":{"Kali Linux 网络扫描秘籍":"https://www.gitbook.com/book/wizardforcel/kali-linux-network-scanning-cookbook"},"gitbook":true},"gitbook":"*","description":"Kali Linux Network Scanning Cookbook 中文版"},"file":{"path":"ch1.md","mtime":"2016-11-25T09:44:31.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2016-11-26T04:32:05.478Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-comment/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

