
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第三章 端口扫描 · Kali Linux 网络扫描秘籍</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="wizardforcel">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-comment/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch4.html" />
    
    
    <link rel="prev" href="ch2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/wizardforcel/kali-linux-network-scanning-cookbook" target="_blank" class="custom-link">Kali Linux 网络扫描秘籍</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Kali Linux 网络扫描秘籍 中文版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章 起步
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章 探索扫描
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章 端口扫描
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章 指纹识别
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章 漏洞扫描
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章 拒绝服务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章 Web 应用扫描
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章 自动化 Kali 工具
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第三章 端口扫描</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E09;&#x7AE0;-&#x7AEF;&#x53E3;&#x626B;&#x63CF;">&#x7B2C;&#x4E09;&#x7AE0; &#x7AEF;&#x53E3;&#x626B;&#x63CF;</h1>
<blockquote>
<p>&#x4F5C;&#x8005;&#xFF1A;Justin Hutchens</p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
</blockquote>
<p>&#x786E;&#x5B9A;&#x76EE;&#x6807;&#x7684;&#x653B;&#x51FB;&#x9762;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#xFF0C;&#x662F;&#x8BC6;&#x522B;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x3002;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x5BF9;&#x5E94;&#x7CFB;&#x7EDF;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x3002;&#x7F16;&#x7A0B;&#x9519;&#x8BEF;&#x6216;&#x5B9E;&#x65BD;&#x7F3A;&#x9677;&#x53EF;&#x80FD;&#x4F7F;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x5B58;&#x5728;&#x6F0F;&#x6D1E;&#xFF0C;&#x6709;&#x65F6;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x7684;&#x5168;&#x9762;&#x6CA6;&#x9677;&#x3002;&#x8981;&#x4E3A;&#x4E86;&#x5B9A;&#x53EF;&#x80FD;&#x7684;&#x653B;&#x51FB;&#x5411;&#x91CF;&#xFF0C;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x679A;&#x4E3E;&#x9879;&#x76EE;&#x8303;&#x56F4;&#x5185;&#x7684;&#x6240;&#x6709;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x3002;&#x8FD9;&#x4E9B;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x5BF9;&#x5E94;&#x53EF;&#x4EE5;&#x7528; UDP &#x6216; TCP &#x6D41;&#x91CF;&#x8BBF;&#x95EE;&#x7684;&#x670D;&#x52A1;&#x3002; TCP &#x548C; UDP &#x90FD;&#x662F;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#x3002;&#x4F20;&#x8F93;&#x63A7;&#x5236;&#x534F;&#x8BAE;&#xFF08;TCP&#xFF09;&#x66F4;&#x52A0;&#x5E38;&#x7528;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#x901A;&#x4FE1;&#x3002;&#x7528;&#x6237;&#x6570;&#x636E;&#x62A5;&#x534F;&#x8BAE;&#xFF08;UDP&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x9762;&#x5411;&#x975E;&#x8FDE;&#x63A5;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x6709;&#x65F6;&#x7528;&#x4E8E;&#x4F20;&#x8F93;&#x901F;&#x5EA6;&#x6BD4;&#x6570;&#x636E;&#x5B8C;&#x6574;&#x6027;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x670D;&#x52A1;&#x3002;&#x7528;&#x4E8E;&#x679A;&#x4E3E;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x7684;&#x6E17;&#x900F;&#x6D4B;&#x8BD5;&#x6280;&#x672F;&#x79F0;&#x4E3A;&#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x3002;&#x4E0E;&#x4E0A;&#x4E00;&#x7AE0;&#x8BA8;&#x8BBA;&#x7684;&#x4E3B;&#x673A;&#x53D1;&#x73B0;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x5E94;&#x8BE5;&#x4EA7;&#x751F;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6765;&#x8BC6;&#x522B;&#x670D;&#x52A1;&#x662F;&#x5426;&#x4E0E;&#x8BBE;&#x5907;&#x6216;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x7ED9;&#x5B9A;&#x7AEF;&#x53E3;&#x76F8;&#x5173;&#x3002;</p>
<p>&#x5728;&#x8BB2;&#x89E3;&#x7279;&#x5B9A;&#x79D8;&#x7C4D;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8981;&#x8BA8;&#x8BBA;&#x4E00;&#x4E9B;&#x6709;&#x5173;&#x7AEF;&#x53E3;&#x7AEF;&#x53E3;&#x7684;&#x5E95;&#x5C42;&#x539F;&#x7406;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x7406;&#x89E3;&#x5B83;&#x4EEC;&#x3002;</p>
<h2 id="31-udp&#x7AEF;&#x53E3;&#x626B;&#x63CF;">3.1 UDP&#x7AEF;&#x53E3;&#x626B;&#x63CF;</h2>
<p>&#x7531;&#x4E8E; TCP &#x662F;&#x66F4;&#x52A0;&#x5E38;&#x7528;&#x7684;&#x4F20;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#xFF0C;&#x4F7F;&#x7528; UDP &#x7684;&#x670D;&#x52A1;&#x5E38;&#x5E38;&#x88AB;&#x4EBA;&#x9057;&#x5FD8;&#x3002;&#x867D;&#x7136; UDP &#x670D;&#x52A1;&#x672C;&#x8D28;&#x4E0A;&#x62E5;&#x6709;&#x88AB;&#x5FFD;&#x89C6;&#x7684;&#x8D8B;&#x52BF;&#xFF0C;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x679A;&#x4E3E;&#xFF0C;&#x7528;&#x6765;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x76EE;&#x6807;&#x7684;&#x5DE5;&#x5177;&#x9762;&#xFF0C;&#x8FD9;&#x76F8;&#x5F53;&#x5173;&#x952E;&#x3002;UDP &#x626B;&#x63CF;&#x901A;&#x5E38;&#x7531;&#x6311;&#x6218;&#x6027;&#xFF0C;&#x9EBB;&#x70E6;&#xFF0C;&#x5E76;&#x4E14;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x4E00;&#x7AE0;&#x7684;&#x524D;&#x4E09;&#x4E2A;&#x79D8;&#x7C4D;&#x4F1A;&#x6D89;&#x53CA;&#x5982;&#x4F55;&#x5728; Kali &#x4E2D;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x5DE5;&#x5177;&#x6267;&#x884C; UDP &#x626B;&#x63CF;&#x3002;&#x7406;&#x89E3; UDP &#x626B;&#x63CF;&#x53EF;&#x4EE5;&#x7528;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x6267;&#x884C;&#x76F8;&#x5F53;&#x91CD;&#x8981;&#x3002;&#x4E00;&#x79CD;&#x6280;&#x5DE7;&#x4F1A;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x79D8;&#x7C4D;&#x4E2D;&#x5F3A;&#x8C03;&#xFF0C;&#x5B83;&#x4EC5;&#x4EC5;&#x4F9D;&#x8D56;&#x4E8E; ICMP &#x7AEF;&#x53E3;&#x4E0D;&#x53EF;&#x8FBE;&#x54CD;&#x5E94;&#x3002;&#x8FD9;&#x7C7B;&#x578B;&#x7684;&#x626B;&#x63CF;&#x4F9D;&#x8D56;&#x4E8E;&#x4EFB;&#x4F55;&#x6CA1;&#x6709;&#x7ED1;&#x5B9A;&#x67D0;&#x4E2A;&#x670D;&#x52A1;&#x7684; UDP &#x7AEF;&#x53E3;&#x90FD;&#x4F1A;&#x8FD4;&#x56DE; ICP &#x7AEF;&#x53E3;&#x4E0D;&#x53EF;&#x8FBE;&#x54CD;&#x5E94;&#x7684;&#x5047;&#x8BBE;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x8FD4;&#x56DE;&#x8FD9;&#x79CD;&#x54CD;&#x5E94;&#x5C31;&#x4EE3;&#x8868;&#x62E5;&#x6709;&#x670D;&#x52A1;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x5341;&#x5206;&#x9AD8;&#x6548;&#xFF0C;&#x5728;&#x4E3B;&#x673A;&#x4E0D;&#x751F;&#x6210;&#x7AEF;&#x53E3;&#x4E0D;&#x53EF;&#x8FBE;&#x54CD;&#x5E94;&#xFF0C;&#x6216;&#x8005;&#x7AEF;&#x53E3;&#x4E0D;&#x53EF;&#x8FBE;&#x54CD;&#x5E94;&#x5B58;&#x5728;&#x901F;&#x7387;&#x9650;&#x5236;&#x6216;&#x88AB;&#x9632;&#x706B;&#x5899;&#x8FC7;&#x6EE4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x4E5F;&#x4F1A;&#x8FD4;&#x56DE;&#x4E0D;&#x7CBE;&#x786E;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4E00;&#x79CD;&#x66FF;&#x4EE3;&#x65B9;&#x5F0F;&#x4F1A;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x548C;&#x7B2C;&#x4E09;&#x4E2A;&#x79D8;&#x7C4D;&#x4E2D;&#x8BB2;&#x89E3;&#xFF0C;&#x662F;&#x4F7F;&#x7528;&#x670D;&#x52A1;&#x7279;&#x5B9A;&#x7684;&#x63A2;&#x9488;&#x6765;&#x5C1D;&#x8BD5;&#x8BF7;&#x6C42;&#x54CD;&#x5E94;&#xFF0C;&#x4EE5;&#x8868;&#x660E;&#x6240;&#x9884;&#x671F;&#x7684;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x5728;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x4E0A;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x975E;&#x5E38;&#x9AD8;&#x6548;&#xFF0C;&#x4E5F;&#x975E;&#x5E38;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#x3002;</p>
<h2 id="32-tcp-&#x626B;&#x63CF;">3.2 TCP &#x626B;&#x63CF;</h2>
<p>&#x8FD9;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x4F1A;&#x63D0;&#x53CA;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684; TCP &#x626B;&#x63CF;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x4E9B;&#x6280;&#x5DE7;&#x5305;&#x542B;&#x9690;&#x79D8;&#x626B;&#x63CF;&#x3001;&#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x548C;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x3002;&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x626B;&#x63CF;&#x6280;&#x5DE7;&#x7684;&#x539F;&#x7406;&#xFF0C;&#x7406;&#x89E3; TCP &#x5982;&#x4F55;&#x5EFA;&#x7ACB;&#x4EE5;&#x53CA;&#x7EF4;&#x62A4;&#x8FDE;&#x63A5;&#x5341;&#x5206;&#x91CD;&#x8981;&#x3002;TCP &#x662F;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x53EA;&#x6709;&#x8FDE;&#x63A5;&#x5728;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x4E4B;&#x540E;&#xFF0C;&#x6570;&#x636E;&#x624D;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; TCP &#x4F20;&#x8F93;&#x3002;&#x8FD9;&#x4E2A;&#x548C;&#x5EFA;&#x7ACB; TCP &#x8FDE;&#x63A5;&#x7684;&#x8FC7;&#x7A0B;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x6307;&#x4EE3;&#x3002;&#x8FD9;&#x4E2A;&#x5185;&#x5BB9;&#x6697;&#x6307;&#x8FDE;&#x63A5;&#x8FC7;&#x7A0B;&#x6D89;&#x53CA;&#x7684;&#x4E09;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;&#x4E0B;&#x56FE;&#x5C55;&#x793A;&#x4E86;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img src="img/3-2-1.jpg" alt=""></p>
<p>TCP SYN &#x5C01;&#x5305;&#x4ECE;&#x60F3;&#x8981;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x7684;&#x8BBE;&#x5907;&#x53D1;&#x9001;&#xFF0C;&#x5E76;&#x5E26;&#x6709;&#x60F3;&#x8981;&#x8FDE;&#x63A5;&#x7684;&#x8BBE;&#x5907;&#x7AEF;&#x53E3;&#x3002;&#x5982;&#x679C;&#x548C;&#x63A5;&#x6536;&#x7AEF;&#x53E3;&#x5173;&#x8054;&#x7684;&#x670D;&#x52A1;&#x63A5;&#x6536;&#x4E86;&#x8FD9;&#x4E2A;&#x8FDE;&#x63A5;&#xFF0C;&#x5B83;&#x4F1A;&#x5411;&#x8BF7;&#x6C42;&#x7CFB;&#x7EDF;&#x8FD4;&#x56DE; TCP &#x5C01;&#x5305;&#xFF0C;&#x5176;&#x4E2D; SYN &#x548C; ACK &#x4F4D;&#x90FD;&#x662F;&#x6FC0;&#x6D3B;&#x7684;&#x3002;&#x8FDE;&#x63A5;&#x4EC5;&#x4EC5;&#x5728;&#x8BF7;&#x6C42;&#x7CFB;&#x7EDF;&#x53D1;&#x9001; TCP ACK &#x54CD;&#x5E94;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5EFA;&#x7ACB;&#x3002;&#x8FD9;&#x4E2A;&#x4E09;&#x6B65;&#x8FC7;&#x7A0B;&#x5728;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x4E86; TCP &#x4F1A;&#x8BDD;&#x3002;&#x6240;&#x6709; TCP &#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x673A;&#x5236;&#x90FD;&#x4F1A;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x4E0D;&#x540C;&#x53D8;&#x79CD;&#xFF0C;&#x6765;&#x8BC6;&#x522B;&#x8FDC;&#x7A0B;&#x4E3B;&#x673A;&#x4E0A;&#x7684;&#x6D3B;&#x52A8;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x548C;&#x9690;&#x79D8;&#x626B;&#x63CF;&#x90FD;&#x975E;&#x5E38;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x3002;&#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x4F1A;&#x4E3A;&#x6BCF;&#x4E2A;&#x626B;&#x63CF;&#x7AEF;&#x53E3;&#x5EFA;&#x7ACB;&#x5B8C;&#x6574;&#x7684; TCP &#x8FDE;&#x63A5;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x626B;&#x63CF;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x4F1A;&#x5B8C;&#x6210;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x3002;&#x5982;&#x679C;&#x8FDE;&#x63A5;&#x6210;&#x529F;&#x5EFA;&#x7ACB;&#xFF0C;&#x7AEF;&#x53E3;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x4E3A;&#x6253;&#x5F00;&#x7684;&#x3002;&#x4F5C;&#x4E3A;&#x66FF;&#x4EE3;&#xFF0C;&#x9690;&#x79D8;&#x626B;&#x63CF;&#x4E0D;&#x5EFA;&#x7ACB;&#x5B8C;&#x6574;&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x9690;&#x79D8;&#x626B;&#x63CF;&#x4E5F;&#x6307;&#x4EE3; SYN &#x626B;&#x63CF;&#x6216;&#x534A;&#x5F00;&#x653E;&#x626B;&#x63CF;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x626B;&#x63CF;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x6307;&#x5411;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x53D1;&#x9001;&#x5355;&#x4E2A; SYN &#x5C01;&#x5305;&#xFF0C;&#x6240;&#x6709;&#x56DE;&#x590D; SYN+ACK &#x5C01;&#x5305;&#x7684;&#x7AEF;&#x53E3;&#x5047;&#x8BBE;&#x4E3A;&#x8FD0;&#x884C;&#x6D3B;&#x52A8;&#x670D;&#x52A1;&#x3002;&#x7531;&#x4E8E;&#x521D;&#x59CB;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x53D1;&#x9001;&#x6700;&#x540E;&#x7684; ACK&#xFF0C;&#x8FDE;&#x63A5;&#x53EA;&#x5F00;&#x542F;&#x4E86;&#x5DE6;&#x534A;&#x8FB9;&#x3002;&#x8FD9;&#x7528;&#x4E8E;&#x6307;&#x4EE3;&#x9690;&#x79D8;&#x626B;&#x63CF;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x65E5;&#x5FD7;&#x7CFB;&#x7EDF;&#x53EA;&#x4F1A;&#x8BB0;&#x5F55;&#x5EFA;&#x7ACB;&#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x4E0D;&#x4F1A;&#x8BB0;&#x5F55;&#x4EFB;&#x4F55;&#x8FD9;&#x79CD;&#x626B;&#x63CF;&#x7684;&#x75D5;&#x8FF9;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x7AE0;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#x6700;&#x540E;&#x4E00;&#x79CD; TCP &#x626B;&#x63CF;&#x6280;&#x672F;&#x53EB;&#x505A;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x3002;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x7684;&#x76EE;&#x7684;&#x662F;&#x6620;&#x5C04;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x4EFB;&#x4F55;&#x548C;&#x7CFB;&#x7EDF;&#x4EA4;&#x4E92;&#x8FC7;&#x7684;&#x75D5;&#x8FF9;&#x3002;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x80CC;&#x540E;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x5341;&#x5206;&#x590D;&#x6742;&#x3002;&#x6267;&#x884C;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x8FC7;&#x7A0B;&#x9700;&#x8981;&#x9075;&#x5FAA;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ol>
<li><p>&#x5C06;&#x67D0;&#x4E2A;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x770B;&#x505A;&#x4F60;&#x7684;&#x50F5;&#x5C38;&#x3002;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x62E5;&#x6709;&#x5982;&#x4E0B;&#x7279;&#x5F81;&#xFF1A;</p>
<ul>
<li>&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x662F;&#x9650;&#x5236;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x548C;&#x7F51;&#x7EDC;&#x4E0A;&#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x901A;&#x4FE1;&#x3002;</li>
<li>&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x9012;&#x589E;&#x7684; IPID &#x5E8F;&#x5217;&#x3002;</li>
</ul>
</li>
<li><p>&#x7ED9;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x53D1;&#x9001; SYN+ACK &#x5C01;&#x5305;&#x5E76;&#x8BB0;&#x5F55;&#x521D;&#x59CB; IPID &#x503C;&#x3002;</p>
</li>
<li><p>&#x5C06;&#x5C01;&#x5305;&#x7684; IP &#x6E90;&#x5730;&#x5740;&#x4F2A;&#x9020;&#x6210;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x7684; IP &#x5730;&#x5740;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x53D1;&#x9001;&#x7ED9;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x3002;</p>
</li>
<li><p>&#x53D6;&#x51B3;&#x4E8E;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x7684;&#x7AEF;&#x53E3;&#x72B6;&#x6001;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4E0B;&#x5217;&#x4E8B;&#x60C5;&#x4E4B;&#x4E00;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x5F00;&#x653E;&#xFF0C;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x4F1A;&#x5411;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x8FD4;&#x56DE; SYN+ACK &#x5C01;&#x5305;&#xFF0C;&#x5B83;&#x76F8;&#x4FE1;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x53D1;&#x9001;&#x4E86;&#x4E4B;&#x524D;&#x7684; SYN &#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x4F1A;&#x4EE5; RST &#x5C01;&#x5305;&#x56DE;&#x590D;&#x8FD9;&#x4E2A;&#x5E26;&#x8DEF;&#x4E0D;&#x660E;&#x7684; SYN+ACK &#x5C01;&#x5305;&#xFF0C;&#x5E76;&#x4E14;&#x5C06; IPID &#x503C;&#x589E;&#x52A0; 1&#x3002;</li>
<li>&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x5173;&#x95ED;&#xFF0C;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x4F1A;&#x5C06; RST &#x54CD;&#x5E94;&#x8FD4;&#x56DE;&#x7ED9;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#xFF0C;   &#x5B83;&#x76F8;&#x4FE1;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x53D1;&#x9001;&#x4E86;&#x4E4B;&#x524D;&#x7684; SYN &#x8BF7;&#x6C42;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x503C;&#x589E;&#x52A0;&#x4E86; 1&#xFF0C;&#x90A3;&#x4E48;&#x4E4B;&#x540E;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x4E0A;&#x7684;&#x7AEF;&#x53E3;&#x5173;&#x95ED;&#xFF0C;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x503C;&#x589E;&#x52A0;&#x4E86; 2&#xFF0C;&#x90A3;&#x4E48;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x7684;&#x7AEF;&#x53E3;&#x5F00;&#x653E;&#x3002;</li>
</ul>
</li>
<li><p>&#x5411;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x53D1;&#x9001;&#x53E6;&#x4E00;&#x4E2A; SYN+ACK &#x5C01;&#x5305;&#xFF0C;&#x5E76;&#x6C42;&#x51FA;&#x6240;&#x8FD4;&#x56DE;&#x7684; RST &#x54CD;&#x5E94;&#x4E2D;&#x7684;&#x6700;&#x540E;&#x7684; IPID &#x503C;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x503C;&#x589E;&#x52A0;&#x4E86; 1&#xFF0C;&#x90A3;&#x4E48;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x4E0A;&#x7684;&#x7AEF;&#x53E3;&#x5173;&#x95ED;&#x3002;&#x5982;&#x679C;&#x589E;&#x52A0;&#x4E86; 2&#xFF0C;&#x90A3;&#x4E48;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x4E0A;&#x7684;&#x7AEF;&#x53E3;&#x5F00;&#x653E;&#x3002;</p>
</li>
</ol>
<p>&#x4E0B;&#x9762;&#x7684;&#x56FE;&#x5C55;&#x793A;&#x4E86;&#x5F53;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x7528;&#x4E8E;&#x626B;&#x63CF;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x65F6;&#xFF0C;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x4EA4;&#x4E92;&#x3002;</p>
<p><img src="img/3-2-2.jpg" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x6267;&#x884C;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#xFF0C;&#x521D;&#x59CB;&#x7684; SYN+SCK &#x8BF7;&#x6C42;&#x5E94;&#x8BE5;&#x53D1;&#x7ED9;&#x50F5;&#x5C38;&#x7CFB;&#x7EDF;&#x6765;&#x5224;&#x65AD;&#x8FD4;&#x56DE; RST &#x5C01;&#x5305;&#x4E2D;&#x7684;&#x5F53;&#x524D; IPID &#x503C;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x5C06;&#x4F2A;&#x9020;&#x7684; SYN &#x5C01;&#x5305;&#x53D1;&#x5F80;&#x76EE;&#x6807;&#x54AA;&#x8868;&#xFF0C;&#x5E26;&#x6709;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x7684;&#x6E90; IP &#x5730;&#x5740;&#x3002;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x5F00;&#x653E;&#xFF0C;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x4F1A;&#x5C06; SYN+ACK &#x54CD;&#x5E94;&#x53D1;&#x56DE;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x3002;&#x7531;&#x4E8E;&#x5C06;&#x662F;&#x4E3B;&#x673A;&#x5E76;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x53D1;&#x9001;&#x4E4B;&#x524D;&#x7684; SYN &#x8BF7;&#x6C42;&#xFF0C;&#x5B83;&#x4F1A;&#x5C06; SYN+ACK &#x54CD;&#x5E94;&#x770B;&#x505A;&#x6765;&#x8DEF;&#x4E0D;&#x660E;&#xFF0C;&#x5E76;&#x5C06; RST &#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x56DE;&#x76EE;&#x6807;&#x4E3B;&#x673A;&#xFF0C;&#x56E0;&#x6B64; IPID &#x4F1A;&#x589E;&#x52A0; 1&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5E94;&#x8BE5;&#x5411;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x53D1;&#x9001;&#x53E6;&#x4E00;&#x4E2A; SYN+ACK &#x5C01;&#x5305;&#xFF0C;&#x8FD9;&#x4F1A;&#x8FD4;&#x56DE; RST &#x5C01;&#x5305;&#x5E76;&#x518D;&#x6B21;&#x589E;&#x52A0; IPID&#x3002;&#x589E;&#x52A0; 2 &#x7684; IPID &#x8868;&#x793A;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#x90FD;&#x53D1;&#x751F;&#x4E86;&#xFF0C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x662F;&#x5F00;&#x653E;&#x7684;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x5982;&#x679C;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x7684;&#x7AEF;&#x53E3;&#x662F;&#x5173;&#x95ED;&#x7684;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4E00;&#x7CFB;&#x5217;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4; RST &#x54CD;&#x5E94;&#x7684; IPID &#x4EC5;&#x4EC5;&#x589E;&#x52A0; 1&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x56FE;&#x5C55;&#x793A;&#x4E86;&#x5F53;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x7528;&#x4E8E;&#x626B;&#x63CF;&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x65F6;&#xFF0C;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x4EA4;&#x4E92;&#x3002;</p>
<p><img src="img/3-2-3.jpg" alt=""></p>
<p>&#x5982;&#x679C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x5173;&#x95ED;&#xFF0C;&#x53D1;&#x5F80;&#x50F5;&#x5C38;&#x7CFB;&#x7EDF;&#x7684; RST &#x5C01;&#x5305;&#x662F;&#x4E4B;&#x524D;&#x4F2A;&#x9020;&#x7684; SYN &#x5C01;&#x5305;&#x7684;&#x54CD;&#x5E94;&#x3002;&#x7531;&#x4E8E; RST &#x5C01;&#x5305;&#x6CA1;&#x6709;&#x624B;&#x9020;&#x6062;&#x590D;&#xFF0C;&#x50F5;&#x5C38;&#x7CFB;&#x7EDF;&#x7684; IPID &#x503C;&#x4E0D;&#x4F1A;&#x589E;&#x52A0;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD4;&#x56DE;&#x7ED9;&#x626B;&#x63CF;&#x7CFB;&#x7EDF;&#x7684;&#x6700;&#x540E;&#x7684; RST &#x5C01;&#x5305;&#x7684; IPID &#x503C;&#x53EA;&#x4F1A;&#x589E;&#x52A0; 1&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x5BF9;&#x6BCF;&#x4E2A;&#x60F3;&#x8981;&#x626B;&#x63CF;&#x7684;&#x7AEF;&#x53E3;&#x6267;&#x884C;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6620;&#x5C04;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x7559;&#x4E0B;&#x626B;&#x63CF;&#x7CFB;&#x7EDF;&#x6267;&#x884C;&#x4E86;&#x626B;&#x63CF;&#x7684;&#x75D5;&#x8FF9;&#x3002;</p>
<h2 id="33-scapy-udp-&#x626B;&#x63CF;">3.3 Scapy UDP &#x626B;&#x63CF;</h2>
<p>Scapy &#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5411;&#x7F51;&#x7EDC;&#x6784;&#x9020;&#x548C;&#x6CE8;&#x5165;&#x81EA;&#x5B9A;&#x4E49;&#x5C01;&#x5305;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x4E2D;&#xFF0C;Scapy &#x4F1A;&#x7528;&#x4E8E;&#x626B;&#x63CF;&#x6D3B;&#x52A8;&#x7684; UDP &#x670D;&#x52A1;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x7A7A;&#x7684; UDP &#x5C01;&#x5305;&#x7ED9;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#xFF0C;&#x4E4B;&#x540E;&#x8BC6;&#x522B;&#x6CA1;&#x6709;&#x56DE;&#x590D; ICMP &#x4E0D;&#x53EF;&#x8FBE;&#x54CD;&#x5E94;&#x7684;&#x7AEF;&#x53E3;&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Scapy &#x6267;&#x884C; UDP &#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C; UDP &#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Metasploitable2 &#x5B9E;&#x4F8B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E00;&#x8282;&#x4E5F;&#x9700;&#x8981;&#x7F16;&#x5199;&#x811A;&#x672C;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;*VIM &#x548C; Nano&#xFF09;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4F7F;&#x7528; Scapy&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x7406;&#x89E3; UDP &#x626B;&#x63CF;&#x539F;&#x7406;&#x80CC;&#x540E;&#x7684;&#x5E95;&#x5C42;&#x89C4;&#x5219;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x8BA4;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x7AEF;&#x53E3;&#x4E0A;&#x662F;&#x5426;&#x5B58;&#x5728; UDP &#x670D;&#x52A1;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BA9;&#x670D;&#x52A1;&#x5668;&#x4EA7;&#x751F;&#x54CD;&#x5E94;&#x3002;&#x8FD9;&#x4E2A;&#x8BC1;&#x660E;&#x5341;&#x5206;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x8BB8;&#x591A; UDP &#x670D;&#x52A1;&#x90FD;&#x53EA;&#x56DE;&#x590D;&#x670D;&#x52A1;&#x7279;&#x5B9A;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x670D;&#x52A1;&#x7684;&#x77E5;&#x8BC6;&#x90FD;&#x4F1A;&#x4F7F;&#x6B63;&#x9762;&#x8BC6;&#x522B;&#x8BE5;&#x670D;&#x52A1;&#x53D8;&#x5F97;&#x5BB9;&#x6613;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x901A;&#x5E38;&#x6280;&#x5DE7;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5224;&#x65AD;&#x670D;&#x52A1;&#x662F;&#x5426;&#x8FD0;&#x884C;&#x4E8E;&#x7ED9;&#x5B9A;&#x7684; UDP &#x7AEF;&#x53E3;&#xFF0C;&#x5E76;&#x4E14;&#x51C6;&#x786E;&#x7387;&#x8FD8;&#x4E0D;&#x9519;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x4F7F;&#x7528; Scapy &#x64CD;&#x4F5C;&#x7684;&#x8FD9;&#x79CD;&#x6280;&#x5DE7;&#x662F;&#x8BC6;&#x522B;&#x5173;&#x95ED;&#x7684;&#x7AEF;&#x53E3;&#x7684; ICMP &#x4E0D;&#x53EF;&#x8FBE;&#x54CD;&#x5E94;&#x3002;&#x4E3A;&#x4E86;&#x5411;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x7AEF;&#x53E3;&#x53D1;&#x9001; UDP &#x8BF7;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x6784;&#x5EFA;&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#x7684;&#x4E00;&#x4E9B;&#x5C42;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6784;&#x5EFA;&#x7684;&#x7B2C;&#x4E00;&#x5C42;&#x5C31;&#x662F; IP &#x5C42;&#x3002;</p>
<pre><code>root@KaliLinux:~# scapy 
Welcome to Scapy (2.2.0) 
&gt;&gt;&gt; i = IP() 
&gt;&gt;&gt; i.display() 
###[ IP ]###  
    version= 4  
    ihl= None  
    tos= 0x0  
    len= None  
    id= 1  
    flags=   
    frag= 0  
    ttl= 64  
    proto= ip  
    chksum= None  
    src= 127.0.0.1  
    dst= 127.0.0.1  
    \options\ 
&gt;&gt;&gt; i.dst = &quot;172.16.36.135&quot; 
&gt;&gt;&gt; i.display()
###[ IP ]###  
    version= 4  
    ihl= None  
    tos= 0x0  
    len= None  
    id= 1
    flags=   
    frag= 0  
    ttl= 64  
    proto= ip  
    chksum= None  
    src= 172.16.36.180  
    dst= 172.16.36.135  
    \options\
</code></pre><p>&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x7684; IP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;<code>IP</code>&#x5BF9;&#x8C61;&#x8D4B;&#x7ED9;&#x53D8;&#x91CF;<code>i</code>&#x3002;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>display</code>&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x914D;&#x7F6E;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x53D7;&#x5730;&#x5740;&#x90FD;&#x8BBE;&#x4E3A;&#x56DE;&#x9001;&#x5730;&#x5740;&#xFF0C;<code>127.0.0.1</code>&#x3002;&#x8FD9;&#x4E9B;&#x503C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x76EE;&#x6807;&#x5730;&#x5740;&#x6765;&#x4FEE;&#x6539;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BBE;&#x7F6E;<code>i.dst</code>&#x4E3A;&#x60F3;&#x8981;&#x626B;&#x63CF;&#x7684;&#x5730;&#x5740;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x3002;&#x901A;&#x8FC7;&#x518D;&#x6B21;&#x8C03;&#x7528;<code>dislay</code>&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E0D;&#x4EC5;&#x4EC5;&#x66F4;&#x65B0;&#x7684;&#x76EE;&#x6807;&#x5730;&#x5740;&#xFF0C;&#x4E5F;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x4E86;&#x548C;&#x9ED8;&#x8BA4;&#x63A5;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x6E90; IP &#x5730;&#x5740;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x4E86;&#x8BF7;&#x6C42;&#x7684; IP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6784;&#x5EFA; UDP &#x5C42;&#x4E86;&#x3002;</p>
<pre><code>&gt;&gt;&gt; u = UDP() 
&gt;&gt;&gt; u.display() 
###[ UDP ]###  
    sport= domain  
    dport= domain  
    len= None  
    chksum= None 
&gt;&gt;&gt; u.dport 
53
</code></pre><p>&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x7684; UDP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x548C; IP &#x5C42;&#x76F8;&#x540C;&#x7684;&#x6280;&#x5DE7;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x7ACB;&#x5373;&#x4E2D;&#xFF0C;<code>UDP</code>&#x5BF9;&#x8C61;&#x8D4B;&#x7ED9;&#x4E86;<code>u</code>&#x53D8;&#x91CF;&#x3002;&#x50CF;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x9ED8;&#x8BA4;&#x7684;&#x914D;&#x7F6E;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>display</code>&#x51FD;&#x6570;&#x6765;&#x786E;&#x5B9A;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6765;&#x6E90;&#x548C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x90FD;&#x662F;<code>domain</code>&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x731C;&#x5230;&#x4E86;&#xFF0C;&#x5B83;&#x8868;&#x793A;&#x548C;&#x7AEF;&#x53E3; 53 &#x76F8;&#x5173;&#x7684; DNS &#x670D;&#x52A1;&#x3002;DNS &#x662F;&#x4E2A;&#x5E38;&#x89C1;&#x670D;&#x52A1;&#xFF0C;&#x901A;&#x5E38;&#x80FD;&#x5728;&#x7F51;&#x7EDC;&#x7CFB;&#x7EDF;&#x4E0A;&#x53D1;&#x73B0;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x8BA4;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#x548C;&#x6570;&#x91CF;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x8BE5;&#x503C;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C06;&#x5C5E;&#x6027;&#x8BBE;&#x7F6E;&#x4E3A;&#x65B0;&#x7684;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x503C;&#x6765;&#x4FEE;&#x6539;&#x3002;</p>
<pre><code>&gt;&gt;&gt; u.dport = 123 
&gt;&gt;&gt; u.display() 
###[ UDP ]###
    sport= domain  
    dport= ntp  
    len= None  
    chksum= None
</code></pre><p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x8BBE;&#x4E3A;<code>123</code>&#xFF0C;&#x8FD9;&#x662F; NTP &#x7684;&#x7AEF;&#x53E3;&#x3002;&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86; IP &#x548C; UDP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x53E0;&#x653E;&#x8FD9;&#x4E9B;&#x5C42;&#x6765;&#x6784;&#x9020;&#x8BF7;&#x6C42;&#x3002;</p>
<pre><code>&gt;&gt;&gt; request = (i/u) 
&gt;&gt;&gt; request.display() 
###[ IP ]###  
    version= 4  
    ihl= None  
    tos= 0x0  
    len= None  
    id= 1  
    flags=   
    frag= 0  
    ttl= 64  
    proto= udp  
    chksum= None  
    src= 172.16.36.180  
    dst= 172.16.36.135  
    \options\ 
###[ UDP ]###     
    sport= domain     
    dport= ntp     
    len= None     
    chksum= None
</code></pre><p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x659C;&#x6760;&#x5206;&#x79BB;&#x53D8;&#x91CF;&#x6765;&#x53E0;&#x653E; IP &#x548C; UDP &#x5C42;&#x3002;&#x8FD9;&#x4E9B;&#x5C42;&#x9762;&#x4E4B;&#x540E;&#x8D4B;&#x7ED9;&#x4E86;&#x65B0;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x6574;&#x4E2A;&#x8BF7;&#x6C42;&#x3002;&#x6211;&#x4EEC;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x8C03;&#x7528;<code>dispaly</code>&#x51FD;&#x6570;&#x6765;&#x67E5;&#x770B;&#x8BF7;&#x6C42;&#x7684;&#x914D;&#x7F6E;&#x3002;&#x4E00;&#x65E6;&#x6784;&#x5EFA;&#x4E86;&#x8BF7;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;<code>sr1</code>&#x51FD;&#x6570;&#x6765;&#x5206;&#x6790;&#x54CD;&#x5E94;&#xFF1A;</p>
<pre><code>&gt;&gt;&gt; response = sr1(request) 
Begin emission: 
......Finished to send 1 packets. 
....*
Received 11 packets, got 1 answers, remaining 0 packets 
&gt;&gt;&gt; response.display() 
###[ IP ]###  
    version= 4L  
    ihl= 5L  
    tos= 0xc0  
    len= 56  
    id= 63687  
    flags=   
    frag= 0L  
    ttl= 64  
    proto= icmp  
    chksum= 0xdfe1  
    src= 172.16.36.135  
    dst= 172.16.36.180  
    \options\ 
###[ ICMP ]###     
    type= dest-unreach     
    code= port-unreachable     
    chksum= 0x9e72     
    unused= 0 
###[ IP in ICMP ]###        
    version= 4L        
    ihl= 5L        
    tos= 0x0        
    len= 28        
    id= 1        
    flags=         
    frag= 0L        
    ttl= 64        
    proto= udp        
    chksum= 0xd974        
    src= 172.16.36.180        
    dst= 172.16.36.135        
    \options\
###[ UDP in ICMP ]###           
    sport= domain           
    dport= ntp           
    len= 8           
    chksum= 0x5dd2
</code></pre><p>&#x76F8;&#x540C;&#x7684;&#x8BF7;&#x6C42;&#x53EF;&#x4EE5;&#x4E0D;&#x901A;&#x8FC7;&#x6784;&#x5EFA;&#x548C;&#x5806;&#x53E0;&#x6BCF;&#x4E00;&#x5C42;&#x6765;&#x6267;&#x884C;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5355;&#x72EC;&#x7684;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#xFF0C;&#x901A;&#x8FC7;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x5E76;&#x4F20;&#x9012;&#x5408;&#x9002;&#x7684;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code>&gt;&gt;&gt; sr1(IP(dst=&quot;172.16.36.135&quot;)/UDP(dport=123)) 
..Begin emission: 
...*Finished to send 1 packets.

Received 6 packets, got 1 answers, remaining 0 packets 
&lt;IP  version=4L ihl=5L tos=0xc0 len=56 id=63689 flags= frag=0L ttl=64 proto=icmp chksum=0xdfdf src=172.16.36.135 dst=172.16.36.180 options=[] |&lt;ICMP  type=dest-unreach code=port-unreachable chksum=0x9e72 unused=0 |&lt;IPerror  version=4L ihl=5L tos=0x0 len=28 id=1 flags= frag=0L ttl=64 proto=udp chksum=0xd974 src=172.16.36.180 dst=172.16.36.135 options=[] |&lt;UDPerror  sport=domain dport=ntp len=8 chksum=0x5dd2 |&gt;&gt;&gt;&gt;
</code></pre><p>&#x8981;&#x6CE8;&#x610F;&#x8FD9;&#x4E9B;&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#x5305;&#x62EC; ICMP &#x5C01;&#x5305;&#xFF0C;&#x5B83;&#x7684;<code>type</code>&#x8868;&#x793A;&#x4E3B;&#x673A;&#x4E0D;&#x53EF;&#x8FBE;&#xFF0C;&#x5B83;&#x7684;<code>code</code>&#x8868;&#x793A;&#x7AEF;&#x53E3;&#x4E0D;&#x53EF;&#x8FBE;&#x3002;&#x8FD9;&#x4E2A;&#x54CD;&#x5E94;&#x901A;&#x5E38;&#x5728; UDP &#x7AEF;&#x53E3;&#x5173;&#x95ED;&#x65F6;&#x8FD4;&#x56DE;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C1D;&#x8BD5;&#x4FEE;&#x6539;&#x8BF7;&#x6C42;&#xFF0C;&#x4F7F;&#x5176;&#x53D1;&#x9001;&#x5230;&#x5BF9;&#x5E94;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x771F;&#x6B63;&#x670D;&#x52A1;&#x7684;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x4FEE;&#x6539;&#x4F1A;<code>53</code>&#xFF0C;&#x4E4B;&#x540E;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>&gt;&gt;&gt; response = sr1(IP(dst=&quot;172.16.36.135&quot;)/UDP(dport=53),timeout=1,verbo se=1) 
Begin emission: 
Finished to send 1 packets.

Received 8 packets, got 0 answers, remaining 1 packets
</code></pre><p>&#x5F53;&#x76F8;&#x540C;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x5230;&#x771F;&#x6B63;&#x7684;&#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x56DE;&#x590D;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A; DNS &#x670D;&#x52A1;&#x8FD0;&#x884C;&#x5728;&#x7CFB;&#x7EDF;&#x7684; UDP &#x7AEF;&#x53E3; 53 &#x4E0A;&#xFF0C;&#x4EC5;&#x4EC5;&#x54CD;&#x5E94;&#x670D;&#x52A1;&#x7279;&#x5B9A;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x4E00;&#x5DEE;&#x5F02;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x626B;&#x63CF; ICMP &#x4E0D;&#x53EF;&#x8FBE;&#x54CD;&#x5E94;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x626B;&#x63CF;&#x65E0;&#x54CD;&#x5E94;&#x7684;&#x7AEF;&#x53E3;&#x6765;&#x786E;&#x5B9A;&#x6F5C;&#x5728;&#x7684;&#x670D;&#x52A1;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-comment">#!/usr/bin/python</span>

<span class="hljs-keyword">import</span> logging
logging.getLogger(<span class="hljs-string">&quot;scapy.runtime&quot;</span>).setLevel(logging.ERROR)

<span class="hljs-keyword">from</span> scapy.all <span class="hljs-keyword">import</span> * 
<span class="hljs-keyword">import</span> time 
<span class="hljs-keyword">import</span> sys

<span class="hljs-keyword">if</span> len(sys.argv) != <span class="hljs-number">4</span>:   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Usage - ./udp_scan.py [Target-IP] [First Port] [Last Port]&quot;</span>   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Example - ./udp_scan.py 10.0.0.5 1 100&quot;</span>   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Example will UDP port scan ports 1 through 100 on 10.0.0.5&quot;</span> 
sys.exit()

ip = sys.argv[<span class="hljs-number">1</span>] 
start = int(sys.argv[<span class="hljs-number">2</span>]) 
end = int(sys.argv[<span class="hljs-number">3</span>])

<span class="hljs-keyword">for</span> port <span class="hljs-keyword">in</span> range(start,end):   
    ans = sr1(IP(dst=ip)/UDP(dport=port),timeout=<span class="hljs-number">5</span>,verbose=<span class="hljs-number">0</span>)   
    time.sleep(<span class="hljs-number">1</span>)   
    <span class="hljs-keyword">if</span> ans == <span class="hljs-keyword">None</span>:      
        <span class="hljs-keyword">print</span> port   
    <span class="hljs-keyword">else</span>:      
        <span class="hljs-keyword">pass</span>
</code></pre>
<p>&#x4E0A;&#x9762;&#x7684; Python &#x811A;&#x672C;&#x5411;&#x5E8F;&#x5217;&#x4E2D;&#x524D;&#x4E00;&#x767E;&#x4E2A;&#x7AEF;&#x53E3;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x7AEF;&#x53E3;&#x53D1;&#x9001; UDP &#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x63A5;&#x53D7;&#x5230;&#x4EFB;&#x4F55;&#x54CD;&#x5E94;&#xFF0C;&#x7AEF;&#x53E3;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x5F00;&#x653E;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x6240;&#x6709;&#x4E0D;&#x8FD4;&#x56DE; ICMP &#x4E0D;&#x53EF;&#x8FBE;&#x54CD;&#x5E94;&#x7684;&#x7AEF;&#x53E3;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# chmod 777 udp_scan.py 
root@KaliLinux:~# ./udp_scan.py 
Usage - ./udp_scan.py [Target-IP] [First Port] [Last Port] 
Example - ./udp_scan.py 10.0.0.5 1 100 
Example will UDP port scan ports 1 through 100 on 10.0.0.5 
root@KaliLinux:~ # ./udp_scan.py 172.16.36.135 1 100 
53 
68 
69
</code></pre><p>&#x8D85;&#x65F6;&#x4E3A;<code>5</code>&#x79D2;&#x7528;&#x4E8E;&#x63A5;&#x53D7;&#x53D7;&#x5230; ICMP &#x4E0D;&#x53EF;&#x8FBE;&#x901F;&#x7387;&#x9650;&#x5236;&#x7684;&#x54CD;&#x5E94;&#x3002;&#x5373;&#x4F7F;&#x62E5;&#x6709;&#x4E86;&#x66F4;&#x5927;&#x7684;&#x54CD;&#x5E94;&#x63A5;&#x6536;&#x7A97;&#x53E3;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x626B;&#x63CF;&#x4ECD;&#x7136;&#x6709;&#x65F6;&#x4E0D;&#x53EF;&#x9760;&#x3002;&#x8FD9;&#x5C31;&#x662F; UDP &#x63A2;&#x6D4B;&#x626B;&#x63CF;&#x662F;&#x66F4;&#x52A0;&#x9AD8;&#x6548;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x4E2D;&#xFF0C;UDP &#x626B;&#x63CF;&#x901A;&#x8FC7;&#x8BC6;&#x522B;&#x4E0D;&#x56DE;&#x590D; ICMP &#x7AEF;&#x53E3;&#x4E0D;&#x53EF;&#x8FBE;&#x54CD;&#x5E94;&#x7684;&#x7AEF;&#x53E3;&#x6765;&#x8BC6;&#x522B;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x975E;&#x5E38;&#x8017;&#x8D39;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A; ICMP &#x7AEF;&#x53E3;&#x4E0D;&#x53EF;&#x8FBE;&#x54CD;&#x5E94;&#x901A;&#x5E38;&#x6709;&#x901F;&#x7387;&#x9650;&#x5236;&#x3002;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x751F;&#x6210;&#x8FD9;&#x79CD;&#x54CD;&#x5E94;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4F1A;&#x4E0D;&#x53EF;&#x9760;&#xFF0C;&#x5E76;&#x4E14; ICMP &#x901A;&#x5E38;&#x4F1A;&#x88AB;&#x9632;&#x706B;&#x5899;&#x8FC7;&#x6EE4;&#x3002;&#x66FF;&#x4EE3;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x670D;&#x52A1;&#x7279;&#x5B9A;&#x7684;&#x63A2;&#x9488;&#x6765;&#x8BF7;&#x6C42;&#x6B63;&#x9762;&#x7684;&#x54CD;&#x5E94;&#x3002;&#x8FD9;&#x4E2A;&#x6280;&#x5DE7;&#x4F1A;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4E24;&#x4E2A;&#x79D8;&#x7C4D;&#x4E2D;&#x5C55;&#x793A;&#x3002;</p>
<h2 id="34-nmap-udp-&#x626B;&#x63CF;">3.4 Nmap UDP &#x626B;&#x63CF;</h2>
<p>Nmap &#x62E5;&#x6709;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684; UDP &#x626B;&#x63CF;&#x7684;&#x9009;&#x9879;&#x3002;Nmap &#x7684; UDP &#x626B;&#x63CF;&#x65B9;&#x5F0F;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x6CE8;&#x5165;&#x670D;&#x52A1;&#x7279;&#x5B9A;&#x7684;&#x8C2D;&#x6CFD;&#x8BF7;&#x6C42;&#xFF0C;&#x6765;&#x8BF7;&#x6C42;&#x6B63;&#x9762;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x8BA4;&#x6307;&#x5B9A;&#x670D;&#x52A1;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x6765;&#x8BC6;&#x522B;&#x6D3B;&#x52A8;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x6F14;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Nmap UDP &#x626B;&#x63CF;&#x6765;&#x626B;&#x63CF;&#x5355;&#x4E00;&#x7AEF;&#x53E3;&#xFF0C;&#x591A;&#x4E2A;&#x7AEF;&#x53E3;&#xFF0C;&#x751A;&#x81F3;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C; UDP &#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C; UDP &#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Metasploitable2 &#x5B9E;&#x4F8B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>UDP &#x626B;&#x63CF;&#x901A;&#x5E38;&#x7531;&#x6311;&#x6218;&#x6027;&#xFF0C;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#xFF0C;&#x975E;&#x5E38;&#x9EBB;&#x70E6;&#x3002;&#x8BB8;&#x591A;&#x7CFB;&#x7EDF;&#x4F1A;&#x9650;&#x5236; ICMp &#x4E3B;&#x673A;&#x4E0D;&#x53EF;&#x8FBE;&#x54CD;&#x5E94;&#xFF0C;&#x5E76;&#x4E14;&#x589E;&#x52A0;&#x626B;&#x63CF;&#x5927;&#x91CF;&#x7AEF;&#x53E3;&#x6216;&#x7CFB;&#x7EDF;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#x603B;&#x6570;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;Nmap &#x7684;&#x5F00;&#x53D1;&#x8005;&#x62E5;&#x6709;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x548C;&#x9AD8;&#x6548;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x8BC6;&#x522B;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684; UDP &#x670D;&#x52A1;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C; UDP &#x626B;&#x63CF;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;<code>-sU</code>&#x9009;&#x9879;&#xFF0C;&#x5E76;&#x5E26;&#x4E0A;&#x9700;&#x8981;&#x626B;&#x63CF;&#x7684;&#x4E3B;&#x673A; IP &#x5730;&#x5740;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap -sU 172.16.36.135

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:04 EST
Nmap scan report for 172.16.36.135 
Host is up (0.0016s latency). 
Not shown: 993 closed ports 
PORT     STATE         SERVICE 
53/udp   open          domain
68/udp   open|filtered dhcpc 
69/udp   open|filtered tftp 
111/udp  open          rpcbind 
137/udp  open          netbios-ns 
138/udp  open|filtered netbios-dgm 
2049/udp open          nfs 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 1043.91 seconds
</code></pre><p>&#x867D;&#x7136; Nmap &#x4F7F;&#x7528;&#x9488;&#x5BF9;&#x591A;&#x79CD;&#x670D;&#x52A1;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x8F7D;&#x8377;&#x6765;&#x8BF7;&#x6C42; UDP &#x7AEF;&#x53E3;&#x7684;&#x54CD;&#x5E94;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x5176;&#x5B83;&#x53C2;&#x6570;&#x6765;&#x6307;&#x5B9A;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x65F6;&#xFF0C;&#x5B83;&#x4ECD;&#x65E7;&#x9700;&#x8981;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x6765;&#x626B;&#x63CF;&#x9ED8;&#x8BA4;&#x7684; 1000 &#x4E2A;&#x7AEF;&#x53E3;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x626B;&#x63CF;&#x5143;&#x6570;&#x636E;&#x4E2D;&#x770B;&#x5230;&#xFF0C;&#x9ED8;&#x8BA4;&#x7684;&#x626B;&#x63CF;&#x9700;&#x8981;&#x5C06;&#x8FD1; 20 &#x5206;&#x949F;&#x6765;&#x5B8C;&#x6210;&#x3002;&#x4F5C;&#x4E3A;&#x66FF;&#x4EE3;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7F29;&#x77ED;&#x6240;&#x9700;&#x7684;&#x626B;&#x63CF;&#x65F6;&#x95F4;&#xFF0C;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4E0B;&#x5217;&#x540D;Ingles&#x6267;&#x884C;&#x9488;&#x5BF9;&#x6027;&#x626B;&#x63CF;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nmap 172.16.36.135 -sU -p 53


Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:05 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.0010s latency). 
PORT   STATE SERVICE 53/udp open  
domain MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 13.09 seconds
</code></pre><p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6307;&#x5B9A;&#x4E86;&#x9700;&#x8981;&#x626B;&#x63CF;&#x7684;&#x7279;&#x5B9A;&#x7AEF;&#x53E3;&#xFF0C;&#x6267;&#x884C; UDP &#x626B;&#x63CF;&#x6240;&#x9700;&#x7684;&#x7684;&#x65F6;&#x95F4;&#x603B;&#x91CF;&#x53EF;&#x4EE5;&#x6781;&#x5927;&#x6C5F;&#x5C11;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6267;&#x884C; UDP &#x626B;&#x63CF;&#x5E76;&#x4E14;&#x4F7F;&#x7528;<code>-p</code>&#x9009;&#x9879;&#x6307;&#x5B9A;&#x7AEF;&#x53E3;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4EC5;&#x4EC5;&#x5728;<code>53</code>&#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x626B;&#x63CF;&#xFF0C;&#x6765;&#x5C1D;&#x8BD5;&#x8BC6;&#x522B; DNS &#x670D;&#x52A1;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x591A;&#x4E2A;&#x6307;&#x5B9A;&#x7684;&#x7AEF;&#x53E3;&#x4E0A;&#x6307;&#x5B9A;&#x626B;&#x63CF;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nmap 172.16.36.135 -sU -p 1-100

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:06 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00054s latency). 
Not shown: 85 open|filtered ports
PORT   STATE  SERVICE 
8/udp  closed unknown 
15/udp closed unknown 
28/udp closed unknown 
37/udp closed time 
45/udp closed mpm 
49/udp closed tacacs 
53/udp open   domain 
56/udp closed xns-auth 
70/udp closed gopher 
71/udp closed netrjs-1 
74/udp closed netrjs-4 
89/udp closed su-mit-tg 
90/udp closed dnsix 
95/udp closed supdup 
96/udp closed dixie 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 23.56 seconds
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x626B;&#x63CF;&#x5728;&#x524D; 100 &#x4E2A;&#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x7834;&#x6298;&#x53F7;&#x7B26;&#x53F7;&#xFF0C;&#x5E76;&#x6307;&#x5B9A;&#x8981;&#x626B;&#x63CF;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x6765;&#x5B8C;&#x6210;&#x3002;Nmap &#x4E4B;&#x540E;&#x542F;&#x52A8;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x4F1A;&#x540C;&#x65F6;&#x626B;&#x63CF;&#x8FD9;&#x4E24;&#x4E2A;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x591A;&#x6709;&#x7AEF;&#x53E3;&#x3002;&#x5728;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;UDP &#x5206;&#x6790;&#x9700;&#x8981;&#x5728;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E0A;&#x6267;&#x884C;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7834;&#x6298;&#x53F7;&#x7B26;&#x53F7;&#xFF0C;&#x5E76;&#x4E14;&#x5B9A;&#x4E49;&#x6700;&#x540E;&#x4E00;&#x4E2A; IP &#x6BB5;&#x7684;&#x503C;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x6765;&#x626B;&#x63CF;&#x8303;&#x56F4;&#x5185;&#x7684;&#x4E3B;&#x673A;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap 172.16.36.0-255 -sU -p 53

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:08 EST 
Nmap scan report for 172.16.36.1 
Host is up (0.00020s latency). 
PORT   STATE  SERVICE 
53/udp closed domain 
MAC Address: 00:50:56:C0:00:08 (VMware)

Nmap scan report for 172.16.36.2 
Host is up (0.039s latency).
PORT   STATE  SERVICE 
53/udp closed domain 
MAC Address: 00:50:56:FF:2A:8E (VMware)

Nmap scan report for 172.16.36.132 
Host is up (0.00065s latency). 
PORT   STATE  SERVICE 
53/udp closed domain 
MAC Address: 00:0C:29:65:FC:D2 (VMware)

Nmap scan report for 172.16.36.135 
Host is up (0.00028s latency). 
PORT   STATE SERVICE 
53/udp open  domain 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 256 IP addresses (6 hosts up) scanned in 42.81 seconds
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x626B;&#x63CF;&#x5BF9;<code>172.16.36.0/24</code>&#x4E2D;&#x6240;&#x6709;&#x6D3B;&#x52A8;&#x4E3B;&#x673A;&#x6267;&#x884C;&#x3002;&#x6BCF;&#x4E2A;&#x4E3B;&#x673A;&#x90FD;&#x88AB;&#x626B;&#x63CF;&#x6765;&#x8BC6;&#x522B;&#x662F;&#x5426;&#x5728; 53 &#x7AEF;&#x53E3;&#x4E0A;&#x8FD0;&#x884C;&#x4E86; DNS &#x670D;&#x52A1;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x626B;&#x63CF;&#x591A;&#x4E2A;&#x4E3B;&#x673A;&#x66FF;&#x4EE3;&#x9009;&#x9879;&#xFF0C;&#x5C31;&#x662F;&#x4F7F;&#x7528; IP &#x5730;&#x5740;&#x8F93;&#x5165;&#x5217;&#x8868;&#x3002;&#x4E3A;&#x4E86;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x4F7F;&#x7528;<code>-iL</code>&#x9009;&#x9879;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x4F20;&#x5165;&#x76F8;&#x540C;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x79F0;&#xFF0C;&#x6216;&#x8005;&#x5355;&#x72EC;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x5B8C;&#x6210;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x3002;&#x524D;&#x8005;&#x7684;&#x4F8B;&#x5B50;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nmap -iL iplist.txt -sU -p 123

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:16 EST 
Nmap scan report for 172.16.36.1 
Host is up (0.00017s latency). 
PORT    STATE SERVICE 
123/udp open  ntp 
MAC Address: 00:50:56:C0:00:08 (VMware)

Nmap scan report for 172.16.36.2 
Host is up (0.00025s latency). 
PORT    STATE         SERVICE 
123/udp open|filtered ntp
MAC Address: 00:50:56:FF:2A:8E (VMware)

Nmap scan report for 172.16.36.132 
Host is up (0.00040s latency). 
PORT    STATE  SERVICE 
123/udp closed ntp 
MAC Address: 00:0C:29:65:FC:D2 (VMware)

Nmap scan report for 172.16.36.135 
Host is up (0.00031s latency). 
PORT    STATE  SERVICE 
123/udp closed ntp 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 4 IP addresses (4 hosts up) scanned in 13.27 seconds
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6267;&#x884C;&#x4E86;&#x626B;&#x63CF;&#x6765;&#x5224;&#x65AD; NTP &#x670D;&#x52A1;&#x662F;&#x5426;&#x8FD0;&#x884C;&#x5728;&#x5F53;&#x524D;&#x6267;&#x884C;&#x76EE;&#x5F55;&#x4E2D;&#x7684;<code>iplist.txt</code>&#x6587;&#x4EF6;&#x5185;&#x7684;&#x4EFB;&#x4F55;&#x7CFB;&#x7EDF;&#x7684; 123 &#x7AEF;&#x53E3;&#x4E0A;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x867D;&#x7136; Nmap &#x4ECD;&#x7136;&#x542B;&#x6709;&#x8BB8;&#x591A;&#x548C; UDP &#x626B;&#x63CF;&#x76F8;&#x5173;&#x7684;&#x76F8;&#x540C;&#x6311;&#x6218;&#xFF0C;&#x5B83;&#x4ECD;&#x65E7;&#x662F;&#x4E2A;&#x6781;&#x5176;&#x9AD8;&#x6548;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F7F;&#x7528;&#x6700;&#x9AD8;&#x6548;&#x548C;&#x5FEB;&#x901F;&#x7684;&#x6280;&#x5DE7;&#x7EC4;&#x5408;&#x6765;&#x8BC6;&#x522B;&#x6D3B;&#x52A8;&#x670D;&#x52A1;&#x3002;</p>
<h2 id="35-metasploit-udp-&#x626B;&#x63CF;">3.5 Metasploit UDP &#x626B;&#x63CF;</h2>
<p>Metasploit &#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x626B;&#x63CF;&#x7279;&#x5B9A;&#x7684;&#x5E38;&#x7528; UDP &#x7AEF;&#x53E3;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#x6765;&#x626B;&#x63CF;&#x8FD0;&#x884C; UDP &#x670D;&#x52A1;&#x7684;&#x5355;&#x4E2A;&#x7CFB;&#x7EDF;&#x6216;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Metasploit &#x6267;&#x884C; UDP &#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C; UDP &#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Metasploitable2 &#x5B9E;&#x4F8B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x5728;&#x5B9A;&#x4E49;&#x6240;&#x8FD0;&#x884C;&#x7684;&#x6A21;&#x5757;&#x4E4B;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x6253;&#x5F00; Metasploit&#x3002;&#x4E3A;&#x4E86;&#x5728; Kali &#x4E2D;&#x6253;&#x5F00;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7EC8;&#x7AEF;&#x4F1A;&#x8BDD;&#x4E2D;&#x6267;&#x884C;<code>msfconsole</code>&#x547D;&#x4EE4;&#x3002;</p>
<pre><code>root@KaliLinux:~# msfconsole 
# cowsay++
 ____________
 &lt; metasploit &gt;
 -----------
        \   ,__,       
         \  (oo)____           
            (__)    )\           
               ||--|| *

Large pentest? List, sort, group, tag and search your hosts and services in Metasploit Pro -- type &apos;go_pro&apos; to launch it now.

       =[ metasploit v4.6.0-dev [core:4.6 api:1.0] 
+ -- --=[ 1053 exploits - 590 auxiliary - 174 post 
+ -- --=[ 275 payloads - 28 encoders - 8 nops

msf &gt; use auxiliary/scanner/discovery/udp_sweep 
msf  auxiliary(udp_sweep) &gt; show options

Module options (auxiliary/scanner/discovery/udp_sweep):

    Name       Current Setting  Required  Description   
    ----       ---------------  --------  ----------   
    BATCHSIZE  256              yes       The number of hosts to probe in each set   
    CHOST                       no        The local client address   
    RHOSTS                      yes       The target address range or CIDR identifier   
    THREADS    1                yes       The number of concurrent threads
</code></pre><p>&#x4E3A;&#x4E86;&#x5728; Metasploit &#x4E2D;&#x8FD0;&#x884C; UDP &#x626B;&#x63CF;&#x6A21;&#x5757;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x6A21;&#x5757;&#x7684;&#x76F8;&#x5BF9;&#x8DEF;&#x5F84;&#x8C03;&#x7528;<code>use</code>&#x547D;&#x4EE4;&#x3002;&#x4E00;&#x65E6;&#x9009;&#x62E9;&#x4E86;&#x6A21;&#x5757;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>show options</code>&#x547D;&#x4EE4;&#x6765;&#x786E;&#x8BA4;&#x6216;&#x66F4;&#x6539;&#x626B;&#x63CF;&#x914D;&#x7F6E;&#x3002;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x4F1A;&#x5C55;&#x793A;&#x56DB;&#x4E2A;&#x5217;&#x7684;&#x8868;&#x683C;&#xFF0C;&#x5305;&#x62EC;<code>name</code>&#x3001;<code>current settings</code>&#x3001;<code>required</code>&#x548C;<code>description</code>&#x3002;<code>name</code>&#x5217;&#x6807;&#x51FA;&#x4E86;&#x6BCF;&#x4E2A;&#x53EF;&#x914D;&#x7F6E;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x3002;<code>current settings</code>&#x5217;&#x5217;&#x51FA;&#x4E86;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x53D8;&#x91CF;&#x7684;&#x73B0;&#x6709;&#x914D;&#x7F6E;&#x3002;<code>required</code>&#x5217;&#x6807;&#x51FA;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x53D8;&#x91CF;&#xFF0C;&#x503C;&#x662F;&#x5426;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x3002;<code>description</code>&#x5217;&#x63CF;&#x8FF0;&#x4E86;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>set</code>&#x547D;&#x4EE4;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x65B0;&#x7684;&#x503C;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x6765;&#x4FEE;&#x6539;&#x3002;</p>
<pre><code>msf  auxiliary(udp_sweep) &gt; set RHOSTS 172.16.36.135 
RHOSTS =&gt; 172.16.36.135 
msf  auxiliary(udp_sweep) &gt; set THREADS 20 
THREADS =&gt; 20 
msf  auxiliary(udp_sweep) &gt; show options

Module options (auxiliary/scanner/discovery/udp_sweep):

    Name       Current Setting  Required  Description   
    ----       ---------------  --------  ----------   
    BATCHSIZE  256              yes       The number of hosts to probe in each set   
    CHOST                       no        The local client address   
    RHOSTS     172.16.36.135    yes       The target address range or CIDR identifier   
    THREADS    20               yes       The number of concurrent threads
</code></pre><p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>RHOSTS</code>&#x503C;&#x4FEE;&#x6539;&#x4E3A;&#x6211;&#x4EEC;&#x6253;&#x7B97;&#x626B;&#x63CF;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684; IP &#x5730;&#x5740;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x4FEE;&#x6539;&#x4E3A; 20&#x3002;<code>THREADS</code>&#x7684;&#x503C;&#x5B9A;&#x4E49;&#x4E86;&#x5728;&#x540E;&#x53F0;&#x6267;&#x884C;&#x7684;&#x5F53;&#x524D;&#x4EFB;&#x52A1;&#x6570;&#x91CF;&#x3002;&#x786E;&#x5B9A;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x6D89;&#x53CA;&#x5230;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x5E73;&#x8861;&#xFF0C;&#x65E2;&#x80FD;&#x63D0;&#x5347;&#x4EFB;&#x52A1;&#x901F;&#x5EA6;&#xFF0C;&#x53C8;&#x4E0D;&#x4F1A;&#x8FC7;&#x5EA6;&#x6D88;&#x8017;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x3002;&#x5BF9;&#x4E8E;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#xFF0C;20 &#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x8DB3;&#x591F;&#x5FEB;&#xFF0C;&#x5E76;&#x4E14;&#x76F8;&#x5F53;&#x5408;&#x7406;&#x3002;&#x4FEE;&#x6539;&#x4E86;&#x5FC5;&#x8981;&#x7684;&#x53D8;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x4F7F;&#x7528;<code>show options</code>&#x547D;&#x4EE4;&#x6765;&#x9A8C;&#x8BC1;&#x3002;&#x4E00;&#x65E6;&#x6240;&#x9700;&#x914D;&#x7F6E;&#x9A8C;&#x8BC1;&#x5B8C;&#x6BD5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x626B;&#x63CF;&#x4E86;&#x3002;</p>
<pre><code>msf  auxiliary(udp_sweep) &gt; run

[*] Sending 12 probes to 172.16.36.135-&gt;172.16.36.135 (1 hosts) 
[*] Discovered Portmap on 172.16.36.135:111 (100000 v2 TCP(111), 100000 v2 UDP(111), 100024 v1 UDP(36429), 100024 v1 TCP(56375), 100003 v2 UDP(2049), 100003 v3 UDP(2049), 100003 v4 UDP(2049), 100021 v1 UDP(34241), 100021 v3 UDP(34241), 100021 v4 UDP(34241), 100003 v2 TCP(2049), 100003 v3 TCP(2049), 100003 v4 TCP(2049), 100021 v1 TCP(50333), 100021 v3 TCP(50333), 100021 v4 TCP(50333), 100005 v1 UDP(47083), 100005 v1 TCP(57385), 100005 v2 UDP(47083), 100005 v2 TCP(57385), 100005 v3 UDP(47083), 100005 v3 TCP(57385)) 
[*] Discovered NetBIOS on 172.16.36.135:137 (METASPLOITABLE:&lt;00&gt;:U :METASPLOITABLE:&lt;03&gt;:U :METASPLOITABLE:&lt;20&gt;:U :__MSBROWSE__:&lt;01&gt;:G :WORKGROUP:&lt;00&gt;:G :WORKGROUP:&lt;1d&gt;:U :WORKGROUP:&lt;1e&gt;:G :00:00:00:00:00:00) 
[*] Discovered DNS on 172.16.36.135:53 (BIND 9.4.2) 
[*] Scanned 1 of 1 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><p>Metasploit &#x4E2D;&#x6240;&#x4F7F;&#x7528;&#x7684;<code>run</code>&#x547D;&#x4EE4;&#x7528;&#x4E8E;&#x6267;&#x884C;&#x6240;&#x9009;&#x7684;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>run</code>&#x547D;&#x4EE4;&#x5BF9;&#x6307;&#x5B9A;&#x7684; IP &#x5730;&#x5740;&#x6267;&#x884C; UDP &#x626B;&#x63CF;&#x3002;<code>udp_sweep</code>&#x6A21;&#x5757;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7834;&#x6298;&#x53F7;&#x7B26;&#x53F7;&#xFF0C;&#x5BF9;&#x5730;&#x5740;&#x5E8F;&#x5217;&#x6267;&#x884C;&#x626B;&#x63CF;&#x3002;</p>
<pre><code>msf  auxiliary(udp_sweep) &gt; set RHOSTS 172.16.36.1-10 
RHOSTS =&gt; 172.16.36.1-10 
msf  auxiliary(udp_sweep) &gt; show options

Module options (auxiliary/scanner/discovery/udp_sweep):

    Name       Current Setting  Required  Description   
    ----       ---------------  --------  ----------   
    BATCHSIZE  256              yes       The number of hosts to probe in each set   
    CHOST                       no        The local client address   
    RHOSTS     172.16.36.1-10   yes       The target address range or CIDR identifier   
    THREADS    20               yes       The number of concurrent threads

msf  auxiliary(udp_sweep) &gt; run

[*] Sending 12 probes to 172.16.36.1-&gt;172.16.36.10 (10 hosts) 
[*] Discovered NetBIOS on 172.16.36.1:137 (MACBOOKPRO-3E0F:&lt;00&gt;:U :00:50:56:c0:00:08) 
[*] Discovered NTP on 172.16.36.1:123 (NTP v4 (unsynchronized)) 
[*] Discovered DNS on 172.16.36.2:53 (BIND 9.3.6-P1-RedHat-9.3.6-20. P1.el5_8.6)
[*] Scanned 10 of 10 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;UDP &#x626B;&#x63CF;&#x5BF9; 10 &#x4E2A;&#x4E3B;&#x673A;&#x5730;&#x5740;&#x6267;&#x884C;&#xFF0C;&#x5B83;&#x4EEC;&#x7531;<code>RHOSTS</code>&#x53D8;&#x91CF;&#x6307;&#x5B9A;&#x3002;&#x4E0E;&#x4E4B;&#x76F8;&#x4F3C;&#xFF0C;<code>RHOSTS</code>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>CIDR</code>&#x8BB0;&#x6CD5;&#x6765;&#x5B9A;&#x4E49;&#x7F51;&#x7EDC;&#x8303;&#x56F4;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>msf  auxiliary(udp_sweep) &gt; set RHOSTS 172.16.36.0/24 
RHOSTS =&gt; 172.16.36.0/24 
msf  auxiliary(udp_sweep) &gt; show options

Module options (auxiliary/scanner/discovery/udp_sweep):

   Name       Current Setting  Required  Description   
   ----       ---------------  --------  ----------   
   BATCHSIZE  256              yes       The number of hosts to probe in each set   
   CHOST                       no        The local client address   
   RHOSTS     172.16.36.0/24   yes       The target address range or CIDR identifier   
   THREADS    20               yes       The number of concurrent threads

msf  auxiliary(udp_sweep) &gt; run

[*] Sending 12 probes to 172.16.36.0-&gt;172.16.36.255 (256 hosts) 
[*] Discovered Portmap on 172.16.36.135:111 (100000 v2 TCP(111), 100000 v2 UDP(111), 100024 v1 UDP(36429), 100024 v1 TCP(56375), 100003 v2 UDP(2049), 100003 v3 UDP(2049), 100003 v4 UDP(2049), 100021 v1 UDP(34241), 100021 v3 UDP(34241), 100021 v4 UDP(34241), 100003 v2 TCP(2049), 100003 v3 TCP(2049), 100003 v4 TCP(2049), 100021 v1 TCP(50333), 100021 v3 TCP(50333), 100021 v4 TCP(50333), 100005 v1 UDP(47083), 100005 v1 TCP(57385), 100005 v2 UDP(47083), 100005 v2 TCP(57385), 100005 v3 UDP(47083), 100005 v3 TCP(57385)) 
[*] Discovered NetBIOS on 172.16.36.135:137 (METASPLOITABLE:&lt;00&gt;:U :METASPLOITABLE:&lt;03&gt;:U :METASPLOITABLE:&lt;20&gt;:U :__MSBROWSE__:&lt;01&gt;:G :WORKGROUP:&lt;00&gt;:G :WORKGROUP:&lt;1d&gt;:U :WORKGROUP:&lt;1e&gt;:G :00:00:00:00:00:00) 
[*] Discovered NTP on 172.16.36.1:123 (NTP v4 (unsynchronized)) 
[*] Discovered NetBIOS on 172.16.36.1:137 (MACBOOKPRO-3E0F:&lt;00&gt;:U :00:50:56:c0:00:08) [*] Discovered DNS on 172.16.36.0:53 (BIND 9.3.6-P1-RedHat-9.3.6-20. P1.el5_8.6)

[*] Discovered DNS on 172.16.36.2:53 (BIND 9.3.6-P1-RedHat-9.3.6-20. P1.el5_8.6) 
[*] Discovered DNS on 172.16.36.135:53 (BIND 9.4.2) 
[*] Discovered DNS on 172.16.36.255:53 (BIND 9.3.6-P1-RedHat-9.3.6-20. P1.el5_8.6) 
[*] Scanned 256 of 256 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Metasploit &#x8F85;&#x52A9;&#x6A21;&#x5757;&#x4E2D;&#x7684; UDP &#x626B;&#x63CF;&#x6BD4;&#x8D77; Nmap &#x66F4;&#x52A0;&#x7B80;&#x5355;&#x3002;&#x5B83;&#x4EC5;&#x4EC5;&#x9488;&#x5BF9;&#x6709;&#x9650;&#x7684;&#x670D;&#x52A1;&#x6570;&#x91CF;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8BC6;&#x522B;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x6D3B;&#x52A8;&#x670D;&#x52A1;&#x65B9;&#x9762;&#x66F4;&#x52A0;&#x9AD8;&#x6548;&#xFF0C;&#x5E76;&#x4E14;&#x6BD4;&#x5176;&#x5B83;&#x53EF;&#x7528;&#x7684; UDP &#x626B;&#x63CF;&#x5668;&#x66F4;&#x5FEB;&#x3002;</p>
<h2 id="36-scapy-&#x9690;&#x79D8;&#x626B;&#x63CF;">3.6 Scapy &#x9690;&#x79D8;&#x626B;&#x63CF;</h2>
<p>&#x6267;&#x884C; TCP &#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x6267;&#x884C;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x4E0A;&#x7684; TCP &#x4E09;&#x6B21;&#x63E1;&#x624B;&#x7528;&#x4E8E;&#x8BC6;&#x522B;&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x63A5;&#x53D7;&#x8FDE;&#x63A5;&#x3002;&#x8FD9;&#x4E00;&#x7C7B;&#x578B;&#x7684;&#x626B;&#x63CF;&#x6307;&#x4EE3;&#x9690;&#x79D8;&#x626B;&#x63CF;&#xFF0C; SYN &#x626B;&#x63CF;&#xFF0C;&#x6216;&#x8005;&#x534A;&#x5F00;&#x653E;&#x626B;&#x63CF;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x6F14;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Scapy &#x6267;&#x884C; TCP &#x9690;&#x79D8;&#x626B;&#x63CF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Scapy &#x6267;&#x884C; TCP &#x9690;&#x79D8; &#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C; TCP &#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Metasploitable2 &#x5B9E;&#x4F8B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E00;&#x8282;&#x4E5F;&#x9700;&#x8981;&#x7F16;&#x5199;&#x811A;&#x672C;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;*VIM &#x548C; Nano&#xFF09;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E3A;&#x4E86;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x6267;&#x884C; SYN &#x626B;&#x63CF;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F7F;&#x7528; Scapy &#x6784;&#x9020; TCP SYN &#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x8BC6;&#x522B;&#x548C;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x3001;&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x4EE5;&#x53CA;&#x65E0;&#x54CD;&#x5E94;&#x7CFB;&#x7EDF;&#x6709;&#x5173;&#x7684;&#x54CD;&#x5E94;&#x3002;&#x4E3A;&#x4E86;&#x5411;&#x7ED9;&#x5B9A;&#x7AEF;&#x53E3;&#x53D1;&#x9001; TCP SYN &#x8BF7;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x7684;&#x5404;&#x4E2A;&#x5C42;&#x9762;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6784;&#x5EFA;&#x7684;&#x7B2C;&#x4E00;&#x5C42;&#x5C31;&#x662F; IP &#x5C42;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# scapy 
Welcome to Scapy (2.2.0) 
&gt;&gt;&gt; i = IP() 
&gt;&gt;&gt; i.display()
###[ IP ]###  
    version= 4  
    ihl= None  
    tos= 0x0  
    len= None  
    id= 1  
    flags=   
    frag= 0  
    ttl= 64  
    proto= ip  
    chksum= None  
    src= 127.0.0.1  
    dst= 127.0.0.1  
    \options\ 
&gt;&gt;&gt; i.dst = &quot;172.16.36.135&quot; 
&gt;&gt;&gt; i.display() 
###[ IP ]###  
    version= 4  
    ihl= None  
    tos= 0x0  
    len= None  
    id= 1  
    flags=   
    frag= 0  
    ttl= 64  
    proto= ip  
    chksum= None  
    src= 172.16.36.180  
    dst= 172.16.36.135  
    \options\
</code></pre><p>&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x7684; IP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;<code>IP</code>&#x5BF9;&#x8C61;&#x8D4B;&#x7ED9;&#x53D8;&#x91CF;<code>i</code>&#x3002;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>display</code>&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x914D;&#x7F6E;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x53D7;&#x5730;&#x5740;&#x90FD;&#x8BBE;&#x4E3A;&#x56DE;&#x9001;&#x5730;&#x5740;&#xFF0C;<code>127.0.0.1</code>&#x3002;&#x8FD9;&#x4E9B;&#x503C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x76EE;&#x6807;&#x5730;&#x5740;&#x6765;&#x4FEE;&#x6539;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BBE;&#x7F6E;<code>i.dst</code>&#x4E3A;&#x60F3;&#x8981;&#x626B;&#x63CF;&#x7684;&#x5730;&#x5740;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x3002;&#x901A;&#x8FC7;&#x518D;&#x6B21;&#x8C03;&#x7528;<code>dislay</code>&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E0D;&#x4EC5;&#x4EC5;&#x66F4;&#x65B0;&#x7684;&#x76EE;&#x6807;&#x5730;&#x5740;&#xFF0C;&#x4E5F;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x4E86;&#x548C;&#x9ED8;&#x8BA4;&#x63A5;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x6E90; IP &#x5730;&#x5740;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x4E86;&#x8BF7;&#x6C42;&#x7684; IP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6784;&#x5EFA; TCP &#x5C42;&#x4E86;&#x3002;</p>
<pre><code>&gt;&gt;&gt; t = TCP() 
&gt;&gt;&gt; t.display() 
###[ TCP ]###  
    sport= ftp_data  
    dport= http  
    seq= 0  
    ack= 0  
    dataofs= None  
    reserved= 0  
    flags= S  
    window= 8192  
    chksum= None  
    urgptr= 0  
    options= {}
</code></pre><p>&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x7684; TCP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x548C; IP &#x5C42;&#x76F8;&#x540C;&#x7684;&#x6280;&#x5DE7;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x7ACB;&#x5373;&#x4E2D;&#xFF0C;<code>TCP</code>&#x5BF9;&#x8C61;&#x8D4B;&#x7ED9;&#x4E86;<code>t</code>&#x53D8;&#x91CF;&#x3002;&#x50CF;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x9ED8;&#x8BA4;&#x7684;&#x914D;&#x7F6E;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>display</code>&#x51FD;&#x6570;&#x6765;&#x786E;&#x5B9A;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x4E3A; HTTP &#x7AEF;&#x53E3; 80&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x9996;&#x6B21;&#x626B;&#x63CF;&#xFF0C;&#x6211;&#x4EEC;&#x5C06; TCP &#x8BBE;&#x7F6E;&#x4FDD;&#x7559;&#x9ED8;&#x8BA4;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86; TCP &#x548C; IP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x5B83;&#x4EEC;&#x53E0;&#x653E;&#x6765;&#x6784;&#x9020;&#x8BF7;&#x6C42;&#x3002;</p>
<pre><code>&gt;&gt;&gt; request = (i/t) 
&gt;&gt;&gt; request.display() 
###[ IP ]###  
    version= 4  
    ihl= None  
    tos= 0x0  
    len= None  
    id= 1
    flags=   
    frag= 0  
    ttl= 64  
    proto= tcp  
    chksum= None  
    src= 172.16.36.180  
    dst= 172.16.36.135  
    \options\ 
###[ TCP ]###     
    sport= ftp_data     
    dport= http     
    seq= 0     
    ack= 0     
    dataofs= None     
    reserved= 0     
    flags= S     
    window= 8192     
    chksum= None     
    urgptr= 0     
    options= {}
</code></pre><p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x659C;&#x6760;&#x5206;&#x79BB;&#x53D8;&#x91CF;&#x6765;&#x53E0;&#x653E; IP &#x548C; TCP &#x5C42;&#x3002;&#x8FD9;&#x4E9B;&#x5C42;&#x9762;&#x4E4B;&#x540E;&#x8D4B;&#x7ED9;&#x4E86;&#x65B0;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x6574;&#x4E2A;&#x8BF7;&#x6C42;&#x3002;&#x6211;&#x4EEC;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x8C03;&#x7528;<code>dispaly</code>&#x51FD;&#x6570;&#x6765;&#x67E5;&#x770B;&#x8BF7;&#x6C42;&#x7684;&#x914D;&#x7F6E;&#x3002;&#x4E00;&#x65E6;&#x6784;&#x5EFA;&#x4E86;&#x8BF7;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;<code>sr1</code>&#x51FD;&#x6570;&#x6765;&#x5206;&#x6790;&#x54CD;&#x5E94;&#xFF1A;</p>
<pre><code>&gt;&gt;&gt; response = sr1(request) 
...Begin emission: 
........Finished to send 1 packets. 
....* 
Received 16 packets, got 1 answers, remaining 0 packets 
&gt;&gt;&gt; response.display() 
###[ IP ]###  
    version= 4L  
    ihl= 5L  
    tos= 0x0  
    len= 44
    id= 0  
    flags= DF  
    frag= 0L  
    ttl= 64  
    proto= tcp  
    chksum= 0x9970  
    src= 172.16.36.135  
    dst= 172.16.36.180  
    \options\ 
###[ TCP ]###     
    sport= http     
    dport= ftp_data     
    seq= 2848210323L     
    ack= 1     
    dataofs= 6L     
    reserved= 0L     
    flags= SA     
    window= 5840     
    chksum= 0xf82d     
    urgptr= 0     
    options= [(&apos;MSS&apos;, 1460)] 
###[ Padding ]###        
    load= &apos;\x00\x00&apos;
</code></pre><p>&#x76F8;&#x540C;&#x7684;&#x8BF7;&#x6C42;&#x53EF;&#x4EE5;&#x4E0D;&#x901A;&#x8FC7;&#x6784;&#x5EFA;&#x548C;&#x5806;&#x53E0;&#x6BCF;&#x4E00;&#x5C42;&#x6765;&#x6267;&#x884C;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5355;&#x72EC;&#x7684;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#xFF0C;&#x901A;&#x8FC7;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x5E76;&#x4F20;&#x9012;&#x5408;&#x9002;&#x7684;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code>&gt;&gt;&gt; sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=80)) 
.Begin emission: .............Finished to send 1 packets. 
....* 
Received 19 packets, got 1 answers, remaining 0 packets 
&lt;IP  version=4L ihl=5L tos=0x0 len=44 id=0 flags=DF frag=0L ttl=64 proto=tcp chksum=0x9970 src=172.16.36.135 dst=172.16.36.180 options=[] |&lt;TCP  sport=http dport=ftp_data seq=542529227 ack=1 dataofs=6L reserved=0L flags=SA window=5840 chksum=0x6864 urgptr=0 options=[(&apos;MSS&apos;, 1460)] |&lt;Padding  load=&apos;\x00\x00&apos; |&gt;&gt;&gt;
</code></pre><p>&#x8981;&#x6CE8;&#x610F;&#x5F53; SYN &#x5C01;&#x5305;&#x53D1;&#x5F80;&#x76EE;&#x6807; Web &#x670D;&#x52A1;&#x5668;&#x7684; TCP &#x7AEF;&#x53E3; 80&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x7AEF;&#x53E3;&#x4E0A;&#x8FD0;&#x884C;&#x4E86; HTTP &#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x54CD;&#x5E94;&#x4E2D;&#x4F1A;&#x5E26;&#x6709; TCP &#x6807;&#x8BC6; SA &#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x8868;&#x660E; SYN &#x548C; ACK &#x6807;&#x8BC6;&#x90FD;&#x88AB;&#x6FC0;&#x6D3B;&#x3002;&#x8FD9;&#x4E2A;&#x54CD;&#x5E94;&#x8868;&#x660E;&#x7279;&#x5B9A;&#x7684;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x662F;&#x5F00;&#x653E;&#x7684;&#xFF0C;&#x5E76;&#x63A5;&#x53D7;&#x8FDE;&#x63A5;&#x3002;&#x5982;&#x679C;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5C01;&#x5305;&#x53D1;&#x5F80;&#x4E0D;&#x63A5;&#x53D7;&#x8FDE;&#x63A5;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x4F1A;&#x6536;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x8BF7;&#x6C42;&#x3002;</p>
<pre><code>&gt;&gt;&gt; response = sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=4444)) 
..Begin emission: 
.Finished to send 1 packets. 
...* Received 7 packets, got 1 answers, remaining 0 packets 
&gt;&gt;&gt; response.display() 
###[ IP ]###  
    version= 4L  
    ihl= 5L  
    tos= 0x0  
    len= 40  
    id= 0  
    flags= DF  
    frag= 0L 
    ttl= 64  
    proto= tcp 
    chksum= 0x9974 
    src= 172.16.36.135 
    dst= 172.16.36.180 
    \options\ 
###[ TCP ]###  
    sport= 4444    
    dport= ftp_data 
    seq= 0   
    ack= 1   
    dataofs= 5L  
    reserved= 0L  
    flags= RA  
    window= 0    
    chksum= 0xfd03   
    urgptr= 0
    options= {} 
###[ Padding ]###   
    load= &apos;\x00\x00\x00\x00\x00\x00&apos;
</code></pre><p>&#x5F53; SYN &#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x7ED9;&#x5173;&#x95ED;&#x7684;&#x7AEF;&#x53E3;&#x65F6;&#xFF0C;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x4E2D;&#x5E26;&#x6709; TCP &#x6807;&#x8BC6; RA&#xFF0C;&#x8FD9;&#x8868;&#x660E; RST &#x548C; ACK &#x6807;&#x8BC6;&#x4E3A;&#x90FD;&#x88AB;&#x6FC0;&#x6D3B;&#x3002;ACK &#x4E3A;&#x4EC5;&#x4EC5;&#x7528;&#x4E8E;&#x627F;&#x8BA4;&#x8BF7;&#x6C42;&#x88AB;&#x63A5;&#x53D7;&#xFF0C;RST &#x4E3A;&#x7528;&#x4E8E;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#xFF0C;&#x56E0;&#x4E3A;&#x7AEF;&#x53E3;&#x4E0D;&#x63A5;&#x53D7;&#x8FDE;&#x63A5;&#x3002;&#x4F5C;&#x4E3A;&#x66FF;&#x4EE3;&#xFF0C;&#x5982;&#x679C; SYN &#x5C01;&#x5305;&#x53D1;&#x5F80;&#x5D29;&#x6E83;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x6216;&#x8005;&#x9632;&#x706B;&#x5899;&#x8FC7;&#x6EE4;&#x4E86;&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x63A5;&#x53D7;&#x4E0D;&#x5230;&#x4EFB;&#x4F55;&#x4FE1;&#x606F;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x5728;<code>sr1</code>&#x51FD;&#x6570;&#x5728;&#x811A;&#x672C;&#x4E2D;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x59CB;&#x7EC8;&#x4F7F;&#x7528;<code>timeout</code>&#x9009;&#x9879;&#xFF0C;&#x6765;&#x786E;&#x4FDD;&#x811A;&#x672C;&#x4E0D;&#x4F1A;&#x5728;&#x65E0;&#x54CD;&#x5E94;&#x7684;&#x4E3B;&#x673A;&#x4E0A;&#x6302;&#x8D77;&#x3002;</p>
<pre><code>&gt;&gt;&gt; response = sr1(IP(dst=&quot;172.16.36.136&quot;)/TCP(dport=4444),timeout=1,verb ose=1) 
Begin emission: 
Finished to send 1 packets

Received 15 packets, got 0 answers, remaining 1 packets
</code></pre><p>&#x5982;&#x679C;&#x51FD;&#x6570;&#x5BF9;&#x65E0;&#x54CD;&#x5E94;&#x7684;&#x4E3B;&#x673A;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;<code>timeout</code>&#x503C;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#xFF0C;&#x51FD;&#x6570;&#x4F1A;&#x65E0;&#x9650;&#x7EE7;&#x7EED;&#x4E0B;&#x53BB;&#x3002;&#x8FD9;&#x4E2A;&#x6F14;&#x793A;&#x4E2D;&#xFF0C;<code>timout</code>&#x503C;&#x4E3A; 1&#x79D2;&#xFF0C;&#x7528;&#x4E8E;&#x4F7F;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x66F4;&#x52A0;&#x5B8C;&#x5907;&#xFF0C;&#x54CD;&#x5E94;&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5224;&#x65AD;&#x662F;&#x5426;&#x6536;&#x5230;&#x4E86;&#x54CD;&#x5E94;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# 
python Python 2.7.3 (default, Jan  2 2013, 16:53:07) 
[GCC 4.7.2] on linux2 
Type &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more information. 
&gt;&gt;&gt; from scapy.all import * 
&gt;&gt;&gt; response = sr1(IP(dst=&quot;172.16.36.136&quot;)/TCP(dport=4444),timeout=1,verb ose=1) 
Begin emission: 
WARNING: Mac address to reach destination not found. Using broadcast. Finished to send 1 packets.

Received 15 packets, got 0 answers, remaining 1 packets 
&gt;&gt;&gt; if response == None: 
...     print &quot;No Response!!!&quot; 
... 
No Response!!!
</code></pre><p>Python &#x7684;&#x4F7F;&#x7528;&#x4F7F;&#x5176;&#x66F4;&#x6613;&#x4E8E;&#x6D4B;&#x8BD5;&#x53D8;&#x91CF;&#x6765;&#x8BC6;&#x522B;<code>sr1</code>&#x51FD;&#x6570;&#x662F;&#x5426;&#x5BF9;&#x5176;&#x590D;&#x5236;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x7528;&#x4F5C;&#x521D;&#x6B65;&#x68C0;&#x9A8C;&#xFF0C;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x63A5;&#x6536;&#x5230;&#x4E86;&#x4EFB;&#x4F55;&#x54CD;&#x5E94;&#x3002;&#x5BF9;&#x4E8E;&#x63A5;&#x6536;&#x5230;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x540E;&#x7EED;&#x68C0;&#x67E5;&#x6765;&#x5224;&#x65AD;&#x54CD;&#x5E94;&#x8868;&#x660E;&#x7AEF;&#x53E3;&#x5F00;&#x653E;&#x8FD8;&#x662F;&#x5173;&#x95ED;&#x3002;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x4F7F;&#x7528; Python &#x811A;&#x672C;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-comment">#!/usr/bin/python</span>

<span class="hljs-keyword">import</span> logging 
logging.getLogger(<span class="hljs-string">&quot;scapy.runtime&quot;</span>).setLevel(logging.ERROR) 
<span class="hljs-keyword">from</span> scapy.all <span class="hljs-keyword">import</span> * 
<span class="hljs-keyword">import</span> sys

<span class="hljs-keyword">if</span> len(sys.argv) != <span class="hljs-number">4</span>:   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Usage - ./syn_scan.py [Target-IP] [First Port] [Last Port]&quot;</span>   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Example - ./syn_scan.py 10.0.0.5 1 100&quot;</span>   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Example will TCP SYN scan ports 1 through 100 on 10.0.0.5&quot;</span>   
    sys.exit()

ip = sys.argv[<span class="hljs-number">1</span>] 
start = int(sys.argv[<span class="hljs-number">2</span>]) 
end = int(sys.argv[<span class="hljs-number">3</span>])

<span class="hljs-keyword">for</span> port <span class="hljs-keyword">in</span> range(start,end):   
    ans = sr1(IP(dst=ip)/TCP(dport=port),timeout=<span class="hljs-number">1</span>,verbose=<span class="hljs-number">0</span>)   
    <span class="hljs-keyword">if</span> ans == <span class="hljs-keyword">None</span>:      
        <span class="hljs-keyword">pass</span>   
    <span class="hljs-keyword">else</span>:      
        <span class="hljs-keyword">if</span> int(ans[TCP].flags) == <span class="hljs-number">18</span>:    
            <span class="hljs-keyword">print</span> port  
        <span class="hljs-keyword">else</span>:       
            <span class="hljs-keyword">pass</span>
</code></pre>
<p>&#x5728;&#x8FD9;&#x4E2A; Python &#x811A;&#x672C;&#x4E2D;&#xFF0C;&#x7528;&#x4E8E;&#x88AB;&#x63D0;&#x793A;&#x6765;&#x8F93;&#x5165; IP &#x5730;&#x5740;&#xFF0C;&#x811A;&#x672C;&#x4E4B;&#x540E;&#x4F1A;&#x5BF9;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x7AEF;&#x53E3;&#x5E8F;&#x5217;&#x6267;&#x884C; SYN &#x626B;&#x63CF;&#x3002;&#x811A;&#x672C;&#x4E4B;&#x540E;&#x4F1A;&#x5F97;&#x5230;&#x6BCF;&#x4E2A;&#x8FDE;&#x63A5;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x5224;&#x65AD;&#x54CD;&#x5E94;&#x7684; SYN &#x548C; ACK &#x6807;&#x8BC6;&#x662F;&#x5426;&#x6FC0;&#x6D3B;&#x3002;&#x5982;&#x679C;&#x54CD;&#x5E94;&#x4E2D;&#x51FA;&#x73B0;&#x5E76;&#x4EC5;&#x4EC5;&#x51FA;&#x73B0;&#x4E86;&#x8FD9;&#x4E9B;&#x6807;&#x8BC6;&#xFF0C;&#x90A3;&#x4E48;&#x4F1A;&#x8F93;&#x51FA;&#x76F8;&#x5E94;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#x7801;&#x3002;</p>
<pre><code>root@KaliLinux:~# chmod 777 syn_scan.py 
root@KaliLinux:~# ./syn_scan.py 
Usage - ./syn_scan.py [Target-IP] [First Port] [Last Port] 
Example - ./syn_scan.py 10.0.0.5 1 100 
Example will TCP SYN scan ports 1 through 100 on 10.0.0.5 
root@KaliLinux:~# ./syn_scan.py 172.16.36.135 1 100

21 
22 
23 
25 
53 
80
</code></pre><p>&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x4E4B;&#x540E;&#xFF0C;&#x8F93;&#x51FA;&#x4F1A;&#x663E;&#x793A;&#x6240;&#x63D0;&#x4F9B;&#x7684; IP &#x5730;&#x5740;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x524D; 100 &#x4E2A;&#x7AEF;&#x53E3;&#x4E2D;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x8FD9;&#x4E00;&#x7C7B;&#x578B;&#x7684;&#x626B;&#x63CF;&#x7531;&#x53D1;&#x9001;&#x521D;&#x59CB; SYN &#x5C01;&#x5305;&#x7ED9;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684;&#x76EE;&#x6807; TCP &#x7AEF;&#x53E3;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x7C7B;&#x578B;&#x6765;&#x5224;&#x65AD;&#x7AEF;&#x53E3;&#x72B6;&#x6001;&#x6765;&#x5B8C;&#x6210;&#x3002;&#x5982;&#x679C;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x8FD4;&#x56DE;&#x4E86; SYN+ACK &#x54CD;&#x5E94;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x6B63;&#x5728;&#x51C6;&#x5907;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5047;&#x8BBE;&#x8FD9;&#x4E2A;&#x7AEF;&#x53E3;&#x5F00;&#x653E;&#x3002;&#x5982;&#x679C;&#x670D;&#x52A1;&#x8FD4;&#x56DE;&#x4E86; RST &#x5C01;&#x5305;&#xFF0C;&#x8FD9;&#x5C31;&#x8868;&#x660E;&#x7AEF;&#x53E3;&#x5173;&#x95ED;&#x5E76;&#x4E14;&#x4E0D;&#x63A5;&#x6536;&#x8FDE;&#x63A5;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x54CD;&#x5E94;&#xFF0C;&#x626B;&#x63CF;&#x7CFB;&#x7EDF;&#x548C;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x5B83;&#x4E22;&#x5F03;&#x4E86;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x4E5F;&#x53EF;&#x80FD;&#x8868;&#x660E;&#x4E3B;&#x673A;&#x5D29;&#x6E83;&#x6216;&#x8005;&#x76EE;&#x6807; IP &#x4E0A;&#x6CA1;&#x6709;&#x5173;&#x8054;&#x4EFB;&#x4F55;&#x7CFB;&#x7EDF;&#x3002;</p>
<h2 id="37-nmap-&#x9690;&#x79D8;&#x626B;&#x63CF;">3.7 Nmap &#x9690;&#x79D8;&#x626B;&#x63CF;</h2>
<p>Nmap &#x62E5;&#x6709;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF; SYN &#x626B;&#x63CF;&#x7684;&#x626B;&#x63CF;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C; TCP &#x9690;&#x79D8;&#x626B;&#x63CF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C; TCP &#x9690;&#x79D8;&#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C; TCP &#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Metasploitable2 &#x5B9E;&#x4F8B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x5C31;&#x50CF;&#x591A;&#x6570;&#x626B;&#x63CF;&#x9700;&#x6C42;&#x90A3;&#x6837;&#xFF0C;Nmap &#x62E5;&#x6709;&#x7B80;&#x5316; TCP &#x9690;&#x79D8;&#x626B;&#x63CF;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x7684;&#x9009;&#x9879;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C; TCP &#x9690;&#x79D8;&#x626B;&#x63CF;&#xFF0C;&#x5E94;&#x4F7F;&#x7528;<code>-sS</code>&#x9009;&#x9879;&#xFF0C;&#x5E76;&#x9644;&#x5E26;&#x88AB;&#x626B;&#x63CF;&#x4E3B;&#x673A;&#x7684; IP &#x5730;&#x5740;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap -sS 172.16.36.135 -p 80

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:47 EST
Nmap scan report for 172.16.36.135 
Host is up (0.00043s latency). 
PORT   STATE SERVICE 
80/tcp open  http 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 13.05 seconds
</code></pre><p>&#x5728;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7279;&#x5B9A;&#x7684; IP &#x5730;&#x5740;&#x7684; TCP 80 &#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x4E86; TCP &#x9690;&#x79D8;&#x626B;&#x63CF;&#x3002;&#x548C; Scapy &#x4E2D;&#x7684;&#x6280;&#x5DE7;&#x76F8;&#x4F3C;&#xFF0C;Nmap &#x76D1;&#x542C;&#x54CD;&#x5E94;&#x5E76;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x54CD;&#x5E94;&#x4E2D;&#x6240;&#x6FC0;&#x6D3B;&#x7684; TCP &#x6807;&#x8BC6;&#x6765;&#x8BC6;&#x522B;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C;&#x591A;&#x4E2A;&#x7279;&#x5B9A;&#x7AEF;&#x53E3;&#x7684;&#x626B;&#x63CF;&#xFF0C;&#x901A;&#x8FC7;&#x4F20;&#x9012;&#x9017;&#x53F7;&#x5206;&#x9694;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#x5217;&#x8868;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap -sS 172.16.36.135 -p 21,80,443

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:48 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00035s latency). 
PORT    STATE  SERVICE 
21/tcp  open   ftp 
80/tcp  open   http 
443/tcp closed https 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 13.05 seconds
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x76EE;&#x6807; IP &#x5730;&#x5740;&#x7684;&#x7AEF;&#x53E3; 21&#x3001;80 &#x548C; 443 &#x4E0A;&#x6267;&#x884C;&#x4E86; SYN &#x626B;&#x63CF;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Nmap &#x6765;&#x626B;&#x63CF;&#x4E3B;&#x673A;&#x5E8F;&#x5217;&#xFF0C;&#x901A;&#x8FC7;&#x6807;&#x660E;&#x8981;&#x626B;&#x63CF;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x4EE5;&#x7834;&#x6298;&#x53F7;&#x5206;&#x9694;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nmap -sS 172.16.36.135 -p 20-25

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:48 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00035s latency). 
PORT   STATE  SERVICE 
20/tcp closed ftp-data 
21/tcp open   ftp
22/tcp open   ssh 
23/tcp open   telnet 
24/tcp closed priv-mail 
25/tcp open   smtp 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 13.05 seconds
</code></pre><p>&#x5728;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;SYN &#x626B;&#x63CF;&#x5728; TCP 20 &#x5230; 25 &#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x3002;&#x9664;&#x4E86;&#x62E5;&#x6709;&#x6307;&#x5B9A;&#x88AB;&#x626B;&#x63CF;&#x7AEF;&#x53E3;&#x7684;&#x80FD;&#x529B;&#x4E4B;&#x5916;&#x3002;Nmap &#x540C;&#x65F6;&#x62E5;&#x6709;&#x914D;&#x7F6E;&#x597D;&#x7684; 1000 &#x548C;&#x5E38;&#x7528;&#x7AEF;&#x53E3;&#x7684;&#x5217;&#x8868;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x626B;&#x63CF;&#xFF0C;&#x901A;&#x8FC7;&#x4E0D;&#x5E26;&#x4EFB;&#x4F55;&#x7AEF;&#x53E3;&#x6307;&#x5B9A;&#x4FE1;&#x606F;&#x6765;&#x8FD0;&#x884C; Nmap&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nmap -sS 172.16.36.135

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:46 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00038s latency). N
ot shown: 977 closed ports 
PORT     STATE SERVICE 
21/tcp   open  ftp 
22/tcp   open  ssh 
23/tcp   open  telnet 
25/tcp   open  smtp 
53/tcp   open  domain 
80/tcp   open  http 
111/tcp  open  rpcbind 
139/tcp  open  netbios-ssn 
445/tcp  open  microsoft-ds 
512/tcp  open  exec 
513/tcp  open  login 
514/tcp  open  shell 
1099/tcp open  rmiregistry 
1524/tcp open  ingreslock 
2049/tcp open  nfs 
2121/tcp open  ccproxy-ftp 
3306/tcp open  mysql
5432/tcp open  postgresql 
5900/tcp open  vnc 
6000/tcp open  X11 
6667/tcp open  irc 
8009/tcp open  ajp13 
8180/tcp open  unknown 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 13.17 seconds
</code></pre><p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x626B;&#x63CF;&#x4E86; Nmap &#x5B9A;&#x4E49;&#x7684; 1000 &#x4E2A;&#x5E38;&#x7528;&#x7AEF;&#x53E3;&#xFF0C;&#x7528;&#x4E8E;&#x8BC6;&#x522B; Metasploitable2  &#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x5927;&#x91CF;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x6280;&#x5DE7;&#x5728;&#x662F;&#x88AB;&#x591A;&#x6570;&#x8BBE;&#x5907;&#x4E0A;&#x5F88;&#x9AD8;&#x6548;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x6A21;&#x7CCA;&#x7684;&#x670D;&#x52A1;&#x6216;&#x8005;&#x4E0D;&#x5E38;&#x89C1;&#x7684;&#x7AEF;&#x53E3;&#x7EC4;&#x5408;&#x3002;&#x5982;&#x679C;&#x626B;&#x63CF;&#x5728;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684; TCP &#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#xFF0C;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x503C;&#x90FD;&#x9700;&#x8981;&#x88AB;&#x626B;&#x63CF;&#x3002;&#x5B9A;&#x4E49;&#x4E86;&#x6E90;&#x7AEF;&#x53E3;&#x548C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x7684; TCP &#x5934;&#x90E8;&#x90E8;&#x5206;&#x662F; 16 &#x4F4D;&#x957F;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x6BCF;&#x4E00;&#x4F4D;&#x53EF;&#x4EE5;&#x4E3A; 1 &#x6216;&#x8005; 0&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5171;&#x6709;<code>2 ** 16</code>&#x6216;&#x8005; 65536 &#x4E2A;&#x53EF;&#x80FD;&#x7684; TCP &#x7AEF;&#x53E3;&#x5730;&#x5740;&#x3002;&#x5BF9;&#x4E8E;&#x8981;&#x626B;&#x63CF;&#x7684;&#x5168;&#x90E8;&#x53EF;&#x80FD;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B; 0 &#x5230; 65535 &#x7684;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nmap -sS 172.16.36.135 -p 0-65535

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:51 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00033s latency). 
Not shown: 65506 closed ports 
PORT      STATE SERVICE 
21/tcp    open  ftp 
22/tcp    open  ssh 
23/tcp    open  telnet 
25/tcp    open  smtp 
53/tcp    open  domain 
80/tcp    open  http 
111/tcp   open  rpcbind 
139/tcp   open  netbios-ssn 
445/tcp   open  microsoft-ds 
512/tcp   open  exec 
513/tcp   open  login 
514/tcp   open  shell
1099/tcp  open  rmiregistry 
1524/tcp  open  ingreslock 
2049/tcp  open  nfs 
2121/tcp  open  ccproxy-ftp 
3306/tcp  open  mysql 
3632/tcp  open  distccd 
5432/tcp  open  postgresql 
5900/tcp  open  vnc 
6000/tcp  open  X11 
6667/tcp  open  irc 
6697/tcp  open  unknown 
8009/tcp  open  ajp13 
8180/tcp  open  unknown 
8787/tcp  open  unknown 
34789/tcp open  unknown 
50333/tcp open  unknown 
56375/tcp open  unknown 
57385/tcp open  unknown 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 16.78 seconds
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;Metasploitable2 &#x7CFB;&#x7EDF;&#x4E0A;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684; 65536 &#x548C; TCP &#x5730;&#x5740;&#x90FD;&#x626B;&#x63CF;&#x4E86;&#x4E00;&#x904D;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x8BE5;&#x626B;&#x63CF;&#x4E2D;&#x8BC6;&#x522B;&#x7684;&#x591A;&#x6570;&#x670D;&#x52A1;&#x90FD;&#x5728;&#x6807;&#x51C6;&#x7684; Nmap 1000 &#x626B;&#x63CF;&#x4E2D;&#x8BC6;&#x522B;&#x8FC7;&#x4E86;&#x3002;&#x8FD9;&#x5C31;&#x8868;&#x660E;&#x5728;&#x5C1D;&#x8BD5;&#x8BC6;&#x522B;&#x76EE;&#x6807;&#x7684;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x653B;&#x51FB;&#x9762;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B8C;&#x6574;&#x626B;&#x63CF;&#x662F;&#x4E2A;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x3002;Nmap &#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7834;&#x6298;&#x53F7;&#x8BB0;&#x6CD5;&#xFF0C;&#x626B;&#x63CF;&#x4E3B;&#x673A;&#x5217;&#x8868;&#x4E0A;&#x7684; TCP &#x7AEF;&#x53E3;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nmap 172.16.36.0-255 -sS -p 80

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:56 EST 
Nmap scan report for 172.16.36.1 Host is up (0.00023s latency). 
PORT   STATE  SERVICE 
80/tcp closed http 
MAC Address: 00:50:56:C0:00:08 (VMware)

Nmap scan report for 172.16.36.2 Host is up (0.00018s latency). 
PORT   STATE  SERVICE 
80/tcp closed http 
MAC Address: 00:50:56:FF:2A:8E (VMware)

Nmap scan report for 172.16.36.132 Host is up (0.00047s latency). 
PORT   STATE  SERVICE 
80/tcp closed http 
MAC Address: 00:0C:29:65:FC:D2 (VMware)

Nmap scan report for 172.16.36.135 
Host is up (0.00016s latency). 
PORT   STATE SERVICE 
80/tcp open  http 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap scan report for 172.16.36.180 
Host is up (0.0029s latency). 
PORT   STATE SERVICE 
80/tcp open  http

Nmap done: 256 IP addresses (5 hosts up) scanned in 42.85 seconds
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;TCP 80 &#x7AEF;&#x53E3;&#x7684; SYN &#x626B;&#x63CF;&#x5728;&#x6307;&#x5B9A;&#x5730;&#x5740;&#x8303;&#x56F4;&#x5185;&#x7684;&#x6240;&#x6709;&#x4E3B;&#x673A;&#x4E0A;&#x6267;&#x884C;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x626B;&#x63CF;&#x4EC5;&#x4EC5;&#x6267;&#x884C;&#x5728;&#x5355;&#x4E2A;&#x7AEF;&#x53E3;&#x4E0A;&#xFF0C;Nmap &#x4E5F;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x626B;&#x63CF;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x591A;&#x4E2A;&#x7AEF;&#x53E3;&#x548C;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#x3002;&#x6B64;&#x5916;&#xFF0C;Nmap &#x4E5F;&#x80FD;&#x591F;&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#xFF0C;&#x57FA;&#x4E8E; IP &#x5730;&#x5740;&#x7684;&#x8F93;&#x5165;&#x5217;&#x8868;&#x6765;&#x626B;&#x63CF;&#x4E3B;&#x673A;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<code>-iL</code>&#x9009;&#x9879;&#x5E76;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x5982;&#x679C;&#x6587;&#x4EF6;&#x5B58;&#x653E;&#x4E8E;&#x6267;&#x884C;&#x76EE;&#x5F55;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x6765;&#x5B8C;&#x6210;&#x3002;Nmap &#x4E4B;&#x540E;&#x4F1A;&#x904D;&#x5386;&#x8F93;&#x5165;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x5BF9;&#x5730;&#x5740;&#x6267;&#x884C;&#x7279;&#x5B9A;&#x7684;&#x626B;&#x63CF;&#x3002;</p>
<pre><code>root@KaliLinux:~# cat iplist.txt 
172.16.36.1 
172.16.36.2 
172.16.36.132 
172.16.36.135

root@KaliLinux:~# nmap -sS -iL iplist.txt -p 80

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:59 EST 
Nmap scan report for 172.16.36.1 
Host is up (0.00016s latency). 
PORT   STATE  SERVICE 
80/tcp closed http 
MAC Address: 00:50:56:C0:00:08 (VMware)

Nmap scan report for 172.16.36.2 
Host is up (0.00047s latency). 
PORT   STATE  SERVICE 
80/tcp closed http 
MAC Address: 00:50:56:FF:2A:8E (VMware)

Nmap scan report for 172.16.36.132 
Host is up (0.00034s latency). 
PORT   STATE  SERVICE 
80/tcp closed http 
MAC Address: 00:0C:29:65:FC:D2 (VMware)

Nmap scan report for 172.16.36.135 
Host is up (0.00016s latency). 
PORT   STATE SERVICE 
80/tcp open  http 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 4 IP addresses (4 hosts up) scanned in 13.05 seconds
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Nmap SYN &#x626B;&#x63CF;&#x80CC;&#x540E;&#x7684;&#x5E95;&#x5C42;&#x673A;&#x5236;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x8FC7;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;Nmap &#x62E5;&#x6709;&#x591A;&#x7EBF;&#x7A0B;&#x529F;&#x80FD;&#xFF0C;&#x662F;&#x7528;&#x4E8E;&#x6267;&#x884C;&#x8FD9;&#x7C7B;&#x626B;&#x63CF;&#x7684;&#x5FEB;&#x901F;&#x9AD8;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<h2 id="38-metasploit-&#x9690;&#x79D8;&#x626B;&#x63CF;">3.8 Metasploit &#x9690;&#x79D8;&#x626B;&#x63CF;</h2>
<p>&#x9664;&#x4E86;&#x5176;&#x5B83;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x5DE5;&#x5177;&#x4E4B;&#x5916;&#xFF0C;Metasploit &#x62E5;&#x6709;&#x7528;&#x4E8E; SYN &#x626B;&#x63CF;&#x7684;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Metasploit &#x6765;&#x6267;&#x884C; TCP &#x9690;&#x79D8;&#x626B;&#x63CF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Metasploit &#x6267;&#x884C; TCP &#x9690;&#x79D8;&#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C; TCP &#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Metasploitable2 &#x5B9E;&#x4F8B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>Metasploit &#x62E5;&#x6709;&#x53EF;&#x4EE5;&#x5BF9;&#x7279;&#x5B9A; TCP &#x7AEF;&#x53E3;&#x6267;&#x884C; SYN &#x626B;&#x63CF;&#x7684;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#x3002;&#x4E3A;&#x4E86;&#x5728; Kali &#x4E2D;&#x542F;&#x52A8; Metasploit&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7EC8;&#x7AEF;&#x4E2D;&#x6267;&#x884C;<code>msfconsole</code>&#x547D;&#x4EE4;&#x3002;</p>
<pre><code>root@KaliLinux:~# msfconsole 
IIIIII    dTb.dTb        _.---._
  II     4&apos;  v  &apos;B   .&apos;&quot;&quot;.&apos;/|\`.&quot;&quot;&apos;.  
  II     6.     .P  :  .&apos; / | \ `.  :  
  II     &apos;T;. .;P&apos;  &apos;.&apos;  /  |  \  `.&apos;  
  II      &apos;T; ;P&apos;    `. /   |   \ .&apos; 
IIIIII     &apos;YvP&apos;       `-.__|__.-&apos;

I love shells --egypt

Using notepad to track pentests? Have Metasploit Pro report on hosts, services, sessions and evidence -- type &apos;go_pro&apos; to launch it now.

       =[ metasploit v4.6.0-dev [core:4.6 api:1.0] 
+ -- --=[ 1053 exploits - 590 auxiliary - 174 post 
+ -- --=[ 275 payloads - 28 encoders - 8 nops

msf &gt; use auxiliary/scanner/portscan/syn 
msf  auxiliary(syn) &gt; show options

Module options (auxiliary/scanner/portscan/syn):

    Name       Current Setting  Required  Description   
    ----       ---------------  --------  ----------   
    BATCHSIZE  256              yes       The number of hosts to scan per set   
    INTERFACE                   no        The name of the interface   
    PORTS      1-10000          yes       Ports to scan (e.g. 2225,80,110-900)   
    RHOSTS                      yes       The target address range or CIDR identifier   
    SNAPLEN    65535            yes       The number of bytes to capture   
    THREADS    1                yes       The number of concurrent threads   
    TIMEOUT    500              yes       The reply read timeout in milliseconds
</code></pre><p>&#x4E3A;&#x4E86;&#x5728; Metasploit &#x4E2D;&#x6267;&#x884C; SYN &#x626B;&#x63CF;&#xFF0C;&#x4EE5;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#x7684;&#x76F8;&#x5BF9;&#x8DEF;&#x5F84;&#x8C03;&#x7528;<code>use</code>&#x547D;&#x4EE4;&#x3002;&#x4E00;&#x65E6;&#x6A21;&#x5757;&#x88AB;&#x9009;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x6267;&#x884C;<code>show options</code>&#x547D;&#x4EE4;&#x6765;&#x786E;&#x8BA4;&#x6216;&#x4FEE;&#x6539;&#x626B;&#x63CF;&#x914D;&#x7F6E;&#x3002;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x4F1A;&#x5C55;&#x793A;&#x56DB;&#x5217;&#x7684;&#x8868;&#x683C;&#xFF0C;&#x5305;&#x62EC;<code>name</code>&#x3001;<code>current settings</code>&#x3001;<code>required</code>&#x548C;<code>description</code>&#x3002;<code>name</code>&#x5217;&#x6807;&#x51FA;&#x4E86;&#x6BCF;&#x4E2A;&#x53EF;&#x914D;&#x7F6E;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x3002;<code>current settings</code>&#x5217;&#x5217;&#x51FA;&#x4E86;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x53D8;&#x91CF;&#x7684;&#x73B0;&#x6709;&#x914D;&#x7F6E;&#x3002;<code>required</code>&#x5217;&#x6807;&#x51FA;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x53D8;&#x91CF;&#xFF0C;&#x503C;&#x662F;&#x5426;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x3002;<code>description</code>&#x5217;&#x63CF;&#x8FF0;&#x4E86;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>set</code>&#x547D;&#x4EE4;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x65B0;&#x7684;&#x503C;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x6765;&#x4FEE;&#x6539;&#x3002;</p>
<pre><code>msf  auxiliary(syn) &gt; set RHOSTS 172.16.36.135 
RHOSTS =&gt; 172.16.36.135 
msf  auxiliary(syn) &gt; set THREADS 20 
THREADS =&gt; 20 
msf  auxiliary(syn) &gt; set PORTS 80 
PORTS =&gt; 80 
msf  auxiliary(syn) &gt; show options

Module options (auxiliary/scanner/portscan/syn):

   Name       Current Setting  Required  Description   
   ----       ---------------  --------  ----------   
   BATCHSIZE  256              yes       The number of hosts to scan per set
   INTERFACE                   no        The name of the interface   
   PORTS      80               yes       Ports to scan (e.g. 2225,80,110-900)   
   RHOSTS     172.16.36.135    yes       The target address range or CIDR identifier   
   SNAPLEN    65535            yes       The number of bytes to capture   
   THREADS    20               yes       The number of concurrent threads   
   TIMEOUT    500              yes       The reply read timeout in milliseconds
</code></pre><p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>RHOSTS</code>&#x503C;&#x4FEE;&#x6539;&#x4E3A;&#x6211;&#x4EEC;&#x6253;&#x7B97;&#x626B;&#x63CF;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684; IP &#x5730;&#x5740;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x4FEE;&#x6539;&#x4E3A; 20&#x3002;<code>THREADS</code>&#x7684;&#x503C;&#x5B9A;&#x4E49;&#x4E86;&#x5728;&#x540E;&#x53F0;&#x6267;&#x884C;&#x7684;&#x5F53;&#x524D;&#x4EFB;&#x52A1;&#x6570;&#x91CF;&#x3002;&#x786E;&#x5B9A;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x6D89;&#x53CA;&#x5230;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x5E73;&#x8861;&#xFF0C;&#x65E2;&#x80FD;&#x63D0;&#x5347;&#x4EFB;&#x52A1;&#x901F;&#x5EA6;&#xFF0C;&#x53C8;&#x4E0D;&#x4F1A;&#x8FC7;&#x5EA6;&#x6D88;&#x8017;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x3002;&#x5BF9;&#x4E8E;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#xFF0C;20 &#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x8DB3;&#x591F;&#x5FEB;&#xFF0C;&#x5E76;&#x4E14;&#x76F8;&#x5F53;&#x5408;&#x7406;&#x3002;<code>PORTS</code>&#x503C;&#x8BBE;&#x4E3A; TCP &#x7AEF;&#x53E3; 80&#xFF08;HTTP&#xFF09;&#x3002;&#x4FEE;&#x6539;&#x4E86;&#x5FC5;&#x8981;&#x7684;&#x53D8;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x4F7F;&#x7528;<code>show options</code>&#x547D;&#x4EE4;&#x6765;&#x9A8C;&#x8BC1;&#x3002;&#x4E00;&#x65E6;&#x6240;&#x9700;&#x914D;&#x7F6E;&#x9A8C;&#x8BC1;&#x5B8C;&#x6BD5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x626B;&#x63CF;&#x4E86;&#x3002;</p>
<pre><code>msf  auxiliary(syn) &gt; run

[*] TCP OPEN 172.16.36.135:80 [*] Scanned 1 of 1 hosts (100% complete) 
[*] Auxiliary module execution completed The run command is used in Metasploit to execute the selected auxiliary module. In the example provided, the run command executed a TCP SYN scan against port 80 of the specified IP address. We can also run this TCP SYN scan module against a sequential series  of TCP ports by supplying the first and last values, separated by a dash notation:

msf  auxiliary(syn) &gt; set PORTS 0-100 
PORTS =&gt; 0-100 
msf  auxiliary(syn) &gt; show options

Module options (auxiliary/scanner/portscan/syn):

   Name       Current Setting  Required  Description   
   ----       ---------------  --------  ----------   
   BATCHSIZE  256              yes       The number of hosts to scan per set   
   INTERFACE                   no        The name of the interface
   PORTS      0-100            yes       Ports to scan (e.g. 2225,80,110-900)   
   RHOSTS     172.16.36.135    yes       The target address range or CIDR identifier   
   SNAPLEN    65535            yes       The number of bytes to capture   
   THREADS    20               yes       The number of concurrent threads   
   TIMEOUT    500              yes       The reply read timeout in milliseconds

msf  auxiliary(syn) &gt; run

[*]  TCP OPEN 172.16.36.135:21 
[*]  TCP OPEN 172.16.36.135:22 
[*]  TCP OPEN 172.16.36.135:23 
[*]  TCP OPEN 172.16.36.135:25 
[*]  TCP OPEN 172.16.36.135:53 
[*]  TCP OPEN 172.16.36.135:80 
[*] Scanned 1 of 1 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><p>&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6240;&#x6307;&#x5B9A;&#x7684;&#x8FDC;&#x7A0B;&#x4E3B;&#x673A;&#x7684;&#x94B1; 100 &#x4E2A; TCP &#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x4E86; TCP SYN &#x626B;&#x63CF;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x626B;&#x63CF;&#x8BC6;&#x522B;&#x4E86;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684;&#x591A;&#x4E2A;&#x8BBE;&#x5907;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x786E;&#x8BA4;&#x6240;&#x6709;&#x8BBE;&#x5907;&#x90FD;&#x8BC6;&#x522B;&#x51FA;&#x6765;&#xFF0C;&#x9664;&#x975E;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x90FD;&#x626B;&#x63CF;&#x5230;&#x3002;&#x5B9A;&#x4E49;&#x6765;&#x6E90;&#x548C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x7684;TCP &#x5934;&#x90E8;&#x90E8;&#x5206;&#x662F; 16 &#x4F4D;&#x957F;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x6BCF;&#x4E00;&#x4F4D;&#x53EF;&#x4EE5;&#x4E3A; 1 &#x6216;&#x8005; 0&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5171;&#x6709;<code>2 ** 16</code>&#x6216; 65536 &#x4E2A;&#x53EF;&#x80FD;&#x7684; TCP &#x7AEF;&#x53E3;&#x5730;&#x5740;&#x3002;&#x5BF9;&#x4E8E;&#x8981;&#x626B;&#x63CF;&#x7684;&#x6574;&#x4E2A;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B; 0 &#x5230; 65535 &#x7684; &#x7AEF;&#x53E3;&#x8303;&#x56F4;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>msf  auxiliary(syn) &gt; set PORTS 0-65535 
PORTS =&gt; 0-65535 
msf  auxiliary(syn) &gt; show options

Module options (auxiliary/scanner/portscan/syn):

   Name       Current Setting  Required  Description   
   ----       ---------------  --------  ----------   
   BATCHSIZE  256              yes       The number of hosts to scan per set   
   INTERFACE                   no        The name of the interface
   PORTS      0-65535          yes       Ports to scan (e.g. 2225,80,110-900)   
   RHOSTS     172.16.36.135    yes       The target address range or CIDR identifier   
   SNAPLEN    65535            yes       The number of bytes to capture   
   THREADS    20               yes       The number of concurrent threads   
   TIMEOUT    500              yes       The reply read timeout in milliseconds 

msf  auxiliary(syn) &gt; run

[*]  TCP OPEN 172.16.36.135:21 
[*]  TCP OPEN 172.16.36.135:22 
[*]  TCP OPEN 172.16.36.135:23 
[*]  TCP OPEN 172.16.36.135:25 
[*]  TCP OPEN 172.16.36.135:53 
[*]  TCP OPEN 172.16.36.135:80 
[*]  TCP OPEN 172.16.36.135:111 
[*]  TCP OPEN 172.16.36.135:139 
[*]  TCP OPEN 172.16.36.135:445 
[*]  TCP OPEN 172.16.36.135:512 
[*]  TCP OPEN 172.16.36.135:513 
[*]  TCP OPEN 172.16.36.135:514 
[*]  TCP OPEN 172.16.36.135:1099 
[*]  TCP OPEN 172.16.36.135:1524 
[*]  TCP OPEN 172.16.36.135:2049 
[*]  TCP OPEN 172.16.36.135:2121 
[*]  TCP OPEN 172.16.36.135:3306 
[*]  TCP OPEN 172.16.36.135:3632 
[*]  TCP OPEN 172.16.36.135:5432 
[*]  TCP OPEN 172.16.36.135:5900 
[*]  TCP OPEN 172.16.36.135:6000 
[*]  TCP OPEN 172.16.36.135:6667 
[*]  TCP OPEN 172.16.36.135:6697 
[*]  TCP OPEN 172.16.36.135:8009 
[*]  TCP OPEN 172.16.36.135:8180 
[*]  TCP OPEN 172.16.36.135:8787 
[*]  TCP OPEN 172.16.36.135:34789
[*]  TCP OPEN 172.16.36.135:50333 
[*]  TCP OPEN 172.16.36.135:56375 
[*]  TCP OPEN 172.16.36.135:57385 
[*] Scanned 1 of 1 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684;&#x6240;&#x6709;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x90FD;&#x7531;&#x626B;&#x63CF;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684; TCP &#x7AEF;&#x53E3;&#x5730;&#x5740;&#x6765;&#x8BC6;&#x522B;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x626B;&#x63CF;&#x914D;&#x7F6E;&#x4F7F;&#x7528;&#x7834;&#x6298;&#x53F7;&#x8BB0;&#x6CD5;&#x6765;&#x626B;&#x63CF;&#x5730;&#x5740;&#x5E8F;&#x5217;&#x3002;</p>
<pre><code>msf  auxiliary(syn) &gt; set RHOSTS 172.16.36.0-255 
RHOSTS =&gt; 172.16.36.0-255 
msf  auxiliary(syn) &gt; show options

Module options (auxiliary/scanner/portscan/syn):

   Name       Current Setting  Required  Description   
   ----       ---------------  --------  ----------   
   BATCHSIZE  256              yes       The number of hosts to scan per set   
   INTERFACE                   no        The name of the interface   
   PORTS      80               yes       Ports to scan (e.g. 2225,80,110-900)   
   RHOSTS     172.16.36.0-255  yes       The target address range or CIDR identifier   
   SNAPLEN    65535            yes       The number of bytes to capture   
   THREADS    20               yes       The number of concurrent threads   
   TIMEOUT    500              yes       The reply read timeout in milliseconds

msf  auxiliary(syn) &gt; run

[*] TCP OPEN 172.16.36.135:80 
[*] Scanned 256 of 256 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;TCP SYN &#x626B;&#x63CF;&#x6267;&#x884C;&#x5728;&#x7531;<code>RHOST</code>&#x53D8;&#x91CF;&#x6307;&#x5B9A;&#x7684;&#x6240;&#x6709;&#x4E3B;&#x673A;&#x5730;&#x5740;&#x7684; 80 &#x7AEF;&#x53E3;&#x4E0A;&#x3002;&#x4E0E;&#x4E4B;&#x76F8;&#x4F3C;&#xFF0C;<code>RHOSTS</code>&#x53EF;&#x4EE5;&#x4F7F;&#x7528; CIDR &#x8BB0;&#x6CD5;&#x5B9A;&#x4E49;&#x7F51;&#x7EDC;&#x8303;&#x56F4;&#x3002;</p>
<pre><code>msf  auxiliary(syn) &gt; set RHOSTS 172.16.36.0/24 
RHOSTS =&gt; 172.16.36.0/24 
msf  auxiliary(syn) &gt; show options

Module options (auxiliary/scanner/portscan/syn):

   Name       Current Setting  Required  Description   
   ----       ---------------  --------  ----------   
   BATCHSIZE  256              yes       The number of hosts to scan per set   
   INTERFACE                   no        The name of the interface   
   PORTS      80               yes       Ports to scan (e.g. 2225,80,110-900)   
   RHOSTS     172.16.36.0/24   yes       The target address range or CIDR identifier   
   SNAPLEN    65535            yes       The number of bytes to capture   
   THREADS    20               yes       The number of concurrent threads   
   TIMEOUT    500              yes       The reply read timeout in milliseconds

msf  auxiliary(syn) &gt; run

[*] TCP OPEN 172.16.36.135:80 
[*] Scanned 256 of 256 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Metasploit SYN &#x626B;&#x63CF;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#x80CC;&#x540E;&#x7684;&#x5E95;&#x5C42;&#x539F;&#x7406;&#x548C;&#x4EFB;&#x4F55;&#x5176;&#x5B83; SYN &#x626B;&#x63CF;&#x5DE5;&#x5177;&#x4E00;&#x6837;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x88AB;&#x626B;&#x63CF;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x4F1A;&#x53D1;&#x9001; SYN &#x5C01;&#x5305;&#x3002;SYN+ACK &#x5C01;&#x5305;&#x4F1A;&#x7528;&#x4E8E;&#x8BC6;&#x522B;&#x6D3B;&#x52A8;&#x670D;&#x52A1;&#x3002;&#x4F7F;&#x7528; MEtasploit &#x53EF;&#x80FD;&#x66F4;&#x52A0;&#x6709;&#x5438;&#x5F15;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x62E5;&#x6709;&#x4EA4;&#x4E92;&#x63A7;&#x5236;&#x53F0;&#xFF0C;&#x4E5F;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x4E2A;&#x5DF2;&#x7ECF;&#x88AB;&#x591A;&#x6570;&#x6E17;&#x900F;&#x6D4B;&#x8BD5;&#x8005;&#x719F;&#x77E5;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<h2 id="79-hping3-&#x9690;&#x79D8;&#x626B;&#x63CF;">7.9 hping3 &#x9690;&#x79D8;&#x626B;&#x63CF;</h2>
<p>&#x9664;&#x4E86;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5B66;&#x5230;&#x4E86;&#x63A2;&#x7D22;&#x6280;&#x5DE7;&#xFF0C;hping3 &#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6267;&#x884C;&#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; hping3 &#x6765;&#x6267;&#x884C; TCP &#x9690;&#x79D8;&#x626B;&#x63CF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; hping3 &#x6267;&#x884C; TCP &#x9690;&#x79D8;&#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C; TCP &#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Metasploitable2 &#x5B9E;&#x4F8B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x9664;&#x4E86;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5B66;&#x5230;&#x4E86;&#x63A2;&#x7D22;&#x6280;&#x5DE7;&#xFF0C;hping3 &#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6267;&#x884C;&#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x7528; hping3 &#x6267;&#x884C;&#x7AEF;&#x53E3;&#x626B;&#x63CF;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4EE5;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x503C;&#x4F7F;&#x7528;<code>--scan</code>&#x6A21;&#x5F0F;&#x6765;&#x6307;&#x5B9A;&#x8981;&#x626B;&#x63CF;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#x3002;</p>
<pre><code>root@KaliLinux:~# hping3 172.16.36.135 --scan 80 -S 
Scanning 172.16.36.135 (172.16.36.135), port 80 
1 ports to scan, use -V to see all the replies 
+----+-----------+---------+---+-----+-----+-----+ 
|port| serv name |  flags  |ttl| id  | win | len | 
+----+-----------+---------+---+-----+-----+-----+   
   80 http       : .S..A...  64     0  5840    46 
All replies received. Done. 
Not responding ports:
</code></pre><p>&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;SYN &#x626B;&#x63CF;&#x6267;&#x884C;&#x5728;&#x6307;&#x5B9A; IP &#x5730;&#x5740;&#x7684; TCP &#x7AEF;&#x53E3; 80 &#x4E0A;&#x3002;<code>-S</code>&#x9009;&#x9879;&#x6307;&#x660E;&#x4E86;&#x53D1;&#x7ED9;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684;&#x5C01;&#x5305;&#x4E2D;&#x6FC0;&#x6D3B;&#x7684; TCP &#x6807;&#x8BC6;&#x3002;&#x8868;&#x683C;&#x5C55;&#x793A;&#x4E86;&#x63A5;&#x6536;&#x5230;&#x7684;&#x54CD;&#x5E94;&#x5C01;&#x5305;&#x4E2D;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x8F93;&#x51FA;&#x4E2D;&#x770B;&#x5230;&#xFF0C;&#x63A5;&#x6536;&#x5230;&#x4E86;SYN+ACK &#x54CD;&#x5E94;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x8868;&#x793A;&#x76EE;&#x6807;&#x4E3B;&#x673A;&#x7AEF;&#x53E3; 80 &#x662F;&#x5F00;&#x653E;&#x7684;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8F93;&#x5165;&#x591F;&#x597D;&#x5206;&#x9694;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#x5217;&#x8868;&#x6765;&#x626B;&#x63CF;&#x591A;&#x4E2A;&#x7AEF;&#x53E3;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# hping3 172.16.36.135 --scan 22,80,443 -S 
Scanning 172.16.36.135 (172.16.36.135), port 22,80,443 
3 ports to scan, use -V to see all the replies
+----+-----------+---------+---+-----+-----+-----+ 
|port| serv name |  flags  |ttl| id  | win | len | 
+----+-----------+---------+---+-----+-----+-----+   
   22 ssh        : .S..A...  64     0  5840    46   
   80 http       : .S..A...  64     0  5840    46 
All replies received. Done. 
Not responding ports:
</code></pre><p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x626B;&#x63CF;&#x8F93;&#x51FA;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4EC5;&#x4EC5;&#x5C55;&#x793A;&#x4E86;&#x63A5;&#x53D7;&#x5230; SYN+ACK &#x6807;&#x8BC6;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x548C;&#x53D1;&#x9001;&#x5230; 443 &#x7AEF;&#x53E3;&#x7684; SYN &#x8BF7;&#x6C42;&#x76F8;&#x5173;&#x7684;&#x54CD;&#x5E94;&#x5E76;&#x6CA1;&#x6709;&#x5C55;&#x793A;&#x3002;&#x4ECE;&#x8F93;&#x51FA;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;<code>-v</code>&#x9009;&#x9879;&#x589E;&#x52A0;&#x8BE6;&#x7EC6;&#x8BFB;&#x6765;&#x67E5;&#x770B;&#x6240;&#x6709;&#x54CD;&#x5E94;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F20;&#x9012;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x503C;&#xFF0C;&#x6765;&#x626B;&#x63CF;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# hping3 172.16.36.135 --scan 0-100 -S 
Scanning 172.16.36.135 (172.16.36.135), port 0-100 
101 ports to scan, use -V to see all the replies 
+----+-----------+---------+---+-----+-----+-----+ 
|port| serv name |  flags  |ttl| id  | win | len | 
+----+-----------+---------+---+-----+-----+-----+   
   21 ftp        : .S..A...  64     0  5840    46   
   22 ssh        : .S..A...  64     0  5840    46   
   23 telnet     : .S..A...  64     0  5840    46   
   25 smtp       : .S..A...  64     0  5840    46   
   53 domain     : .S..A...  64     0  5840    46   
   80 http       : .S..A...  64     0  5840    46 
All replies received. Done. 
Not responding ports:
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;100 &#x4E2A;&#x7AEF;&#x53E3;&#x7684;&#x626B;&#x63CF;&#x8DB3;&#x4EE5;&#x8BC6;&#x522B; Metasploitable2 &#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x670D;&#x52A1;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E3A;&#x4E86;&#x6267;&#x884C; &#x6240;&#x6709; TCP &#x7AEF;&#x53E3;&#x7684;&#x626B;&#x63CF;&#xFF0C;&#x9700;&#x8981;&#x626B;&#x63CF;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x503C;&#x3002;&#x5B9A;&#x4E49;&#x4E86;&#x6E90;&#x7AEF;&#x53E3;&#x548C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x7684; TCP &#x5934;&#x90E8;&#x90E8;&#x5206;&#x662F; 16 &#x4F4D;&#x957F;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x6BCF;&#x4E00;&#x4F4D;&#x53EF;&#x4EE5;&#x4E3A; 1 &#x6216;&#x8005; 0&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5171;&#x6709;<code>2 ** 16</code>&#x6216;&#x8005; 65536 &#x4E2A;&#x53EF;&#x80FD;&#x7684; TCP &#x7AEF;&#x53E3;&#x5730;&#x5740;&#x3002;&#x5BF9;&#x4E8E;&#x8981;&#x626B;&#x63CF;&#x7684;&#x5168;&#x90E8;&#x53EF;&#x80FD;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B; 0 &#x5230; 65535 &#x7684;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# hping3 172.16.36.135 --scan 0-65535 -S 
Scanning 172.16.36.135 (172.16.36.135), port 0-65535 
65536 ports to scan, use -V to see all the replies
+----+-----------+---------+---+-----+-----+-----+ 
|port| serv name |  flags  |ttl| id  | win | len | 
+----+-----------+---------+---+-----+-----+-----+   
   21 ftp        : .S..A...  64     0  5840    46   
   22 ssh        : .S..A...  64     0  5840    46   
   23 telnet     : .S..A...  64     0  5840    46   
   25 smtp       : .S..A...  64     0  5840    46   
   53 domain     : .S..A...  64     0  5840    46  
  111 sunrpc     : .S..A...  64     0  5840    46 
 1099 rmiregistry: .S..A...  64     0  5840    46 
 1524 ingreslock : .S..A...  64     0  5840    46 
 2121 iprop      : .S..A...  64     0  5840    46 
 8180            : .S..A...  64     0  5840    46 
34789            : .S..A...  64     0  5840    46  
  512 exec       : .S..A...  64     0  5840    46  
  513 login      : .S..A...  64     0  5840    46  
  514 shell      : .S..A...  64     0  5840    46 
 3632 distcc     : .S..A...  64     0  5840    46 
 5432 postgresql : .S..A...  64     0  5840    46 
56375            : .S..A...  64     0  5840    46   
   80 http       : .S..A...  64     0  5840    46  
  445 microsoft-d: .S..A...  64     0  5840    46 
 2049 nfs        : .S..A...  64     0  5840    46 
 6667 ircd       : .S..A...  64     0  5840    46
 6697            : .S..A...  64     0  5840    46 
57385            : .S..A...  64     0  5840    46  
  139 netbios-ssn: .S..A...  64     0  5840    46 
 6000 x11        : .S..A...  64     0  5840    46 
 3306 mysql      : .S..A...  64     0  5840    46 
 5900            : .S..A...  64     0  5840    46 
 8787            : .S..A...  64     0  5840    46 
50333            : .S..A...  64     0  5840    46 
 8009            : .S..A...  64     0  5840    46 
All replies received. Done. 
Not responding ports:
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>hping3 &#x4E0D;&#x7528;&#x4E8E;&#x4E00;&#x4E9B;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#x7684;&#x5176;&#x5B83;&#x5DE5;&#x5177;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5E76;&#x6CA1;&#x6709; SYN &#x626B;&#x63CF;&#x6A21;&#x5F0F;&#x3002;&#x4F46;&#x662F;&#x53CD;&#x4E4B;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x4F60;&#x6307;&#x5B9A; TCP &#x5C01;&#x5305;&#x53D1;&#x9001;&#x65F6;&#x7684;&#x6FC0;&#x6D3B;&#x7684; TCP &#x6807;&#x8BC6;&#x3002;&#x5728;&#x79D8;&#x7C4D;&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>-S</code>&#x9009;&#x9879;&#x8BA9; hping3 &#x4F7F;&#x7528; TCP &#x5C01;&#x5305;&#x7684; SYN &#x6807;&#x8BC6;&#x3002;</p>
<h2 id="310-scapy-&#x8FDE;&#x63A5;&#x626B;&#x63CF;">3.10 Scapy &#x8FDE;&#x63A5;&#x626B;&#x63CF;</h2>
<p>&#x5728;&#x591A;&#x6570;&#x626B;&#x63CF;&#x5DE5;&#x5177;&#x5F53;&#x4E2D;&#xFF0C;TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x6BD4; SYN &#x626B;&#x63CF;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x4E3A;&#x4E86;&#x751F;&#x6210;&#x548C;&#x6CE8;&#x5165; SYN &#x626B;&#x63CF;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x539F;&#x59CB;&#x5C01;&#x5305;&#x800C;&#x63D0;&#x5347;&#x6743;&#x9650;&#x3002;Scapy &#x662F;&#x5B83;&#x7684;&#x4E00;&#x5927;&#x4F8B;&#x5916;&#x3002;Scapy &#x5B9E;&#x9645;&#x4E0A;&#x975E;&#x5E38;&#x96BE;&#x4EE5;&#x6267;&#x884C;&#x5B8C;&#x5168;&#x7684; TCP &#x4E09;&#x6B21;&#x63E1;&#x624B;&#xFF0C;&#x4E5F;&#x4E0D;&#x5B9E;&#x7528;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x51FA;&#x4E8E;&#x66F4;&#x597D;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5982;&#x4F55;&#x4F7F;&#x7528; Scapy &#x6267;&#x884C;&#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Scapy &#x6267;&#x884C;&#x5168;&#x8FDE;&#x63A5;&#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C; UDP &#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Metasploitable2 &#x5B9E;&#x4F8B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E00;&#x8282;&#x4E5F;&#x9700;&#x8981;&#x7F16;&#x5199;&#x811A;&#x672C;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;*VIM &#x548C; Nano&#xFF09;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>Scapy &#x4E2D;&#x5F88;&#x96BE;&#x6267;&#x884C;&#x5168;&#x8FDE;&#x63A5;&#x626B;&#x63CF;&#xFF0C;&#x56E0;&#x4E3A;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x5728; Scapy &#x4E2D;&#x53D1;&#x9001;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x4E14;&#x5C1D;&#x8BD5;&#x963B;&#x6B62;&#x4F60;&#x548C;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x5EFA;&#x7ACB;&#x5B8C;&#x6574;&#x7684;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728; Wireshark &#x6216; tcpdump &#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x53D1;&#x9001; SYN &#x8BF7;&#x6C42;&#x5E76;&#x55C5;&#x63A2;&#x76F8;&#x5173;&#x6D41;&#x91CF;&#x6765;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;&#x5F53;&#x4F60;&#x63A5;&#x6536;&#x5230;&#x6765;&#x81EA;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684; SYN+ACK &#x54CD;&#x5E94;&#x65F6;&#xFF0C;Linux &#x5185;&#x6838;&#x4F1A;&#x62E6;&#x622A;&#x5B83;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x770B;&#x505A;&#x6765;&#x6E90;&#x4E0D;&#x660E;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x5728; Scapy &#x4E2D; &#x53D1;&#x9001;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x5E76;&#x4E14;&#x7CFB;&#x7EDF;&#x4F1A;&#x81EA;&#x52A8;&#x4F7F;&#x7528; TCP RST &#x5C01;&#x5305;&#x6765;&#x56DE;&#x590D;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x65AD;&#x5F00;&#x63E1;&#x624B;&#x8FC7;&#x7A0B;&#x3002;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-comment">#!/usr/bin/python</span>

<span class="hljs-keyword">import</span> logging 
logging.getLogger(<span class="hljs-string">&quot;scapy.runtime&quot;</span>).setLevel(logging.ERROR) 
<span class="hljs-keyword">from</span> scapy.all <span class="hljs-keyword">import</span> *

response = sr1(IP(dst=<span class="hljs-string">&quot;172.16.36.135&quot;</span>)/TCP(dport=<span class="hljs-number">80</span>,flags=<span class="hljs-string">&apos;S&apos;</span>)) 
reply = sr1(IP(dst=<span class="hljs-string">&quot;172.16.36.135&quot;</span>)/TCP(dport=<span class="hljs-number">80</span>,flags=<span class="hljs-string">&apos;A&apos;</span>,ack=(respon se[TCP].seq + <span class="hljs-number">1</span>)))
</code></pre>
<p>&#x8FD9;&#x4E2A; Python &#x811A;&#x672C;&#x7684;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x7528;&#x505A; POC &#x6765;&#x6F14;&#x7CFB;&#x7EDF;&#x7834;&#x574F;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x5047;&#x8BBE;&#x4F60;&#x5C06;&#x5E26;&#x6709;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x6D3B;&#x52A8;&#x7CFB;&#x7EDF;&#x4F5C;&#x4E3A;&#x76EE;&#x6807;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5047;&#x8BBE; SYN+ACK &#x56DE;&#x590D;&#x4F1A;&#x4F5C;&#x4E3A;&#x521D;&#x59CB; SYN &#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#x800C;&#x8FD4;&#x56DE;&#x3002;&#x5373;&#x4F7F;&#x53D1;&#x9001;&#x4E86;&#x6700;&#x540E;&#x7684; ACK &#x56DE;&#x590D;&#xFF0C;&#x5B8C;&#x6210;&#x4E86;&#x63E1;&#x624B;&#xFF0C;RST &#x5C01;&#x5305;&#x4E5F;&#x4F1A;&#x963B;&#x6B62;&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x5C01;&#x5305;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x53D7;&#x6765;&#x8FDB;&#x4E00;&#x6B65;&#x6F14;&#x793A;&#x3002;</p>
<pre><code>#!/usr/bin/python

import logging 
logging.getLogger(&quot;scapy.runtime&quot;).setLevel(logging.ERROR) 
from scapy.all import *

SYN = IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=80,flags=&apos;S&apos;)

print &quot;-- SENT --&quot; 
SYN.display()

print &quot;\n\n-- RECEIVED --&quot; 
response = sr1(SYN,timeout=1,verbose=0) 
response.display()

if int(response[TCP].flags) == 18:   
    print &quot;\n\n-- SENT --&quot;   
    ACK = IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=80,flags=&apos;A&apos;,ack=(response[    TCP].seq + 1))   
    response2 = sr1(ACK,timeout=1,verbose=0)   
    ACK.display()   
    print &quot;\n\n-- RECEIVED --&quot;   
    response2.display() 
else:   
    print &quot;SYN-ACK not returned&quot;
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A; Python &#x811A;&#x672C;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x53D1;&#x9001;&#x7684;&#x5C01;&#x5305;&#x90FD;&#x5728;&#x4F20;&#x8F93;&#x4E4B;&#x524D;&#x5C55;&#x793A;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x6536;&#x5230;&#x7684;&#x5C01;&#x5305;&#x90FD;&#x5728;&#x5230;&#x8FBE;&#x4E4B;&#x540E;&#x5C55;&#x793A;&#x3002;&#x5728;&#x68C0;&#x9A8C;&#x6BCF;&#x4E2A;&#x5C01;&#x5305;&#x6240;&#x6FC0;&#x6D3B;&#x7684; TCP &#x6807;&#x8BC6;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x5931;&#x8D25;&#x4E86;&#x3002;&#x8003;&#x8651;&#x7531;&#x811A;&#x672C;&#x751F;&#x6210;&#x7684;&#x4E0B;&#x5217;&#x8F93;&#x51FA;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# ./tcp_connect.py 
-- SENT -
###[ IP ]###
    version   = 4  
    ihl       = None  
    tos       = 0x0  
    len       = None  
    id        = 1  
    flags     =   
    frag      = 0  
    ttl       = 64  
    proto     = tcp  
    chksum    = None  
    src       = 172.16.36.180  
    dst       = 172.16.36.135  
    \options   \ 
###[ TCP ]###     
    sport     = ftp_data     
    dport     = http     
    seq       = 0     
    ack       = 0     
    dataofs   = None     
    reserved  = 0     
    flags     = S     
    window    = 8192     
    chksum    = None     
    urgptr    = 0     
    options   = {}
-- RECEIVED -
###[ IP ]###  
    version   = 4L  
    ihl       = 5L  
    tos       = 0x0  
    len       = 44  
    id        = 0  
    flags     = DF
    frag      = 0L  
    ttl       = 64  
    proto     = tcp  
    chksum    = 0x9970  
    src       = 172.16.36.135  
    dst       = 172.16.36.180  
    \options   \ 
###[ TCP ]###     
    sport     = http     
    dport     = ftp_data     
    seq       = 3013979073L     
    ack       = 1     
    dataofs   = 6L     
    reserved  = 0L     
    flags     = SA     
    window    = 5840     
    chksum    = 0x801e     
    urgptr    = 0     
    options   = [(&apos;MSS&apos;, 1460)] 
###[ Padding ]###        
    load      = &apos;\x00\x00&apos;
-- SENT -
###[ IP ]###  
    version   = 4  
    ihl       = None  
    tos       = 0x0  
    len       = None  
    id        = 1  
    flags     =   
    frag      = 0  
    ttl       = 64  
    proto     = tcp  
    chksum    = None
    src       = 172.16.36.180  
    dst       = 172.16.36.135  
    \options   \ 
###[ TCP ]###     
    sport     = ftp_data     
    dport     = http     
    seq       = 0     
    ack       = 3013979074L     
    dataofs   = None     
    reserved  = 0     
    flags     = A     
    window    = 8192     
    chksum    = None     
    urgptr    = 0     
    options   = {}
-- RECEIVED -
###[ IP ]###  
    version   = 4L  
    ihl       = 5L  
    tos       = 0x0  
    len       = 40  
    id        = 0  
    flags     = DF  
    frag      = 0L  
    ttl       = 64  
    proto     = tcp  
    chksum    = 0x9974  
    src       = 172.16.36.135  
    dst       = 172.16.36.180  
    \options   \ 
###[ TCP ]###     
    sport     = http     
    dport     = ftp_data
    seq       = 3013979074L     
    ack       = 0     
    dataofs   = 5L     
    reserved  = 0L     
    flags     = R     
    window    = 0     
    chksum    = 0xaeb8     
    urgptr    = 0     
    options   = {} 
###[ Padding ]###        
    load      = &apos;\x00\x00\x00\x00\x00\x00&apos;
</code></pre><p>&#x5728;&#x811A;&#x672C;&#x7684;&#x8F93;&#x51FA;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E86;&#x56DB;&#x4E2A;&#x5C01;&#x5305;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x5C01;&#x5305;&#x662F;&#x53D1;&#x9001;&#x7684; SYN &#x8BF7;&#x6C42;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5C01;&#x5305;&#x65F6;&#x63A5;&#x6536;&#x5230;&#x7684; SYN+ACK &#x56DE;&#x590D;&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x5C01;&#x5305;&#x65F6;&#x53D1;&#x9001;&#x7684; ACK &#x56DE;&#x590D;&#xFF0C;&#x4E4B;&#x540E;&#x63A5;&#x6536;&#x5230;&#x4E86; RST &#x5C01;&#x5305;&#xFF0C;&#x5B83;&#x662F;&#x6700;&#x540E;&#x7684; ACK &#x56DE;&#x590D;&#x7684;&#x54CD;&#x5E94;&#x3002;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5C01;&#x5305;&#x8868;&#x660E;&#xFF0C;&#x5728;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x65F6;&#x51FA;&#x73B0;&#x4E86;&#x95EE;&#x9898;&#x3002;Scapy &#x4E2D;&#x53EF;&#x80FD;&#x80FD;&#x591F;&#x5EFA;&#x7ACB;&#x5B8C;&#x6210;&#x7684;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x9700;&#x8981;&#x5BF9;&#x672C;&#x5730; IP &#x8868;&#x505A;&#x4E00;&#x4E9B;&#x8C03;&#x6574;&#x3002;&#x5C24;&#x5176;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53BB;&#x6389;&#x53D1;&#x5F80;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684; TSR &#x5C01;&#x5305;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x63E1;&#x624B;&#x3002;&#x901A;&#x8FC7;&#x4F7F;&#x7528; IP &#x8868;&#x5EFA;&#x7ACB;&#x8FC7;&#x6EE4;&#x673A;&#x5236;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53BB;&#x6389; RST &#x5C01;&#x5305;&#x6765;&#x5B8C;&#x6210;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5E72;&#x6270;&#x5230;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF08;&#x8FD9;&#x4E2A;&#x914D;&#x7F6E;&#x51FA;&#x4E8E;&#x529F;&#x80FD;&#x4E0A;&#x7684;&#x539F;&#x7406;&#x5E76;&#x4E0D;&#x63A8;&#x8350;&#xFF09;&#x3002;&#x4E3A;&#x4E86;&#x5C55;&#x793A;&#x5B8C;&#x6574;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x7684;&#x6210;&#x529F;&#x5EFA;&#x7ACB;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Netcat &#x5EFA;&#x7ACB; TCP &#x76D1;&#x542C;&#x670D;&#x52A1;&#x3002;&#x4E4B;&#x540E;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528; Scapy &#x8FDE;&#x63A5;&#x5F00;&#x653E;&#x7684;&#x7AEF;&#x53E3;&#x3002;</p>
<pre><code>admin@ubuntu:~$ nc -lvp 4444 
listening on [any] 4444 ...
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5728; TCP &#x7AEF;&#x53E3; 4444 &#x5F00;&#x542F;&#x4E86;&#x76D1;&#x542C;&#x670D;&#x52A1;&#x3002;&#x6211;&#x4EEC;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x4E4B;&#x524D;&#x7684;&#x811A;&#x672C;&#x6765;&#x5C1D;&#x8BD5;&#x8FDE;&#x63A5; &#x7AEF;&#x53E3; 4444 &#x4E0A;&#x7684; Netcat &#x76D1;&#x542C;&#x670D;&#x52A1;&#x3002;</p>
<pre><code>#!/usr/bin/python

import logging 
logging.getLogger(&quot;scapy.runtime&quot;).setLevel(logging.ERROR) 
from scapy.all import *

response = sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=4444,flags=&apos;S&apos;)) 
reply = sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=4444,flags=&apos;A&apos;,ack=(resp onse[TCP].seq + 1)))
</code></pre><p>&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x4E2D;&#xFF0C;SYN &#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x7ED9;&#x4E86;&#x76D1;&#x542C;&#x7AEF;&#x53E3;&#x3002;&#x6536;&#x5230; SYN+ACK &#x56DE;&#x590D;&#x4E4B;&#x540E;&#xFF0C;&#x4F1A;&#x53D1;&#x9001; ACK&#x56DE;&#x590D;&#x3002;&#x4E3A;&#x4E86;&#x9A8C;&#x8BC1;&#x8FDE;&#x63A5;&#x5C1D;&#x8BD5;&#x88AB;&#x7CFB;&#x7EDF;&#x751F;&#x6210;&#x7684; RST &#x5C01;&#x5305;&#x6253;&#x65AD;&#xFF0C;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x5E94;&#x8BE5;&#x5728; Wireshark &#x542F;&#x52A8;&#x4E4B;&#x540E;&#x6267;&#x884C;&#xFF0C;&#x6765;&#x6355;&#x83B7;&#x8BF7;&#x6C42;&#x84C4;&#x529B;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Wireshark &#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x6765;&#x9694;&#x79BB;&#x8FDE;&#x63A5;&#x5C1D;&#x8BD5;&#x5E8F;&#x5217;&#x3002;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x662F;<code>tcp &amp;&amp; (ip.src == 172.16.36.135 || ip.dst == 172.16.36.135)</code>&#x3002;&#x8FC7;&#x6EE4;&#x5668;&#x4EC5;&#x4EC5;&#x7528;&#x4E8E;&#x5C55;&#x793A;&#x6765;&#x81EA;&#x6216;&#x53D1;&#x5F80;&#x88AB;&#x626B;&#x63CF;&#x7CFB;&#x7EDF;&#x7684; TCP &#x6D41;&#x91CF;&#x3002;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="img/3-10-1.jpg" alt=""></p>
<p>&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x7CBE;&#x786E;&#x5B9A;&#x4F4D;&#x4E86;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x53BB;&#x9664;&#x7CFB;&#x7EDF;&#x751F;&#x6210;&#x7684; RST &#x5C01;&#x5305;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x6EE4;&#x5668;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x672C;&#x5730; IP &#x8868;&#x6765;&#x5EFA;&#x7ACB;&#xFF1A;</p>
<blockquote>
<p>&#x4EE5;&#x5982;&#x4E0B;&#x65B9;&#x5F0F;&#x4FEE;&#x6539;&#x672C;&#x5730; IP &#x8868;&#x4F1A;&#x901A;&#x8FC7;&#x963B;&#x585E;&#x6240;&#x6709;&#x53D1;&#x51FA;&#x7684; RST &#x54CD;&#x5E94;&#xFF0C;&#x6539;&#x53D8;&#x548C;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684; TCP/IP &#x4E8B;&#x52A1;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;&#x786E;&#x4FDD;&#x5E38;&#x89C1;&#x7684; iptable &#x89C4;&#x5219;&#x5728;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x79FB;&#x9664;&#xFF0C;&#x6216;&#x8005;&#x4E4B;&#x540E;&#x4F7F;&#x7528;&#x4E0B;&#x5217;&#x547D;&#x4EE4;&#x5237;&#x65B0; iptable&#x3002;</p>
<pre><code>iptables --flush
</code></pre></blockquote>
<pre><code>root@KaliLinux:~# iptables -A OUTPUT -p tcp --tcp-flags RST RST -d 172.16.36.135 -j DROP 
root@KaliLinux:~# iptables --list 
Chain INPUT (policy ACCEPT) 
target     prot opt source               destination         

Chain FORWARD (policy ACCEPT) 
target     prot opt source               destination      

Chain OUTPUT (policy ACCEPT) 
target     prot opt source               destination         
DROP       tcp  --  anywhere             172.16.36.135       tcp flags:RST/RST
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x672C;&#x5730; IP &#x8868;&#x7684;&#x4FEE;&#x6539;&#x53BB;&#x9664;&#x4E86;&#x6240;&#x6709;&#x53D1;&#x5F80;&#x88AB;&#x626B;&#x63CF;&#x4E3B;&#x673A;&#x7684;&#x76EE;&#x6807;&#x5730;&#x5740;&#x7684; TCP RST &#x5C01;&#x5305;&#x3002;<code>list</code>&#x9009;&#x9879;&#x968F;&#x540E;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x67E5;&#x770B; IP &#x8868;&#x7684;&#x6761;&#x76EE;&#xFF0C;&#x4EE5;&#x53CA;&#x9A8C;&#x8BC1;&#x914D;&#x7F6E;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x4FEE;&#x6539;&#x3002;&#x4E3A;&#x4E86;&#x6267;&#x884C;&#x53E6;&#x4E00;&#x6B21;&#x8FDE;&#x63A5;&#x5C1D;&#x8BD5;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x786E;&#x4FDD; Natcat &#x4ECD;&#x65E7;&#x76D1;&#x542C;&#x76EE;&#x6807;&#x7684; 4444 &#x7AEF;&#x53E3;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>admin@ubuntu:~$ nc -lvp 4444 
listening on [any] 4444 ...
</code></pre><p>&#x548C;&#x4E4B;&#x524D;&#x76F8;&#x540C;&#x7684; Python &#x811A;&#x672C;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x4F7F;&#x7528;&#xFF0C;&#x540C;&#x65F6; WIreshark &#x4F1A;&#x6355;&#x83B7;&#x540E;&#x53F0;&#x7684;&#x6D41;&#x91CF;&#x3002;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x7684;&#x663E;&#x793A;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x4E13;&#x6CE8;&#x4E8E;&#x6240;&#x9700;&#x7684;&#x6D41;&#x91CF;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x7684;&#x6240;&#x6709;&#x6B65;&#x9AA4;&#x73B0;&#x5728;&#x90FD;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x6536;&#x5230;&#x7CFB;&#x7EDF;&#x751F;&#x6210;&#x7684; RST &#x5C01;&#x5305;&#x7684;&#x6253;&#x65AD;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="img/3-10-2.jpg" alt=""></p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x770B;&#x8FD0;&#x884C;&#x5728;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684; Netcat &#x670D;&#x52A1;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x5DF2;&#x7ECF;&#x5EFA;&#x7ACB;&#x4E86;&#x8FDE;&#x63A5;&#x3002;&#x8FD9;&#x662F;&#x7528;&#x4E8E;&#x786E;&#x8BA4;&#x6210;&#x529F;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x7684;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x8BC1;&#x636E;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x8F93;&#x51FA;&#x4E2D;&#x770B;&#x5230;&#xFF1A;</p>
<pre><code>admin@ubuntu:~$ nc -lvp 4444 
listening on [any] 4444 ... 172.16.36.132: inverse host lookup failed: No address associated with name 
connect to [172.16.36.135] from (UNKNOWN) [172.16.36.132] 42409
</code></pre><p>&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x7EC3;&#x4E60;&#x5BF9;&#x7406;&#x89E3;&#x548C;&#x89E3;&#x51B3; TCP &#x8FDE;&#x63A5;&#x7684;&#x95EE;&#x9898;&#x5341;&#x5206;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x6062;&#x590D; IP &#x8868;&#x7684;&#x6761;&#x76EE;&#x4E5F;&#x5341;&#x5206;&#x91CD;&#x8981;&#x3002;RST &#x5C01;&#x5305; &#x662F; TCP &#x901A;&#x4FE1;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x53BB;&#x9664;&#x8FD9;&#x4E9B;&#x54CD;&#x5E94;&#x4F1A;&#x5F71;&#x54CD;&#x6B63;&#x5E38;&#x7684;&#x901A;&#x4FE1;&#x529F;&#x80FD;&#x3002;&#x6D17;&#x551B;&#x6309;&#x7684;&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5237;&#x65B0;&#x6211;&#x4EEC;&#x7684; iptable &#x89C4;&#x5219;&#xFF0C;&#x5E76;&#x9A8C;&#x8BC1;&#x5237;&#x65B0;&#x6210;&#x529F;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# iptables --flush 
root@KaliLinux:~# iptables --list 
Chain INPUT (policy ACCEPT) 
target     prot opt source               destination   

Chain FORWARD (policy ACCEPT) 
target     prot opt source               destination    

Chain OUTPUT (policy ACCEPT) 
target     prot opt source               destination
</code></pre><p>&#x5C31;&#x50CF;&#x4F8B;&#x5B50;&#x4E2D;&#x5C55;&#x793A;&#x7684;&#x90A3;&#x6837;&#xFF0C;<code>flush</code>&#x9009;&#x9879;&#x5E94;&#x8BE5;&#x7528;&#x4E8E;&#x6E05;&#x695A; IP &#x8868;&#x7684;&#x6761;&#x76EE;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x591A;&#x6B21;&#x4F7F;&#x7528;<code>list</code>&#x9009;&#x9879;&#x6765;&#x9A8C;&#x8BC1; IP &#x8868;&#x7684;&#x6761;&#x76EE;&#x5DF2;&#x7ECF;&#x79FB;&#x9664;&#x4E86;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x7684;&#x540C;&#x5C45;&#x901A;&#x8FC7;&#x6267;&#x884C;&#x5B8C;&#x6574;&#x7684;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#xFF0C;&#x548C;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684;&#x6240;&#x6709;&#x88AB;&#x626B;&#x63CF;&#x7AEF;&#x53E3;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x3002;&#x7AEF;&#x53E3;&#x7684;&#x72B6;&#x6001;&#x53D6;&#x51B3;&#x4E8E;&#x8FDE;&#x63A5;&#x662F;&#x5426;&#x6210;&#x529F;&#x5EFA;&#x7ACB;&#x3002;&#x5982;&#x679C;&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#xFF0C;&#x7AEF;&#x53E3;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5F00;&#x653E;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x8FDE;&#x63A5;&#x4E0D;&#x80FD;&#x6210;&#x529F;&#x5EFA;&#x7ACB;&#xFF0C;&#x7AEF;&#x53E3;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5173;&#x95ED;&#x7684;&#x3002;</p>
<h2 id="311-nmap-&#x8FDE;&#x63A5;&#x626B;&#x63CF;">3.11 Nmap &#x8FDE;&#x63A5;&#x626B;&#x63CF;</h2>
<p>TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x901A;&#x8FC7;&#x4E0E;&#x8FDC;&#x7A0B;&#x4E3B;&#x673A;&#x4E0A;&#x7684;&#x6BCF;&#x4E2A;&#x88AB;&#x626B;&#x63CF;&#x7684;&#x7AEF;&#x53E3;&#x5EFA;&#x7ACB;&#x5B8C;&#x6574;&#x7684; TCP &#x8FDE;&#x63A5;&#x6765;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Nmap &#x6765;&#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C; TCP &#x9690;&#x79D8;&#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C; TCP &#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Metasploitable2 &#x5B9E;&#x4F8B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>Nmap &#x62E5;&#x6709;&#x7B80;&#x5316; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x7684;&#x9009;&#x9879;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#xFF0C;&#x5E94;&#x4F7F;&#x7528;<code>-sT</code>&#x9009;&#x9879;&#xFF0C;&#x5E76;&#x9644;&#x5E26;&#x88AB;&#x626B;&#x63CF;&#x4E3B;&#x673A;&#x7684; IP &#x5730;&#x5740;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap -sT 172.16.36.135 -p 80

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 22:03 EST
Nmap scan report for 172.16.36.135 
Host is up (0.00072s latency). 
PORT   STATE SERVICE 
80/tcp open  http 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 13.05 seconds
</code></pre><p>&#x5728;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7279;&#x5B9A;&#x7684; IP &#x5730;&#x5740;&#x7684; TCP 80 &#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x4E86; TCP &#x9690;&#x79D8;&#x626B;&#x63CF;&#x3002;&#x548C; Scapy &#x4E2D;&#x7684;&#x6280;&#x5DE7;&#x76F8;&#x4F3C;&#xFF0C;Nmap &#x76D1;&#x542C;&#x54CD;&#x5E94;&#x5E76;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x54CD;&#x5E94;&#x4E2D;&#x6240;&#x6FC0;&#x6D3B;&#x7684; TCP &#x6807;&#x8BC6;&#x6765;&#x8BC6;&#x522B;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C;&#x591A;&#x4E2A;&#x7279;&#x5B9A;&#x7AEF;&#x53E3;&#x7684;&#x626B;&#x63CF;&#xFF0C;&#x901A;&#x8FC7;&#x4F20;&#x9012;&#x9017;&#x53F7;&#x5206;&#x9694;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#x5217;&#x8868;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap -sT 172.16.36.135 -p 21,80,443

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 22:03 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00012s latency). 
PORT    STATE  SERVICE 
21/tcp  open   ftp 
80/tcp  open   http 
443/tcp closed https 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 13.05 seconds
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x76EE;&#x6807; IP &#x5730;&#x5740;&#x7684;&#x7AEF;&#x53E3; 21&#x3001;80 &#x548C; 443 &#x4E0A;&#x6267;&#x884C;&#x4E86; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Nmap &#x6765;&#x626B;&#x63CF;&#x4E3B;&#x673A;&#x5E8F;&#x5217;&#xFF0C;&#x901A;&#x8FC7;&#x6807;&#x660E;&#x8981;&#x626B;&#x63CF;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x4EE5;&#x7834;&#x6298;&#x53F7;&#x5206;&#x9694;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nmap -sT 172.16.36.135 -p 20-25

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 21:48 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00019s latency). 
PORT   STATE  SERVICE 
20/tcp closed ftp-data 
21/tcp open   ftp
22/tcp open   ssh 
23/tcp open   telnet 
24/tcp closed priv-mail 
25/tcp open   smtp 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 13.05 seconds
</code></pre><p>&#x5728;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;SYN &#x626B;&#x63CF;&#x5728; TCP 20 &#x5230; 25 &#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x3002;&#x9664;&#x4E86;&#x62E5;&#x6709;&#x6307;&#x5B9A;&#x88AB;&#x626B;&#x63CF;&#x7AEF;&#x53E3;&#x7684;&#x80FD;&#x529B;&#x4E4B;&#x5916;&#x3002;Nmap &#x540C;&#x65F6;&#x62E5;&#x6709;&#x914D;&#x7F6E;&#x597D;&#x7684; 1000 &#x548C;&#x5E38;&#x7528;&#x7AEF;&#x53E3;&#x7684;&#x5217;&#x8868;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x626B;&#x63CF;&#xFF0C;&#x901A;&#x8FC7;&#x4E0D;&#x5E26;&#x4EFB;&#x4F55;&#x7AEF;&#x53E3;&#x6307;&#x5B9A;&#x4FE1;&#x606F;&#x6765;&#x8FD0;&#x884C; Nmap&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nmap -sT 172.16.36.135

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 22:13 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00025s latency). 
Not shown: 977 closed ports 
PORT     STATE SERVICE 
21/tcp   open  ftp 
22/tcp   open  ssh 
23/tcp   open  telnet 
25/tcp   open  smtp 
53/tcp   open  domain 
80/tcp   open  http 
111/tcp  open  rpcbind 
139/tcp  open  netbios-ssn 
445/tcp  open  microsoft-ds 
512/tcp  open  exec 
513/tcp  open  login 
514/tcp  open  shell 
1099/tcp open  rmiregistry 
1524/tcp open  ingreslock 
2049/tcp open  nfs 
2121/tcp open  ccproxy-ftp 
3306/tcp open  mysql
5432/tcp open  postgresql 
5900/tcp open  vnc 
6000/tcp open  X11 
6667/tcp open  irc 
8009/tcp open  ajp13 
8180/tcp open  unknown 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 13.13 seconds
</code></pre><p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x626B;&#x63CF;&#x4E86; Nmap &#x5B9A;&#x4E49;&#x7684; 1000 &#x4E2A;&#x5E38;&#x7528;&#x7AEF;&#x53E3;&#xFF0C;&#x7528;&#x4E8E;&#x8BC6;&#x522B; Metasploitable2  &#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x5927;&#x91CF;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x6280;&#x5DE7;&#x5728;&#x662F;&#x88AB;&#x591A;&#x6570;&#x8BBE;&#x5907;&#x4E0A;&#x5F88;&#x9AD8;&#x6548;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x6A21;&#x7CCA;&#x7684;&#x670D;&#x52A1;&#x6216;&#x8005;&#x4E0D;&#x5E38;&#x89C1;&#x7684;&#x7AEF;&#x53E3;&#x7EC4;&#x5408;&#x3002;&#x5982;&#x679C;&#x626B;&#x63CF;&#x5728;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684; TCP &#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#xFF0C;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x503C;&#x90FD;&#x9700;&#x8981;&#x88AB;&#x626B;&#x63CF;&#x3002;&#x5B9A;&#x4E49;&#x4E86;&#x6E90;&#x7AEF;&#x53E3;&#x548C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x7684; TCP &#x5934;&#x90E8;&#x90E8;&#x5206;&#x662F; 16 &#x4F4D;&#x957F;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x6BCF;&#x4E00;&#x4F4D;&#x53EF;&#x4EE5;&#x4E3A; 1 &#x6216;&#x8005; 0&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5171;&#x6709;<code>2 ** 16</code>&#x6216;&#x8005; 65536 &#x4E2A;&#x53EF;&#x80FD;&#x7684; TCP &#x7AEF;&#x53E3;&#x5730;&#x5740;&#x3002;&#x5BF9;&#x4E8E;&#x8981;&#x626B;&#x63CF;&#x7684;&#x5168;&#x90E8;&#x53EF;&#x80FD;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B; 0 &#x5230; 65535 &#x7684;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nmap -sT 172.16.36.135 -p 0-65535

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 22:14 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00076s latency). 
Not shown: 65506 closed ports 
PORT      STATE SERVICE 
21/tcp    open  ftp 
22/tcp    open  ssh 
23/tcp    open  telnet 
25/tcp    open  smtp 
53/tcp    open  domain 
80/tcp    open  http 
111/tcp   open  rpcbind 
139/tcp   open  netbios-ssn 
445/tcp   open  microsoft-ds 
512/tcp   open  exec 
513/tcp   open  login 
514/tcp   open  shell
1099/tcp  open  rmiregistry 
1524/tcp  open  ingreslock 
2049/tcp  open  nfs 
2121/tcp  open  ccproxy-ftp 
3306/tcp  open  mysql 
3632/tcp  open  distccd 
5432/tcp  open  postgresql 
5900/tcp  open  vnc 
6000/tcp  open  X11 
6667/tcp  open  irc 
6697/tcp  open  unknown 
8009/tcp  open  ajp13 
8180/tcp  open  unknown 
8787/tcp  open  unknown 
34789/tcp open  unknown 
50333/tcp open  unknown 
56375/tcp open  unknown 
57385/tcp open  unknown 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 17.05 seconds
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;Metasploitable2 &#x7CFB;&#x7EDF;&#x4E0A;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684; 65536 &#x548C; TCP &#x5730;&#x5740;&#x90FD;&#x626B;&#x63CF;&#x4E86;&#x4E00;&#x904D;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x8BE5;&#x626B;&#x63CF;&#x4E2D;&#x8BC6;&#x522B;&#x7684;&#x591A;&#x6570;&#x670D;&#x52A1;&#x90FD;&#x5728;&#x6807;&#x51C6;&#x7684; Nmap 1000 &#x626B;&#x63CF;&#x4E2D;&#x8BC6;&#x522B;&#x8FC7;&#x4E86;&#x3002;&#x8FD9;&#x5C31;&#x8868;&#x660E;&#x5728;&#x5C1D;&#x8BD5;&#x8BC6;&#x522B;&#x76EE;&#x6807;&#x7684;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x653B;&#x51FB;&#x9762;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B8C;&#x6574;&#x626B;&#x63CF;&#x662F;&#x4E2A;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x3002;Nmap &#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7834;&#x6298;&#x53F7;&#x8BB0;&#x6CD5;&#xFF0C;&#x626B;&#x63CF;&#x4E3B;&#x673A;&#x5217;&#x8868;&#x4E0A;&#x7684; TCP &#x7AEF;&#x53E3;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nmap 172.16.36.0-255 -sT -p 80

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 22:16 EST 
Nmap scan report for 172.16.36.1 Host is up (0.00026s latency). 
PORT   STATE  SERVICE 
80/tcp closed http 
MAC Address: 00:50:56:C0:00:08 (VMware)

Nmap scan report for 172.16.36.2 Host is up (0.00018s latency). 
PORT   STATE  SERVICE 
80/tcp closed http 
MAC Address: 00:50:56:FF:2A:8E (VMware)

Nmap scan report for 172.16.36.132 Host is up (0.00047s latency). 
PORT   STATE  SERVICE 
80/tcp closed http 
MAC Address: 00:0C:29:65:FC:D2 (VMware)

Nmap scan report for 172.16.36.135 
Host is up (0.00016s latency). 
PORT   STATE SERVICE 
80/tcp open  http 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap scan report for 172.16.36.180 
Host is up (0.0029s latency). 
PORT   STATE SERVICE 
80/tcp open  http

Nmap done: 256 IP addresses (5 hosts up) scanned in 42.55 seconds
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;TCP 80 &#x7AEF;&#x53E3;&#x7684; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x5728;&#x6307;&#x5B9A;&#x5730;&#x5740;&#x8303;&#x56F4;&#x5185;&#x7684;&#x6240;&#x6709;&#x4E3B;&#x673A;&#x4E0A;&#x6267;&#x884C;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x626B;&#x63CF;&#x4EC5;&#x4EC5;&#x6267;&#x884C;&#x5728;&#x5355;&#x4E2A;&#x7AEF;&#x53E3;&#x4E0A;&#xFF0C;Nmap &#x4E5F;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x626B;&#x63CF;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x591A;&#x4E2A;&#x7AEF;&#x53E3;&#x548C;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#x3002;&#x6B64;&#x5916;&#xFF0C;Nmap &#x4E5F;&#x80FD;&#x591F;&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#xFF0C;&#x57FA;&#x4E8E; IP &#x5730;&#x5740;&#x7684;&#x8F93;&#x5165;&#x5217;&#x8868;&#x6765;&#x626B;&#x63CF;&#x4E3B;&#x673A;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<code>-iL</code>&#x9009;&#x9879;&#x5E76;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x5982;&#x679C;&#x6587;&#x4EF6;&#x5B58;&#x653E;&#x4E8E;&#x6267;&#x884C;&#x76EE;&#x5F55;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x6765;&#x5B8C;&#x6210;&#x3002;Nmap &#x4E4B;&#x540E;&#x4F1A;&#x904D;&#x5386;&#x8F93;&#x5165;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x5BF9;&#x5730;&#x5740;&#x6267;&#x884C;&#x7279;&#x5B9A;&#x7684;&#x626B;&#x63CF;&#x3002;</p>
<pre><code>root@KaliLinux:~# cat iplist.txt 
172.16.36.1 
172.16.36.2 
172.16.36.132 
172.16.36.135

root@KaliLinux:~# nmap -sT -iL iplist.txt -p 80

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-17 22:17 EST 
Nmap scan report for 172.16.36.1 
Host is up (0.00016s latency). 
PORT   STATE  SERVICE 
80/tcp closed http 
MAC Address: 00:50:56:C0:00:08 (VMware)

Nmap scan report for 172.16.36.2 
Host is up (0.00047s latency). 
PORT   STATE  SERVICE 
80/tcp closed http 
MAC Address: 00:50:56:FF:2A:8E (VMware)

Nmap scan report for 172.16.36.132 
Host is up (0.00034s latency). 
PORT   STATE  SERVICE 
80/tcp closed http 
MAC Address: 00:0C:29:65:FC:D2 (VMware)

Nmap scan report for 172.16.36.135 
Host is up (0.00016s latency). 
PORT   STATE SERVICE 
80/tcp open  http 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 4 IP addresses (4 hosts up) scanned in 13.05 seconds
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x7684;&#x5DE5;&#x5177;&#x901A;&#x8FC7;&#x6267;&#x884C;&#x5B8C;&#x6574;&#x7684;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#xFF0C;&#x548C;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684;&#x6240;&#x6709;&#x88AB;&#x626B;&#x63CF;&#x7AEF;&#x53E3;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x3002;&#x7AEF;&#x53E3;&#x7684;&#x72B6;&#x6001;&#x53D6;&#x51B3;&#x4E8E;&#x8FDE;&#x63A5;&#x662F;&#x5426;&#x6210;&#x529F;&#x5EFA;&#x7ACB;&#x3002;&#x5982;&#x679C;&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#xFF0C;&#x7AEF;&#x53E3;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5F00;&#x653E;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x8FDE;&#x63A5;&#x4E0D;&#x80FD;&#x6210;&#x529F;&#x5EFA;&#x7ACB;&#xFF0C;&#x7AEF;&#x53E3;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5173;&#x95ED;&#x7684;&#x3002;</p>
<h2 id="312-metasploit-&#x8FDE;&#x63A5;&#x626B;&#x63CF;">3.12 Metasploit &#x8FDE;&#x63A5;&#x626B;&#x63CF;</h2>
<p>&#x9664;&#x4E86;&#x5176;&#x5B83;&#x53EF;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x4E4B;&#x5916;&#xFF0C;Metasploit &#x62E5;&#x6709;&#x7528;&#x4E8E;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x7684;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#x3002;&#x5C06; Metasploit &#x7528;&#x4E8E;&#x626B;&#x63CF;&#xFF0C;&#x4EE5;&#x53CA;&#x5229;&#x7528;&#xFF0C;&#x80FD;&#x591F;&#x9AD8;&#x6548;&#x51CF;&#x5C11;&#x7528;&#x4E8E;&#x5B8C;&#x6210;&#x6E17;&#x900F;&#x6D4B;&#x8BD5;&#x6240;&#x9700;&#x5DE5;&#x5177;&#x6570;&#x91CF;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Metasploit &#x6765;&#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Metasploit &#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C; TCP &#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Metasploitable2 &#x5B9E;&#x4F8B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>Metasploit &#x62E5;&#x6709;&#x53EF;&#x4EE5;&#x5BF9;&#x7279;&#x5B9A; TCP &#x7AEF;&#x53E3;&#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x7684;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#x3002;&#x4E3A;&#x4E86;&#x5728; Kali &#x4E2D;&#x542F;&#x52A8; Metasploit&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7EC8;&#x7AEF;&#x4E2D;&#x6267;&#x884C;<code>msfconsole</code>&#x547D;&#x4EE4;&#x3002;</p>
<pre><code>root@KaliLinux:~# msfconsole 
MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM 
MMMMMMMMMMM                MMMMMMMMMM 
MMMN$                           vMMMM 
MMMNl  MMMMM             MMMMM  JMMMM 
MMMNl  MMMMMMMN       NMMMMMMM  JMMMM 
MMMNl  MMMMMMMMMNmmmNMMMMMMMMM  JMMMM 
MMMNI  MMMMMMMMMMMMMMMMMMMMMMM  jMMMM 
MMMNI  MMMMMMMMMMMMMMMMMMMMMMM  jMMMM 
MMMNI  MMMMM   MMMMMMM   MMMMM  jMMMM 
MMMNI  MMMMM   MMMMMMM   MMMMM  jMMMM 
MMMNI  MMMNM   MMMMMMM   MMMMM  jMMMM 
MMMNI  WMMMM   MMMMMMM   MMMM#  JMMMM 
MMMMR  ?MMNM             MMMMM .dMMMM 
MMMMNm `?MMM             MMMM` dMMMMM 
MMMMMMN  ?MM             MM?  NMMMMMN 
MMMMMMMMNe                 JMMMMMNMMM 
MMMMMMMMMMNm,            eMMMMMNMMNMM 
MMMMNNMNMMMMMNx        MMMMMMNMMNMMNM MMMMMMMMNMMNMMMMm+..+MMNMMNMNMMNMMNMM
        http://metasploit.pro

Tired of typing &apos;set RHOSTS&apos;? Click &amp; pwn with Metasploit Pro -- type &apos;go_pro&apos; to launch it now.

       =[ metasploit v4.6.0-dev [core:4.6 api:1.0] 
+ -- --=[ 1053 exploits - 590 auxiliary - 174 post 
+ -- --=[ 275 payloads - 28 encoders - 8 nops

msf &gt; use auxiliary/scanner/portscan/tcp 
msf  auxiliary(tcp) &gt; show options

Module options (auxiliary/scanner/portscan/tcp):

    Name         Current Setting  Required  Description   
    ----         ---------------  --------  ----------   
    CONCURRENCY  10               yes       The number of concurrent ports to check per hos
    PORTS        1-10000          yes       Ports to scan (e.g. 2225,80,110-900)   
    RHOSTS                        yes       The target address range or CIDR identifier   
    THREADS      1                yes       The number of concurrent threads   
    TIMEOUT      1000             yes       The reply read timeout in milliseconds
</code></pre><p>&#x4E3A;&#x4E86;&#x5728; Metasploit &#x4E2D;&#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#xFF0C;&#x4EE5;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#x7684;&#x76F8;&#x5BF9;&#x8DEF;&#x5F84;&#x8C03;&#x7528;<code>use</code>&#x547D;&#x4EE4;&#x3002;&#x4E00;&#x65E6;&#x6A21;&#x5757;&#x88AB;&#x9009;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x6267;&#x884C;<code>show options</code>&#x547D;&#x4EE4;&#x6765;&#x786E;&#x8BA4;&#x6216;&#x4FEE;&#x6539;&#x626B;&#x63CF;&#x914D;&#x7F6E;&#x3002;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x4F1A;&#x5C55;&#x793A;&#x56DB;&#x5217;&#x7684;&#x8868;&#x683C;&#xFF0C;&#x5305;&#x62EC;<code>name</code>&#x3001;<code>current settings</code>&#x3001;<code>required</code>&#x548C;<code>description</code>&#x3002;<code>name</code>&#x5217;&#x6807;&#x51FA;&#x4E86;&#x6BCF;&#x4E2A;&#x53EF;&#x914D;&#x7F6E;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x3002;<code>current settings</code>&#x5217;&#x5217;&#x51FA;&#x4E86;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x53D8;&#x91CF;&#x7684;&#x73B0;&#x6709;&#x914D;&#x7F6E;&#x3002;<code>required</code>&#x5217;&#x6807;&#x51FA;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x53D8;&#x91CF;&#xFF0C;&#x503C;&#x662F;&#x5426;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x3002;<code>description</code>&#x5217;&#x63CF;&#x8FF0;&#x4E86;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>set</code>&#x547D;&#x4EE4;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x65B0;&#x7684;&#x503C;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x6765;&#x4FEE;&#x6539;&#x3002;</p>
<pre><code>msf  auxiliary(tcp) &gt; set RHOSTS 172.16.36.135 
RHOSTS =&gt; 172.16.36.135 
msf  auxiliary(tcp) &gt; set PORTS 80 
PORTS =&gt; 80 
msf  auxiliary(tcp) &gt; show options

Module options (auxiliary/scanner/portscan/tcp):

   Name         Current Setting  Required  Description   
   ----         ---------------  --------  ----------   
   CONCURRENCY  10               yes       The number of concurrent ports to check per hos
   PORTS        80               yes       Ports to scan (e.g. 2225,80,110-900)   
   RHOSTS       172.16.36.135    yes       The target address range or CIDR identifier   
   THREADS      1                yes       The number of concurrent threads   
   TIMEOUT      1000             yes       The reply read timeout in milliseconds

msf  auxiliary(tcp) &gt; run

[*] 172.16.36.135:80 - TCP OPEN 
[*] Scanned 1 of 1 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>RHOSTS</code>&#x503C;&#x4FEE;&#x6539;&#x4E3A;&#x6211;&#x4EEC;&#x6253;&#x7B97;&#x626B;&#x63CF;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684; IP &#x5730;&#x5740;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x4FEE;&#x6539;&#x4E3A; 20&#x3002;<code>PORTS</code>&#x503C;&#x8BBE;&#x4E3A; TCP &#x7AEF;&#x53E3; 80&#xFF08;HTTP&#xFF09;&#x3002;&#x4FEE;&#x6539;&#x4E86;&#x5FC5;&#x8981;&#x7684;&#x53D8;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x4F7F;&#x7528;<code>show options</code>&#x547D;&#x4EE4;&#x6765;&#x9A8C;&#x8BC1;&#x3002;&#x4E00;&#x65E6;&#x6240;&#x9700;&#x914D;&#x7F6E;&#x9A8C;&#x8BC1;&#x5B8C;&#x6BD5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x626B;&#x63CF;&#x4E86;&#x3002;</p>
<p><code>run</code>&#x547D;&#x4EE4;&#x5BF9;&#x6307;&#x5B9A; IP &#x5730;&#x5740;&#x7684; 80 &#x7AEF;&#x53E3;&#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x3002;&#x8FD9;&#x4E2A; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x4E5F;&#x53EF;&#x4EE5;&#x5BF9; TCP &#x7AEF;&#x53E3;&#x5E8F;&#x5217;&#x6267;&#x884C;&#xFF0C;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x4EE5;&#x7834;&#x6298;&#x53F7;&#x5206;&#x9694;&#xFF1A;</p>
<pre><code>msf  auxiliary(tcp) &gt; set PORTS 0-100 
PORTS =&gt; 0-100 
msf  auxiliary(tcp) &gt; set THREADS 20 
THREADS =&gt; 20
msf  auxiliary(tcp) &gt; show options

Module options (auxiliary/scanner/portscan/tcp):

   Name         Current Setting  Required  Description   
   ----         ---------------  --------  ----------   
   CONCURRENCY  10               yes       The number of concurrent ports to check per hos
   PORTS        0-100            yes       Ports to scan (e.g. 2225,80,110-900)   
   RHOSTS       172.16.36.135    yes       The target address range or CIDR identifier   
   THREADS      20               yes       The number of concurrent threads   
   TIMEOUT      1000              yes       The reply read timeout in milliseconds

msf  auxiliary(tcp) &gt; run

[*] 172.16.36.135:25 - TCP OPEN 
[*] 172.16.36.135:23 - TCP OPEN 
[*] 172.16.36.135:22 - TCP OPEN 
[*] 172.16.36.135:21 - TCP OPEN 
[*] 172.16.36.135:53 - TCP OPEN 
[*] 172.16.36.135:80 - TCP OPEN 
[*] Scanned 1 of 1 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x4FEE;&#x6539;&#x4E3A; 20&#x3002;<code>THREADS</code>&#x7684;&#x503C;&#x5B9A;&#x4E49;&#x4E86;&#x5728;&#x540E;&#x53F0;&#x6267;&#x884C;&#x7684;&#x5F53;&#x524D;&#x4EFB;&#x52A1;&#x6570;&#x91CF;&#x3002;&#x786E;&#x5B9A;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x6D89;&#x53CA;&#x5230;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x5E73;&#x8861;&#xFF0C;&#x65E2;&#x80FD;&#x63D0;&#x5347;&#x4EFB;&#x52A1;&#x901F;&#x5EA6;&#xFF0C;&#x53C8;&#x4E0D;&#x4F1A;&#x8FC7;&#x5EA6;&#x6D88;&#x8017;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x3002;&#x5BF9;&#x4E8E;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#xFF0C;20 &#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x8DB3;&#x591F;&#x5FEB;&#xFF0C;&#x5E76;&#x4E14;&#x76F8;&#x5F53;&#x5408;&#x7406;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x626B;&#x63CF;&#x8BC6;&#x522B;&#x4E86;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684;&#x591A;&#x4E2A;&#x8BBE;&#x5907;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x786E;&#x8BA4;&#x6240;&#x6709;&#x8BBE;&#x5907;&#x90FD;&#x8BC6;&#x522B;&#x51FA;&#x6765;&#xFF0C;&#x9664;&#x975E;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x90FD;&#x626B;&#x63CF;&#x5230;&#x3002;&#x5B9A;&#x4E49;&#x6765;&#x6E90;&#x548C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x7684;TCP &#x5934;&#x90E8;&#x90E8;&#x5206;&#x662F; 16 &#x4F4D;&#x957F;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x6BCF;&#x4E00;&#x4F4D;&#x53EF;&#x4EE5;&#x4E3A; 1 &#x6216;&#x8005; 0&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5171;&#x6709;<code>2 ** 16</code>&#x6216; 65536 &#x4E2A;&#x53EF;&#x80FD;&#x7684; TCP &#x7AEF;&#x53E3;&#x5730;&#x5740;&#x3002;&#x5BF9;&#x4E8E;&#x8981;&#x626B;&#x63CF;&#x7684;&#x6574;&#x4E2A;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B; 0 &#x5230; 65535 &#x7684; &#x7AEF;&#x53E3;&#x8303;&#x56F4;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>msf  auxiliary(tcp) &gt; set PORTS 0-65535 
PORTS =&gt; 0-65535 
msf  auxiliary(tcp) &gt; show options

Module options (auxiliary/scanner/portscan/tcp):

   Name         Current Setting  Required  Description   
   ----         ---------------  --------  ----------   
   CONCURRENCY  10               yes       The number of concurrent ports to check per host
   PORTS        0-65535          yes       Ports to scan (e.g. 2225,80,110-900)   
   RHOSTS       172.16.36.135    yes       The target address range or CIDR identifier   
   THREADS      20               yes       The number of concurrent threads   
   TIMEOUT      1000             yes       The reply read timeout in milliseconds 

msf  auxiliary(tcp) &gt; run

[*] 172.16.36.135:25 - TCP OPEN 
[*] 172.16.36.135:23 - TCP OPEN 
[*] 172.16.36.135:22 - TCP OPEN 
[*] 172.16.36.135:21 - TCP OPEN 
[*] 172.16.36.135:53 - TCP OPEN 
[*] 172.16.36.135:80 - TCP OPEN 
[*] 172.16.36.135:111 - TCP OPEN 
[*] 172.16.36.135:139 - TCP OPEN 
[*] 172.16.36.135:445 - TCP OPEN 
[*] 172.16.36.135:514 - TCP OPEN 
[*] 172.16.36.135:513 - TCP OPEN 
[*] 172.16.36.135:512 - TCP OPEN 
[*] 172.16.36.135:1099 - TCP OPEN 
[*] 172.16.36.135:1524 - TCP OPEN 
[*] 172.16.36.135:2049 - TCP OPEN 
[*] 172.16.36.135:2121 - TCP OPEN 
[*] 172.16.36.135:3306 - TCP OPEN 
[*] 172.16.36.135:3632 - TCP OPEN 
[*] 172.16.36.135:5432 - TCP OPEN 
[*] 172.16.36.135:5900 - TCP OPEN 
[*] 172.16.36.135:6000 - TCP OPEN 
[*] 172.16.36.135:6667 - TCP OPEN 
[*] 172.16.36.135:6697 - TCP OPEN
[*] 172.16.36.135:8009 - TCP OPEN 
[*] 172.16.36.135:8180 - TCP OPEN 
[*] 172.16.36.135:8787 - TCP OPEN 
[*] 172.16.36.135:34789 - TCP OPEN 
[*] 172.16.36.135:50333 - TCP OPEN 
[*] 172.16.36.135:56375 - TCP OPEN 
[*] 172.16.36.135:57385 - TCP OPEN
[*] Scanned 1 of 1 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684;&#x6240;&#x6709;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x90FD;&#x7531;&#x626B;&#x63CF;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684; TCP &#x7AEF;&#x53E3;&#x5730;&#x5740;&#x6765;&#x8BC6;&#x522B;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x626B;&#x63CF;&#x914D;&#x7F6E;&#x4F7F;&#x7528;&#x7834;&#x6298;&#x53F7;&#x8BB0;&#x6CD5;&#x6765;&#x626B;&#x63CF;&#x5730;&#x5740;&#x5E8F;&#x5217;&#x3002;</p>
<pre><code>msf  auxiliary(tcp) &gt; set RHOSTS 172.16.36.0-255 
RHOSTS =&gt; 172.16.36.0-255 
msf  auxiliary(tcp) &gt; show options

Module options (auxiliary/scanner/portscan/tcp):

   Name         Current Setting  Required  Description   
   ----         ---------------  --------  ----------  
   CONCURRENCY  10               yes       The number of concurrent ports to check per host    
   PORTS        80               yes       Ports to scan (e.g. 2225,80,110-900)   
   RHOSTS       172.16.36.0-255  yes       The target address range or CIDR identifier   
   THREADS      20               yes       The number of concurrent threads   
   TIMEOUT      1000             yes       The reply read timeout in milliseconds

msf  auxiliary(tcp) &gt; run

[*] Scanned 026 of 256 hosts (010% complete) 
[*] Scanned 056 of 256 hosts (021% complete) 
[*] Scanned 078 of 256 hosts (030% complete)
[*] Scanned 103 of 256 hosts (040% complete) 
[*] 172.16.36.135:22 - TCP OPEN 
[*] 172.16.36.135:80 - TCP OPEN 
[*] 172.16.36.132:22 - TCP OPEN 
[*] Scanned 128 of 256 hosts (050% complete) 
[*] Scanned 161 of 256 hosts (062% complete) 
[*] 172.16.36.180:22 - TCP OPEN 
[*] 172.16.36.180:80 - TCP OPEN 
[*] Scanned 180 of 256 hosts (070% complete) 
[*] Scanned 206 of 256 hosts (080% complete) 
[*] Scanned 232 of 256 hosts (090% complete) 
[*] Scanned 256 of 256 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x6267;&#x884C;&#x5728;&#x7531;<code>RHOST</code>&#x53D8;&#x91CF;&#x6307;&#x5B9A;&#x7684;&#x6240;&#x6709;&#x4E3B;&#x673A;&#x5730;&#x5740;&#x7684; 80 &#x7AEF;&#x53E3;&#x4E0A;&#x3002;&#x4E0E;&#x4E4B;&#x76F8;&#x4F3C;&#xFF0C;<code>RHOSTS</code>&#x53EF;&#x4EE5;&#x4F7F;&#x7528; CIDR &#x8BB0;&#x6CD5;&#x5B9A;&#x4E49;&#x7F51;&#x7EDC;&#x8303;&#x56F4;&#x3002;</p>
<pre><code>msf  auxiliary(tcp) &gt; set RHOSTS 172.16.36.0/24 
RHOSTS =&gt; 172.16.36.0/24 
msf  auxiliary(tcp) &gt; show options

Module options (auxiliary/scanner/portscan/tcp):

   Name         Current Setting  Required  Description   
   ----         ---------------  --------  ----------   
   CONCURRENCY  10               yes       The number of concurrent ports to check per host 
   PORTS        80               yes       Ports to scan (e.g. 2225,80,110-900)   
   RHOSTS       172.16.36.0/24   yes       The target address range or CIDR identifier   
   THREADS      20               yes       The number of concurrent threads   
   TIMEOUT      1000             yes       The reply read timeout in milliseconds

msf  auxiliary(tcp) &gt; run

[*] Scanned 038 of 256 hosts (014% complete) 
[*] Scanned 053 of 256 hosts (020% complete) 
[*] Scanned 080 of 256 hosts (031% complete) 
[*] Scanned 103 of 256 hosts (040% complete) 
[*] 172.16.36.135:80 - TCP OPEN 
[*] 172.16.36.135:22 - TCP OPEN 
[*] 172.16.36.132:22 - TCP OPEN 
[*] Scanned 138 of 256 hosts (053% complete) 
[*] Scanned 157 of 256 hosts (061% complete) 
[*] 172.16.36.180:22 - TCP OPEN 
[*] 172.16.36.180:80 - TCP OPEN 
[*] Scanned 182 of 256 hosts (071% complete) 
[*] Scanned 210 of 256 hosts (082% complete) 
[*] Scanned 238 of 256 hosts (092% complete) 
[*] Scanned 256 of 256 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Metasploit TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#x80CC;&#x540E;&#x7684;&#x5E95;&#x5C42;&#x539F;&#x7406;&#x548C;&#x4EFB;&#x4F55;&#x5176;&#x5B83; TCP &#x8FDE;&#x626B;&#x63CF;&#x5DE5;&#x5177;&#x4E00;&#x6837;&#x3002;&#x4F7F;&#x7528; MEtasploit &#x6765;&#x6267;&#x884C;&#x8FD9;&#x79CD;&#x626B;&#x63CF;&#x7684;&#x6709;&#x70B9;&#x4E8B;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x6240;&#x9700;&#x5DE5;&#x5177;&#x7684;&#x603B;&#x6570;&#x3002;</p>
<h2 id="313-dmitry-&#x8FDE;&#x63A5;&#x626B;&#x63CF;">3.13 Dmitry &#x8FDE;&#x63A5;&#x626B;&#x63CF;</h2>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5BF9;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x7684; &#x66FF;&#x4EE3;&#x5DE5;&#x5177;&#x5C31;&#x662F; Dmitry&#x3002;&#x4E0D;&#x50CF; Nmap &#x548C; Metasploit&#xFF0C;Dmitry &#x662F;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x6267;&#x884C;&#x7B80;&#x5355;&#x5FEB;&#x901F;&#x7684;&#x626B;&#x63CF;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x914D;&#x7F6E;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Dmitry &#x6765;&#x81EA;&#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Dmitry &#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C; TCP &#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Metasploitable2 &#x5B9E;&#x4F8B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>Dmitry &#x662F;&#x4E2A;&#x591A;&#x7528;&#x9014;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6267;&#x884C;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684; TCP &#x626B;&#x63CF;&#x3002;&#x5B83;&#x7684;&#x529F;&#x80FD;&#x5341;&#x5206;&#x6709;&#x9650;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x662F;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5FEB;&#x901F;&#x800C;&#x9AD8;&#x6548;&#x3002;&#x4E3A;&#x4E86;&#x67E5;&#x770B; Dmitry &#x7684;&#x53EF;&#x7528;&#x9009;&#x9879;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7EC8;&#x7AEF;&#x4E2D;&#x4E0D;&#x5E26;&#x4EFB;&#x4F55;&#x53C2;&#x6570;&#x6765;&#x542F;&#x52A8;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# dmitry 
Deepmagic Information Gathering Tool 
&quot;There be some deep magic going on&quot;

Usage: dmitry [-winsepfb] [-t 0-9] [-o %host.txt] host
  -o   Save output to %host.txt or to file specified by -o file  
  -i   Perform a whois lookup on the IP address of a host  
  -w   Perform a whois lookup on the domain name of a host 
  -n   Retrieve Netcraft.com information on a host 
  -s   Perform a search for possible subdomains
  -e   Perform a search for possible email addresses 
  -p   Perform a TCP port scan on a host 
* -f   Perform a TCP port scan on a host showing output reporting filtered ports 
* -b   Read in the banner received from the scanned port 
* -t 0-9 Set the TTL in seconds when scanning a TCP port ( Default 2 ) 
*Requires the -p flagged to be passed
</code></pre><p>&#x5C31;&#x50CF;&#x8F93;&#x51FA;&#x4E2D;&#x6240;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF0C;<code>-p</code>&#x9009;&#x9879;&#x7528;&#x4E8E;&#x6267;&#x884C; TCP &#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x88AB;&#x626B;&#x63CF;&#x7CFB;&#x7EDF;&#x7684; IP &#x5730;&#x5740;&#x6765;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x9009;&#x9879;&#x3002;Dmitry &#x62E5;&#x6709; 150 &#x4E2A;&#x5E38;&#x7528;&#x7684;&#x9884;&#x914D;&#x7F6E;&#x7AEF;&#x53E3;&#xFF0C;&#x5B83;&#x4F1A;&#x626B;&#x63CF;&#x8FD9;&#x4E9B;&#x3002;&#x5728;&#x8FD9;&#x4E9B;&#x7AEF;&#x53E3;&#x4E2D;&#xFF0C;&#x5B83;&#x4F1A;&#x5C55;&#x793A;&#x4EFB;&#x4F55;&#x53D1;&#x73B0;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x3002;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# dmitry -p 172.16.36.135 
Deepmagic Information Gathering
Tool &quot;There be some deep magic going on&quot;

ERROR: Unable to locate Host Name for 172.16.36.135 
Continuing with limited modules 
HostIP:172.16.36.135 
HostName:

Gathered TCP Port information for 172.16.36.135 
--------------------------------

 Port    State

21/tcp    open 
22/tcp    open 
23/tcp    open 
25/tcp    open 
53/tcp    open 
80/tcp    open 
111/tcp    open 
139/tcp    open

Portscan Finished: Scanned 150 ports, 141 ports were in state closed
</code></pre><p>Dmitry &#x4E2D;&#x7684; TCP &#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x5E76;&#x4E0D;&#x80FD;&#x81EA;&#x5B9A;&#x4E49;&#x3002;&#x4F46;&#x662F;&#x5B83;&#x662F;&#x4E2A;&#x7B80;&#x5355;&#x9AD8;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x8BBF;&#x95EE;&#x5355;&#x4E2A;&#x4E3B;&#x673A;&#x4E0A;&#x7684;&#x5E38;&#x7528;&#x670D;&#x52A1;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>-o</code>&#x9009;&#x9879;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x540D;&#x79F0;&#xFF0C;&#x5C06; DMitry &#x626B;&#x63CF;&#x7ED3;&#x679C;&#x8F93;&#x51FA;&#x5230;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
<pre><code>root@KaliLinux:~# dmitry -p 172.16.36.135 -o output 
root@KaliLinux:~# ls Desktop  output.txt 
root@KaliLinux:~# cat output.txt 
ERROR: Unable to locate 
Host Name for 172.16.36.135 
Continuing with limited modules 
HostIP:172.16.36.135 
HostName:

Gathered TCP Port information for 172.16.36.135 
--------------------------------

 Port    State 
21/tcp    open 
22/tcp    open 
23/tcp    open 
25/tcp    open
53/tcp    open 
80/tcp    open 
111/tcp    open 
139/tcp    open

Portscan Finished: Scanned 150 ports, 141 ports were in state closed
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x5B9A;&#x4E49;&#x5982;&#x4F55;&#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x7684;&#x5E95;&#x5C42;&#x673A;&#x5236;&#x548C;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x7684;&#x5176;&#x5B83;&#x5DE5;&#x5177;&#x4E00;&#x6837;&#x3002;&#x548C;&#x5176;&#x4ED6;&#x5DE5;&#x5177;&#x76F8;&#x6BD4;&#xFF0C;Dmitry &#x7684;&#x4F7F;&#x7528;&#x6027;&#x4E3B;&#x8981;&#x6E90;&#x4E8E;&#x7B80;&#x6D01;&#xFF0C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x591A;&#x4E2A;&#x914D;&#x7F6E;&#x9879;&#xFF0C;&#x50CF;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Nmap &#x548C; Metasploit &#x90A3;&#x6837;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x54CD;&#x5E94;&#x6A21;&#x5F0F;&#xFF0C;&#x4EE5;&#x53CA;&#x5C06; IP &#x5730;&#x5740;&#x4F20;&#x9012;&#x7ED9;&#x4ED6;&#x6765;&#x542F;&#x52A8; Dmitry&#x3002;&#x5B83;&#x80FD;&#x591F;&#x5FEB;&#x8BFB;&#x626B;&#x63CF;&#x5E38;&#x7528;&#x7684; 150 &#x4E2A;&#x7AEF;&#x53E3;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x4E2D;&#x6240;&#x6709;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x7684;&#x503C;&#x3002;</p>
<h2 id="netcat-tcp-&#x7AEF;&#x53E3;&#x626B;&#x63CF;">Netcat TCP &#x7AEF;&#x53E3;&#x626B;&#x63CF;</h2>
<p>&#x7531;&#x4E8E; Netcat &#x662F;&#x4E2A;&#x7F51;&#x8DEF;&#x54E6;&#x5957;&#x63A5;&#x5B57;&#x8FDE;&#x63A5;&#x548C;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x8F6C;&#x6362;&#x4E3A; TCP &#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x5DE5;&#x5177;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Netcat &#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Netcat &#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x884C; TCP &#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x4F7F;&#x7528; Metasploitable2 &#x5B9E;&#x4F8B;&#x6765;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>Netcat &#x662F;&#x4E2A;&#x975E;&#x5E38;&#x6613;&#x7528;&#xFF0C;&#x529F;&#x80FD;&#x591A;&#x6837;&#x7684;&#x7F51;&#x7EDC;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x591A;&#x79CD;&#x76EE;&#x7684;&#x3002;Netcat &#x7684;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x9AD8;&#x6548;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x6267;&#x884C;&#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x5B9A;&#x4F7F;&#x7528;&#x9009;&#x9879;&#xFF0C;<code>nc</code>&#x5E94;&#x8BE5;&#x4EE5;<code>-h</code>&#x9009;&#x9879;&#x8C03;&#x7528;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nc -h 
[v1.10-40] 
connect to somewhere:  nc [-options] hostname port[s] [ports] ... 
listen for inbound:  nc -l -p port [-options] [hostname] [port] 
options:  
  -c shell commands  as `-e&apos;; use /bin/sh to exec [dangerous!!]
  -e filename    program to exec after connect [dangerous!!]  
  -b      allow broadcasts  
  -g gateway    source-routing hop point[s], up to 8  
  -G num      source-routing pointer: 4, 8, 12, ...  
  -h      this cruft  
  -i secs      delay interval for lines sent, ports scanned  
  -k                      set keepalive option on socket 
  -l      listen mode, for inbound connects  
  -n      numeric-only IP addresses, no DNS 
  -o file      hex dump of traffic  -p port      local port number  
  -r      randomize local and remote ports  
  -q secs      quit after EOF on stdin and delay of secs 
  -s addr      local source address 
  -T tos      set Type Of Service 
  -t      answer TELNET negotiation 
  -u      UDP mode 
  -v      verbose [use twice to be more verbose] 
  -w secs      timeout for connects and final net reads 
  -z      zero-I/O mode [used for scanning] 
port numbers can be individual or ranges: lo-hi [inclusive]; hyphens in port names must be backslash escaped (e.g. &apos;ftp\-data&apos;).
</code></pre><p>&#x6B63;&#x5982;&#x8F93;&#x51FA;&#x6240;&#x8868;&#x793A;&#x7684;&#x90A3;&#x6837;&#xFF0C;<code>-z</code>&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x7528;&#x4E8E;&#x626B;&#x63CF;&#x3002;&#x4E3A;&#x4E86;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684; TCP 80 &#x7AEF;&#x53E3;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>-n</code>&#x9009;&#x9879;&#x6765;&#x8868;&#x660E;&#x6240;&#x4F7F;&#x7528;&#x7684; IP &#x5730;&#x5740;&#xFF0C;<code>-v</code>&#x9009;&#x9879;&#x7528;&#x4E8E;&#x8BE6;&#x7EC6;&#x8F93;&#x51FA;&#xFF0C;<code>-z</code>&#x9009;&#x9879;&#x7528;&#x4E8E;&#x626B;&#x63CF;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nc -nvz 172.16.36.135 80 
(UNKNOWN) [172.16.36.135] 80 (http) open 
root@KaliLinux:~# nc -nvz 172.16.36.135 443 
(UNKNOWN) [172.16.36.135] 443 (https) : Connection refused
</code></pre><p>&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x626B;&#x63CF;&#x5C1D;&#x8BD5;&#x6267;&#x884C;&#x4F1A;&#x8FD4;&#x56DE; IP &#x5730;&#x5740;&#xFF0C;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#xFF0C;&#x4EE5;&#x53CA;&#x7AEF;&#x53E3;&#x72B6;&#x6001;&#x3002;&#x5BF9;&#x6D3B;&#x52A8;&#x4E3B;&#x673A;&#x7684;&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x6267;&#x884C;&#x76F8;&#x540C;&#x626B;&#x63CF;&#x4F1A;&#x663E;&#x5F0F;&#x7B80;&#x4ECB;&#x88AB;&#x62D2;&#x7EDD;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x5BFB;&#x547C;&#x54EA;&#x79CD;&#x81EA;&#x52A8;&#x5316;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# for x in $(seq 20 30); do nc -nvz 172.16.36.135 $x; done 
(UNKNOWN) [172.16.36.135] 20 (ftp-data) : Connection refused 
(UNKNOWN) [172.16.36.135] 21 (ftp) open
(UNKNOWN) [172.16.36.135] 22 (ssh) open 
(UNKNOWN) [172.16.36.135] 23 (telnet) open 
(UNKNOWN) [172.16.36.135] 24 (?) : Connection refused 
(UNKNOWN) [172.16.36.135] 25 (smtp) open 
(UNKNOWN) [172.16.36.135] 26 (?) : Connection refused 
(UNKNOWN) [172.16.36.135] 27 (?) : Connection refused 
(UNKNOWN) [172.16.36.135] 28 (?) : Connection refused 
(UNKNOWN) [172.16.36.135] 29 (?) : Connection refused 
(UNKNOWN) [172.16.36.135] 30 (?) : Connection refused
</code></pre><p>&#x901A;&#x8FC7;&#x5C06;&#x8F93;&#x51FA;&#x4F20;&#x9012;&#x7ED9;<code>STDOUT</code>&#xFF0C;&#x4E4B;&#x540E;&#x8FC7;&#x6EE4;&#x8F93;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5206;&#x79BB;&#x51FA;&#x63D0;&#x4F9B;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x7EC6;&#x8282;&#x7684;&#x884C;&#x3002;&#x6211;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x7B80;&#x660E;&#xFF0C;&#x901A;&#x8FC7;&#x4EC5;&#x4EC5;&#x63D0;&#x53D6;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x5355;&#x4E2A;&#x4E3B;&#x673A;&#x88AB;&#x626B;&#x63CF;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x80FD;&#x591F;&#x5229;&#x7528;&#x7B2C;&#x4E09;&#x548C;&#x7B2C;&#x56DB;&#x4E2A;&#x5B57;&#x6BB5;&#xFF1B;</p>
<pre><code>root@KaliLinux:~# for x in $(seq 20 30); do nc -nvz 172.16.36.135 $x; done 2&gt;&amp;1 | grep open | cut -d &quot; &quot; -f 3-4 
21 (ftp) 
22 (ssh) 
23 (telnet) 
25 (smtp)
</code></pre><p>&#x901A;&#x8FC7;&#x4ECE;&#x8F93;&#x51FA;&#x63D0;&#x53D6;&#x8FD9;&#x4E9B;&#x5B57;&#x6BB5;&#xFF0C;<code>cut</code>&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x4EE5;&#x7A7A;&#x683C;&#x5206;&#x9694;&#x7B26;&#xFF0C;&#x4E4B;&#x540E;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x8981;&#x8F93;&#x51FA;&#x7684;&#x5B57;&#x6BB5;&#x5206;&#x79BB;&#x8FD9;&#x4E9B;&#x884C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x79CD;&#x9AD8;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x5728; Netcat &#x4E2D;&#x6307;&#x5B9A;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5C06;&#x5DE5;&#x5177;&#x4F20;&#x9012;&#x91D1;&#x5FAA;&#x73AF;&#x4E2D;&#x3002;&#x901A;&#x8FC7;&#x5411;<code>nc</code>&#x4E2D;&#x4F20;&#x5165;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x503C;&#x7684;&#x5E8F;&#x5217;&#xFF0C;Netcat &#x4F1A;&#x81EA;&#x52A8;&#x5C55;&#x793A;&#x5176;&#x4E2D;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nc 172.16.36.135 -nvz 20-30 
(UNKNOWN) [172.16.36.135] 25 (smtp) open 
(UNKNOWN) [172.16.36.135] 23 (telnet) open 
(UNKNOWN) [172.16.36.135] 22 (ssh) open 
(UNKNOWN) [172.16.36.135] 21 (ftp) open
</code></pre><p>&#x4F46;&#x662F;&#xFF0C;&#x50CF;&#x4E4B;&#x524D;&#x90A3;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x5B83;&#x7684;&#x8F93;&#x51FA;&#x4F20;&#x7ED9;<code>STDOUT</code>&#xFF0C;&#x4EE5;&#x4FBF;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;<code>cut</code>&#x51FD;&#x6570;&#x3002;&#x901A;&#x8FC7;&#x5C55;&#x793A; 2 &#x5230; 4 &#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9650;&#x5236; IP &#x5730;&#x5740;&#x3001;&#x7AEF;&#x53E3;&#x53F7;&#x4EE5;&#x53CA;&#x76F8;&#x5173;&#x670D;&#x52A1;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nc 172.16.36.135 -nvz 20-30 2&gt;&amp;1 | cut -d &quot; &quot; -f 2-4 
[172.16.36.135] 25 (smtp) 
[172.16.36.135] 23 (telnet) 
[172.16.36.135] 22 (ssh) 
[172.16.36.135] 21 (ftp)
</code></pre><p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728; bash &#x4E2D;&#x4F7F;&#x7528;<code>loop</code>&#x51FD;&#x6570;&#x6765;&#x4F7F;&#x7528; Netcat &#x626B;&#x63CF;&#x591A;&#x4E2A;&#x4E3B;&#x673A;&#x5730;&#x5740;&#x5E8F;&#x5217;&#xFF0C;&#x4E4B;&#x540E;&#x63D0;&#x53D6;&#x76F8;&#x540C;&#x7684;&#x7EC6;&#x8282;&#x6765;&#x786E;&#x5B9A;&#x4E0D;&#x540C;&#x7684;&#x88AB;&#x626B;&#x63CF; IP &#x5730;&#x5740;&#x4E2D;&#xFF0C;&#x54EA;&#x4E2A;&#x7AEF;&#x53E3;&#x662F;&#x5F00;&#x7740;&#x7684;&#x3002;</p>
<pre><code>root@KaliLinux:~# for x in $(seq 0 255); do nc 172.16.36.$x -nvz 80 2&gt;&amp;1 | grep open | cut -d &quot; &quot; -f 2-4; done
[172.16.36.135] 80 (http) 
[172.16.36.180] 80 (http)
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x6267;&#x884C; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x7684;&#x540C;&#x5C45;&#x901A;&#x8FC7;&#x6267;&#x884C;&#x5B8C;&#x6574;&#x7684;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#xFF0C;&#x548C;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684;&#x6240;&#x6709;&#x88AB;&#x626B;&#x63CF;&#x7AEF;&#x53E3;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x3002;&#x7AEF;&#x53E3;&#x7684;&#x72B6;&#x6001;&#x53D6;&#x51B3;&#x4E8E;&#x8FDE;&#x63A5;&#x662F;&#x5426;&#x6210;&#x529F;&#x5EFA;&#x7ACB;&#x3002;&#x5982;&#x679C;&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#xFF0C;&#x7AEF;&#x53E3;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5F00;&#x653E;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x8FDE;&#x63A5;&#x4E0D;&#x80FD;&#x6210;&#x529F;&#x5EFA;&#x7ACB;&#xFF0C;&#x7AEF;&#x53E3;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5173;&#x95ED;&#x7684;&#x3002;</p>
<h2 id="315-scapy-&#x50F5;&#x5C38;&#x626B;&#x63CF;">3.15 Scapy &#x50F5;&#x5C38;&#x626B;&#x63CF;</h2>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#xFF0C;&#x800C;&#x4E0D;&#x7559;&#x4E0B;&#x548C;&#x7CFB;&#x7EDF;&#x4EA4;&#x4E92;&#x7684;&#x8BC1;&#x636E;&#x3002;&#x8FD9;&#x79CD;&#x673A;&#x5668;&#x9690;&#x853D;&#x7684;&#x626B;&#x63CF;&#x5F62;&#x5F0F;&#x5C31;&#x662F;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x80FD;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x5B58;&#x5728;&#x5176;&#x4ED6;&#x62E5;&#x6709;&#x5C11;&#x91CF;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x548C;&#x9012;&#x589E; IPID &#x5E8F;&#x5217;&#x7684;&#x4E3B;&#x673A;&#x65F6;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Scapy &#x6267;&#x884C;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Scapy &#x6267;&#x884C;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C; TCP &#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x53CA;&#x53E6;&#x4E00;&#x4E2A;&#x62E5;&#x6709; IPID &#x9012;&#x589E;&#x5E8F;&#x5217;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;Metasploitable2 &#x7528;&#x4F5C;&#x626B;&#x63CF;&#x76EE;&#x6807;&#xFF0C;WindowsXP &#x7528;&#x4F5C; IPID &#x9012;&#x589E;&#x7684;&#x50F5;&#x5C38;&#x3002;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x5728;&#x672C;&#x5730;&#x5B9E;&#x9A8C;&#x73AF;&#x5883;&#x4E0B;&#x914D;&#x7F6E;&#x7CFB;&#x7EDF;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x548C;&#x201C;&#x5B89;&#x88C5; Windows &#x670D;&#x52A1;&#x5668;&#x201D;&#x79D8;&#x7C4D;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E00;&#x8282;&#x4E5F;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x5C06;&#x811A;&#x672C;&#x5199;&#x5230;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F8B;&#x5982; VIM &#x6216; Nano&#x3002;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x811A;&#x672C;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF08;VIM &#x6216; Nano&#xFF09;&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x6240;&#x6709; IP &#x5C01;&#x5305;&#x4E2D;&#x90FD;&#x5B58;&#x5728;&#x7684;&#x503C;&#x662F; ID &#x53F7;&#x3002;&#x53D6;&#x51B3;&#x4E8E;&#x7CFB;&#x7EDF;&#xFF0C;ID &#x53F7;&#x4F1A;&#x968F;&#x673A;&#x751F;&#x6210;&#xFF0C;&#x53EF;&#x80FD;&#x59CB;&#x7EC8;&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x80FD;&#x5728;&#x6BCF;&#x4E2A;&#x53D1;&#x9001;&#x7684; IP &#x5C01;&#x5305;&#x4E2D;&#x90FD;&#x9012;&#x589E; 1&#x3002;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x4E86; IPID &#x9012;&#x589E;&#x7684;&#x4E3B;&#x673A;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E2A;&#x4E3B;&#x673A;&#x5E76;&#x4E0D;&#x548C;&#x5176;&#x5B83;&#x7F51;&#x8DEF;&#x7CFB;&#x7EDF;&#x4EA4;&#x4E92;&#xFF0C;&#x5B83;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x4F5C;&#x8BC6;&#x522B;&#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x4E0A;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x7684;&#x624B;&#x6BB5;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x4E00;&#x7CFB;&#x5217; IP &#x5C01;&#x5305;&#xFF0C;&#x5E76;&#x5206;&#x6790;&#x54CD;&#x5E94;&#xFF0C;&#x6765;&#x8BC6;&#x522B;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684; IPID &#x5E8F;&#x5217;&#x6A21;&#x5F0F;&#x3002;</p>
<pre><code>&gt;&gt;&gt; reply1 = sr1(IP(dst=&quot;172.16.36.134&quot;)/TCP(flags=&quot;SA&quot;),timeout=2,verbo se=0) 
&gt;&gt;&gt; reply2 = sr1(IP(dst=&quot;172.16.36.134&quot;)/TCP(flags=&quot;SA&quot;),timeout=2,verbo se=0) 
&gt;&gt;&gt; reply1.display()

###[ IP ]###  
    version= 4L  
    ihl= 5L  
    tos= 0x0  
    len= 40  
    id= 61  
    flags=
    frag= 0L 
    ttl= 128 
    proto= tcp 
    chksum= 0x9938 
    src= 172.16.36.134
    dst= 172.16.36.180 
    \options\ 
###[ TCP ]###  
    sport= http   
    dport= ftp_data  
    seq= 0    
    ack= 0 
    dataofs= 5L  
    reserved= 0L  
    flags= R   
    window= 0     
    chksum= 0xe22 
    urgptr= 0  
    options= {}
###[ Padding ]###  
    load= &apos;\x00\x00\x00\x00\x00\x00&apos; 
&gt;&gt;&gt; reply2.display()
###[ IP ]### 
    version= 4L 
    ihl= 5L
    tos= 0x0  
    len= 40 
    id= 62 
    flags= 
    frag= 0L 
    ttl= 128
    proto= tcp 
    chksum= 0x992d 
    src= 172.16.36.134 
    dst= 172.16.36.180
    \options\ 
###[ TCP ]###   
    sport= http    
    dport= ftp_data 
    seq= 0   
    ack= 0    
    dataofs= 5L  
    reserved= 0L 
    flags= R   
    window= 0   
    chksum= 0xe22   
    urgptr= 0  
    options= {}
###[ Padding ]###  
    load= &apos;\x00\x00\x00\x00\x00\x00&apos;
</code></pre><p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5411; Windows &#x72EC;&#x7ACB;&#x7CFB;&#x7EDF;&#x53D1;&#x9001;&#x4E24;&#x4E2A; IP &#x5C01;&#x5305;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x54CD;&#x5E94;&#x4E2D;&#x7684; ID &#x5C5E;&#x6027;&#x7684;&#x6574;&#x6570;&#x503C;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x7B2C;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x7684;&#x56DE;&#x590D;&#x7684; ID &#x662F; 61&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F; 62&#x3002;&#x8FD9;&#x4E2A;&#x4E3B;&#x673A;&#x786E;&#x5B9E;&#x5B58;&#x5728;&#x9012;&#x589E;&#x7684; IPID &#x5E8F;&#x5217;&#xFF0C;&#x5E76;&#x5047;&#x8BBE;&#x5B83;&#x4FDD;&#x6301;&#x72EC;&#x7ACB;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x4F5C;&#x9AD8;&#x6548;&#x7684;&#x50F5;&#x5C38;&#xFF0C;&#x6765;&#x8FDB;&#x884C;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x3002;&#x4E3A;&#x4E86;&#x6267;&#x884C;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#xFF0C;&#x5FC5;&#x987B;&#x5411;&#x50F5;&#x5C38;&#x7CFB;&#x7EDF;&#x53D1;&#x9001;&#x521D;&#x59CB;&#x7684; SYN+ACK &#x8BF7;&#x6C42;&#xFF0C;&#x6765;&#x5224;&#x65AD;&#x8FD4;&#x56DE;&#x7684; RST &#x4E2D;&#x7684;&#x5F53;&#x524D; IPID &#x503C;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x5411;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x53D1;&#x9001;&#x4F2A;&#x9020;&#x7684; SYN &#x626B;&#x63CF;&#xFF0C;&#x5E26;&#x6709;&#x50F5;&#x5C38;&#x7CFB;&#x7EDF;&#x7684; IP &#x539F;&#x5730;&#x5740;&#x3002;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x662F;&#x6253;&#x5F00;&#x7684;&#xFF0C;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x4F1A;&#x53D1;&#x9001; SYN+ACK &#x54CD;&#x5E94;&#x7ED9;&#x50F5;&#x5C38;&#x3002;&#x7531;&#x4E8E;&#x50F5;&#x5C38;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x53D1;&#x9001;&#x521D;&#x59CB;&#x7684; SYN &#x8BF7;&#x6C42;&#xFF0C;&#x5B83;&#x4F1A;&#x5C06; SYN+ACK &#x89E3;&#x91CA;&#x4E3A;&#x6765;&#x8DEF;&#x4E0D;&#x660E;&#xFF0C;&#x5E76;&#x4E14;&#x9879;&#x76EE;&#x8868;&#x53D1;&#x9001; RST &#x5C01;&#x5305;&#x3002;&#x56E0;&#x6B64;&#x5C06; IPID &#x589E;&#x52A0; 1&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5E94;&#x8BE5;&#x5411;&#x50F5;&#x5C38;&#x53D1;&#x9001;&#x53E6;&#x4E00;&#x4E2A; SYN+ACK &#x5C01;&#x5305;&#xFF0C;&#x5B83;&#x4F1A;&#x8FD4;&#x56DE; RST &#x5C01;&#x5305;&#x5E76;&#x5C06; IPID &#x518D;&#x6B21;&#x589E;&#x52A0; 1&#x3002;IPID &#x6BD4;&#x8D77;&#x521D;&#x59CB;&#x54CD;&#x5E94;&#x589E;&#x52A0;&#x4E86; 2&#xFF0C;&#x6298;&#x8868;&#x793A;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x65F6;&#x95F4;&#x90FD;&#x53D1;&#x751F;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x88AB;&#x626B;&#x63CF;&#x7CFB;&#x7EDF;&#x7684;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x662F;&#x5F00;&#x653E;&#x7684;&#x3002;</p>
<p>&#x53CD;&#x4E4B;&#xFF0C;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x662F;&#x5173;&#x95ED;&#x7684;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4E0D;&#x540C;&#x7684;&#x7CFB;&#x5217;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4EC5;&#x4EC5;&#x4F1A;&#x5BFC;&#x81F4;&#x6700;&#x540E;&#x7684; RST &#x54CD;&#x5E94;&#x65E9;&#x5462;&#x66F4;&#x52A0; 1&#x3002;&#x5982;&#x679C;&#x88AB;&#x626B;&#x63CF;&#x7CFB;&#x7EDF;&#x7684;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x662F;&#x5173;&#x95ED;&#x7684;&#xFF0C;RST &#x5C01;&#x5305;&#x4F1A;&#x53D1;&#x7ED9;&#x50F5;&#x5C38;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F5C;&#x4E3A;&#x521D;&#x59CB;&#x7684;&#x4F2A;&#x9020;&#x7684; SYN &#x5C01;&#x5305;&#x7684;&#x54CD;&#x5E94;&#x3002;&#x7531;&#x4E8E; RST &#x5C01;&#x5305;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x56DE;&#x5E94;&#xFF0C;&#x50F5;&#x5C38;&#x7CFB;&#x7EDF;&#x7684; IPID &#x503C;&#x65E0;&#x53D8;&#x5316;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4F5C;&#x4E3A; SYN+ACK &#x5C01;&#x5305;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x8FD4;&#x56DE;&#x7ED9;&#x626B;&#x63CF;&#x7CFB;&#x7EDF;&#x7684;&#x6700;&#x540E;&#x7684; RST &#x5C01;&#x5305;&#x7684; IPID &#x503C;&#x53EA;&#x4F1A;&#x589E;&#x52A0; 1&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x811A;&#x672C;&#x4EE5; Python &#x7F16;&#x5199;&#xFF0C;&#x5B83;&#x80FD;&#x8BC6;&#x522B;&#x53EF;&#x7528;&#x50F5;&#x5C38;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x5BF9;&#x626B;&#x63CF;&#x76EE;&#x6807;&#x6267;&#x884C;&#x4E86;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x3002;</p>
<pre><code class="lang-py"><span class="hljs-comment">#!/usr/bin/python </span>
<span class="hljs-keyword">import</span> logging 
logging.getLogger(<span class="hljs-string">&quot;scapy.runtime&quot;</span>).setLevel(logging.ERROR) 
<span class="hljs-keyword">from</span> scapy.all <span class="hljs-keyword">import</span> *

<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">ipid</span><span class="hljs-params">(zombie)</span>:</span>   
    reply1 = sr1(IP(dst=zombie)/TCP(flags=<span class="hljs-string">&quot;SA&quot;</span>),timeout=<span class="hljs-number">2</span>,verbose=<span class="hljs-number">0</span>)   
    send(IP(dst=zombie)/TCP(flags=<span class="hljs-string">&quot;SA&quot;</span>),verbose=<span class="hljs-number">0</span>)   
    reply2 = sr1(IP(dst=zombie)/TCP(flags=<span class="hljs-string">&quot;SA&quot;</span>),timeout=<span class="hljs-number">2</span>,verbose=<span class="hljs-number">0</span>)   
    <span class="hljs-keyword">if</span> reply2[IP].id == (reply1[IP].id + <span class="hljs-number">2</span>):      
        <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;IPID sequence is incremental and target appears to be        idle.  ZOMBIE LOCATED&quot;</span>      
        response = raw_input(<span class="hljs-string">&quot;Do you want to use this zombie to perform        a scan? (Y or N): &quot;</span>)      
        <span class="hljs-keyword">if</span> response == <span class="hljs-string">&quot;Y&quot;</span>:         
            target = raw_input(<span class="hljs-string">&quot;Enter the IP address of the target           system: &quot;</span>)         
            zombiescan(target,zombie)   
    <span class="hljs-keyword">else</span>:      
        <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Either the IPID sequence is not incremental or the target        is not idle.  NOT A GOOD ZOMBIE&quot;</span>

<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">zombiescan</span><span class="hljs-params">(target,zombie)</span>:</span>   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;\nScanning target &quot;</span> + target + <span class="hljs-string">&quot; with zombie &quot;</span> + zombie   <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;\n---------Open Ports on Target--------\n&quot;</span>   
    <span class="hljs-keyword">for</span> port <span class="hljs-keyword">in</span> range(<span class="hljs-number">1</span>,<span class="hljs-number">100</span>):      
        <span class="hljs-keyword">try</span>:         
            start_val = sr1(IP(dst=zombie)/TCP(flags=<span class="hljs-string">&quot;SA&quot;</span>,dport=port),tim          eout=<span class="hljs-number">2</span>,verbose=<span class="hljs-number">0</span>)         
            send(IP(src=zombie,dst=target)/TCP(flags=<span class="hljs-string">&quot;S&quot;</span>,dport=port),verbose=<span class="hljs-number">0</span>)         
            end_val = sr1(IP(dst=zombie)/TCP(flags=<span class="hljs-string">&quot;SA&quot;</span>),timeout=<span class="hljs-number">2</span>,verbo          se=<span class="hljs-number">0</span>)         
            <span class="hljs-keyword">if</span> end_val[IP].id == (start_val[IP].id + <span class="hljs-number">2</span>):           
                <span class="hljs-keyword">print</span> port     
        <span class="hljs-keyword">except</span>:      
            <span class="hljs-keyword">pass</span>

<span class="hljs-keyword">print</span> <span class="hljs-string">&quot;-----------Zombie Scan Suite------------\n&quot;</span> 
<span class="hljs-keyword">print</span> <span class="hljs-string">&quot;1 - Identify Zombie Host\n&quot;</span> 
<span class="hljs-keyword">print</span> <span class="hljs-string">&quot;2 - Perform Zombie Scan\n&quot;</span> ans = raw_input(<span class="hljs-string">&quot;Select an Option (1 or 2): &quot;</span>) 
<span class="hljs-keyword">if</span> ans == <span class="hljs-string">&quot;1&quot;</span>:   
    zombie = raw_input(<span class="hljs-string">&quot;Enter IP address to test IPID sequence: &quot;</span>)   
    ipid(zombie) 
<span class="hljs-keyword">else</span>:   
    <span class="hljs-keyword">if</span> ans == <span class="hljs-string">&quot;2&quot;</span>:  
        zombie = raw_input(<span class="hljs-string">&quot;Enter IP address for zombie system: &quot;</span>)      
        target = raw_input(<span class="hljs-string">&quot;Enter IP address for scan target: &quot;</span>)      
        zombiescan(target,zombie)
</code></pre>
<p>&#x5728;&#x6267;&#x884C;&#x811A;&#x672C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7528;&#x6237;&#x4F1A;&#x6536;&#x5230;&#x91CF;&#x4E2A;&#x9009;&#x9879;&#x7684;&#x63D0;&#x793A;&#x3002;&#x901A;&#x8FC7;&#x9009;&#x9879;&#x9009;&#x9879; 1&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x626B;&#x63CF;&#x6216;&#x8BC4;&#x4F30;&#x76EE;&#x6807;&#x7684; IPID &#x5E8F;&#x5217;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x4E3B;&#x673A;&#x662F;&#x4E2A;&#x53EF;&#x7528;&#x7684;&#x50F5;&#x5C38;&#x3002;&#x5047;&#x8BBE;&#x4E3B;&#x673A;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x5E76;&#x62E5;&#x6709;&#x9012;&#x589E;&#x7684; IPID &#x5E8F;&#x5217;&#xFF0C;&#x4E3B;&#x673A;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x4F5C;&#x50F5;&#x5C38;&#x3002;&#x5E76;&#x4E14;&#x7528;&#x6237;&#x4F1A;&#x88AB;&#x8BE2;&#x95EE;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x50F5;&#x5C38;&#x6765;&#x6267;&#x884C;&#x626B;&#x63CF;&#x3002;&#x5982;&#x679C;&#x6267;&#x884C;&#x4E86;&#x626B;&#x63CF;&#xFF0C;&#x4F1A;&#x5BF9; TCP &#x7AEF;&#x53E3;&#x524D; 100 &#x4E2A;&#x5730;&#x5740;&#x7684;&#x6BCF;&#x4E2A;&#x5730;&#x5740;&#x6267;&#x884C;&#x524D;&#x9762;&#x8BA8;&#x8BBA;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# ./zombie.py 
-----------Zombie Scan Suite-----------

1 - Identify Zombie Host
2 - Perform Zombie Scan

Select an Option (1 or 2): 1 
Enter IP address to test IPID sequence: 172.16.36.134 
IPID sequence is incremental and target appears to be idle.  ZOMBIE LOCATED 
Do you want to use this zombie to perform a scan? (Y or N): Y 
Enter the IP address of the target system: 172.16.36.135

Scanning target 172.16.36.135 with zombie 172.16.36.134

---------Open Ports on Target-------

21 
22 
23 
25 
53 
80
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x662F;&#x4E2A;&#x679A;&#x4E3E;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x7684;&#x9690;&#x79D8;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x7559;&#x4E0B;&#x4EFB;&#x4F55;&#x4EA4;&#x4E92;&#x7684;&#x75D5;&#x8FF9;&#x3002;&#x5C06;&#x4F2A;&#x9020;&#x8BF7;&#x6C42;&#x7684;&#x7EC4;&#x5408;&#x53D1;&#x7ED9;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x53CA;&#x5C06;&#x6B63;&#x5E38;&#x8BF7;&#x6C42;&#x53D1;&#x7ED9;&#x50F5;&#x5C38;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BC4;&#x4F30;&#x50F5;&#x5C38;&#x7CFB;&#x7EDF;&#x7684;&#x54CD;&#x5E94;&#x7684; IPID &#x503C;&#x6765;&#x6620;&#x5C04;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x3002;</p>
<h2 id="318-nmap-&#x50F5;&#x5C38;&#x626B;&#x63CF;">3.18 Nmap &#x50F5;&#x5C38;&#x626B;&#x63CF;</h2>
<p>&#x5C31;&#x50CF;&#x4E0A;&#x4E00;&#x4E2A;&#x79D8;&#x7C4D;,&#x5728;&#x7F16;&#x7A0B;&#x81EA;&#x5B9A;&#x4E49;&#x811A;&#x672C;&#x5BF9;&#x4E8E;&#x7406;&#x89E3;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x80CC;&#x540E;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x3002;Nmap &#x4E2D;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x79CD;&#x9AD8;&#x6548;&#x7684;&#x626B;&#x63CF;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6267;&#x884C;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C; TCP &#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x53CA;&#x53E6;&#x4E00;&#x4E2A;&#x62E5;&#x6709; IPID &#x9012;&#x589E;&#x5E8F;&#x5217;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;Metasploitable2 &#x7528;&#x4F5C;&#x626B;&#x63CF;&#x76EE;&#x6807;&#xFF0C;WindowsXP &#x7528;&#x4F5C; IPID &#x9012;&#x589E;&#x7684;&#x50F5;&#x5C38;&#x3002;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x5728;&#x672C;&#x5730;&#x5B9E;&#x9A8C;&#x73AF;&#x5883;&#x4E0B;&#x914D;&#x7F6E;&#x7CFB;&#x7EDF;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x548C;&#x201C;&#x5B89;&#x88C5; Windows &#x670D;&#x52A1;&#x5668;&#x201D;&#x79D8;&#x7C4D;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E00;&#x8282;&#x4E5F;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x5C06;&#x811A;&#x672C;&#x5199;&#x5230;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F8B;&#x5982; VIM &#x6216; Nano&#x3002;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x811A;&#x672C;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF08;VIM &#x6216; Nano&#xFF09;&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x53EF;&#x4EE5;&#x5728; Nmap &#x4E2D;&#x5E26;&#x53C2;&#x6570;&#x6267;&#x884C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Metasploit &#x5FEB;&#x901F;&#x53D1;&#x73B0;&#x4EFB;&#x4F55;&#x53EF;&#x7528;&#x7684;&#x50F5;&#x5C38;&#x5019;&#x9009;&#x9879;&#xFF0C;&#x901A;&#x8FC7;&#x626B;&#x63CF;&#x6574;&#x4E2A;&#x5730;&#x5740;&#x8303;&#x56F4;&#x548C;&#x8BC4;&#x4F30; PIPD &#x5E8F;&#x5217;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F7F;&#x7528; Nmap &#x50F5;&#x5C38;&#x626B;&#x63CF;&#x3002;&#x4E3A;&#x4E86;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F7F;&#x7528;<code>msfconsole</code>&#x547D;&#x4EE4;&#x6253;&#x5F00; Metasploit&#xFF0C;&#x5E76;&#x9009;&#x9879; IPID &#x5E8F;&#x5217;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# msfconsole  
+-------------------------------------------------------+  
|  METASPLOIT by Rapid7                                 |  
+---------------------------+---------------------------+
|      __________________   |                           |  
|  ==c(______(o(______(_()  | |&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;|======[***  |  
|             )=\           | |  EXPLOIT   \            |  
|            // \\          | |_____________\_______    |  
|           //   \\         | |==[msf &gt;]============\   |  
|          //     \\        | |______________________\  |  
|         // RECON \\       | \(@)(@)(@)(@)(@)(@)(@)/   |  
|        //         \\      |  *********************    |  
+---------------------------+---------------------------+  
|      o O o                |        \&apos;\/\/\/&apos;/         |  
|              o O          |         )======(          |  
|                 o         |       .&apos;  LOOT  &apos;.        |  
| |^^^^^^^^^^^^^^|l___      |      /    _||__   \       |  
| |    PAYLOAD     |&quot;&quot;\___, |     /    (_||_     \      |  
| |________________|__|)__| |    |     __||_)     |     |  
| |(@)(@)&quot;&quot;&quot;**|(@)(@)**|(@) |    &quot;       ||       &quot;     |  
|  = = = = = = = = = = = =  |     &apos;--------------&apos;      |  
+---------------------------+---------------------------+

Using notepad to track pentests? Have Metasploit Pro report on hosts, services, sessions and evidence -- type &apos;go_pro&apos; to launch it now.

       =[ metasploit v4.6.0-dev [core:4.6 api:1.0] 
+ -- --=[ 1053 exploits - 590 auxiliary - 174 post 
+ -- --=[ 275 payloads - 28 encoders - 8 nops

msf &gt; use auxiliary/scanner/ip/ipidseq 
msf  auxiliary(ipidseq) &gt; show options

Module options (auxiliary/scanner/ip/ipidseq):

   Name       Current Setting  Required  Description   
   ----       ---------------  --------  ----------   
   INTERFACE                   no        The name of the interface   
   RHOSTS                      yes       The target address range or CIDR identifier   
   RPORT      80               yes       The target port
   SNAPLEN    65535            yes       The number of bytes to capture   
   THREADS    1                yes       The number of concurrent threads   
   TIMEOUT    500              yes       The reply read timeout in milliseconds
</code></pre><p>&#x8FD9;&#x4E2A;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5728;&#x4E3B;&#x673A;&#x5730;&#x5740;&#x5E8F;&#x5217;&#x6216;&#x7F51;&#x7EDC;&#x8303;&#x56F4;&#x4E2D;&#x6267;&#x884C;&#x626B;&#x63CF;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; CIDR &#x8BB0;&#x6CD5;&#x6765;&#x5B9A;&#x4E49;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x626B;&#x63CF;&#x901F;&#x5EA6;&#x589E;&#x52A0;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;<code>THREADS</code>&#x53D8;&#x91CF;&#x8BBE;&#x4E3A;&#x5408;&#x7406;&#x7684;&#x5E76;&#x53D1;&#x4EFB;&#x52A1;&#x6570;&#x91CF;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>msf  auxiliary(ipidseq) &gt; set RHOSTS 172.16.36.0/24 
RHOSTS =&gt; 172.16.36.0/24 
msf  auxiliary(ipidseq) &gt; set THREADS 25 
THREADS =&gt; 25 
msf  auxiliary(ipidseq) &gt; show options

Module options (auxiliary/scanner/ip/ipidseq):

   Name       Current Setting  Required  Description   
   ----       ---------------  --------  ----------   INTERFACE                   no        The name of the interface   
   RHOSTS     172.16.36.0/24   yes       The target address range or CIDR identifier   
   RPORT      80               yes       The target port   
   SNAPLEN    65535            yes       The number of bytes to capture   
   THREADS    25               yes       The number of concurrent threads   
   TIMEOUT    500              yes       The reply read timeout in milliseconds
</code></pre><p>&#x4E00;&#x65E6;&#x4E3A;&#x6240;&#x9700;&#x53D8;&#x91CF;&#x8BBE;&#x7F6E;&#x4E86;&#x5408;&#x7406;&#x7684;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>show options</code>&#x6765;&#x518D;&#x6B21;&#x9A8C;&#x8BC1;&#x626B;&#x63CF;&#x914D;&#x7F6E;&#x3002;IPID &#x5E8F;&#x5217;&#x626B;&#x63CF;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>run</code>&#x547D;&#x4EE4;&#x6765;&#x6267;&#x884C;&#x3002;</p>
<pre><code>msf  auxiliary(ipidseq) &gt; run

[*] 172.16.36.1&apos;s IPID sequence class: Randomized 
[*] 172.16.36.2&apos;s IPID sequence class: Incremental! 
[*] Scanned 026 of 256 hosts (010% complete) 
[*] Scanned 052 of 256 hosts (020% complete) 
[*] Scanned 077 of 256 hosts (030% complete)
[*] Scanned 103 of 256 hosts (040% complete) 
[*] Scanned 128 of 256 hosts (050% complete) 
[*] 172.16.36.134&apos;s IPID sequence class: Incremental! 
[*] 172.16.36.135&apos;s IPID sequence class: All zeros 
[*] Scanned 154 of 256 hosts (060% complete) 
[*] Scanned 180 of 256 hosts (070% complete) 
[*] Scanned 205 of 256 hosts (080% complete) 
[*] Scanned 231 of 256 hosts (090% complete) 
[*] Scanned 256 of 256 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><p>&#x7531;&#x4E8E; IPID &#x5E8F;&#x5217;&#x626B;&#x63CF;&#x6A21;&#x5757;&#x4F1A;&#x904D;&#x5386;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x7F51;&#x7EDC;&#x8303;&#x56F4;&#xFF0C;&#x5B83;&#x4F1A;&#x8BC6;&#x522B;&#x88AB;&#x53D1;&#x73B0;&#x4E3B;&#x673A;&#x7684; IPID &#x5E8F;&#x5217;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x8868;&#x793A;&#x51FA;&#x54EA;&#x4E9B;&#x662F; 0&#xFF0C;&#x968F;&#x673A;&#x6216;&#x9012;&#x589E;&#x7684;&#x3002;&#x7528;&#x4E8E;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x7684;&#x7406;&#x60F3;&#x5019;&#x9009;&#x9879;&#x5FC5;&#x987B;&#x62E5;&#x6709;&#x9012;&#x589E;&#x7684; IPID&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x88AB;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x5176;&#x5B83;&#x4E3B;&#x673A;&#x4E25;&#x91CD;&#x5F71;&#x54CD;&#x3002;&#x4E00;&#x65E6;&#x8BC6;&#x522B;&#x4E86;&#x9012;&#x589E;&#x7684;&#x72EC;&#x7ACB;&#x4E3B;&#x673A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728; Nmap &#x4E2D;&#x4F7F;&#x7528;<code>-sI</code>&#x9009;&#x9879;&#x5E76;&#x4E14;&#x4F20;&#x5165;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x7684; IP &#x5730;&#x5740;&#x6765;&#x6267;&#x884C;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap 172.16.36.135 -sI 172.16.36.134 -Pn -p 0-100

Starting Nmap 6.25 ( http://nmap.org ) at 2014-01-26 14:05 CST I
dle scan using zombie 172.16.36.134 (172.16.36.134:80); Class: Incremental 
Nmap scan report for 172.16.36.135 
Host is up (0.045s latency). 
Not shown: 95 closed|filtered ports 
PORT   STATE SERVICE 
21/tcp open  ftp 
22/tcp open  ssh 
23/tcp open  telnet 
25/tcp open  smtp 
53/tcp open  domain 
80/tcp open  
http MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 2.75 seconds
</code></pre><p>&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x6267;&#x884C;&#x5728;&#x626B;&#x63CF;&#x76EE;&#x6807;<code>172.16.36.135</code>&#x7684;&#x524D; 100 &#x4E2A; TCP &#x7AEF;&#x53E3;&#x4E0A;&#x3002;&#x72EC;&#x7ACB;&#x4E3B;&#x673A;<code>172.16.36.134</code>&#x7528;&#x4F5C;&#x50F5;&#x5C38;&#xFF0C;<code>-Pn</code>&#x9009;&#x9879;&#x7528;&#x4E8E;&#x963B;&#x6B62; Nmap &#x5C1D;&#x8BD5; ping &#x626B;&#x63CF;&#x76EE;&#x6807;&#x3002;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BC6;&#x522B;&#x5E76;&#x679A;&#x4E3E;&#x4E86;&#x6240;&#x6709;&#x5217;&#x51FA;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x76F4;&#x63A5;&#x548C;&#x88AB;&#x626B;&#x63CF;&#x4E3B;&#x673A;&#x4EA4;&#x4E92;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x4F2A;&#x9020;&#x4E86;&#x6765;&#x6E90;&#x7684;&#x5C01;&#x5305;&#x4F1A;&#x53D1;&#x7ED9;&#x626B;&#x63CF;&#x76EE;&#x6807;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x6709;&#x626B;&#x63CF;&#x7CFB;&#x7EDF;&#x548C;&#x50F5;&#x5C38;&#x4E3B;&#x673A;&#x4E4B;&#x95F4;&#x624D;&#x6709;&#x76F4;&#x63A5;&#x7684;&#x4EA4;&#x4E92;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x50F5;&#x5C38;&#x626B;&#x63CF;&#x7684;&#x5E95;&#x5C42;&#x673A;&#x5236;&#x548C;&#x4E0A;&#x4E00;&#x4E2A;&#x79D8;&#x7C4D;&#x4E2D;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684; Scapy &#x7684;&#x4F8B;&#x5B50;&#x76F8;&#x540C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F7F;&#x7528; Nmap &#x50F5;&#x5C38;&#x626B;&#x63CF;&#x6A21;&#x5F0F;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x77E5;&#x540D;&#x7684;&#x96C6;&#x6210;&#x5DE5;&#x5177;&#x6765;&#x5FEB;&#x901F;&#x6267;&#x884C;&#x6B64;&#x7C7B;&#x5DE5;&#x5177;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch2.html" class="navigation navigation-prev " aria-label="Previous page: 第二章 探索扫描">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch4.html" class="navigation navigation-next " aria-label="Next page: 第四章 指纹识别">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第三章 端口扫描","level":"1.4","depth":1,"next":{"title":"第四章 指纹识别","level":"1.5","depth":1,"path":"ch4.md","ref":"ch4.md","articles":[]},"previous":{"title":"第二章 探索扫描","level":"1.3","depth":1,"path":"ch2.md","ref":"ch2.md","articles":[]},"dir":"ltr"},"config":{"plugins":["comment"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"comment":{"highlightCommented":true},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"wizardforcel","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Kali Linux 网络扫描秘籍","language":"zh","links":{"sidebar":{"Kali Linux 网络扫描秘籍":"https://www.gitbook.com/book/wizardforcel/kali-linux-network-scanning-cookbook"},"gitbook":true},"gitbook":"*","description":"Kali Linux Network Scanning Cookbook 中文版"},"file":{"path":"ch3.md","mtime":"2016-11-25T09:44:31.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2016-11-26T04:32:05.478Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-comment/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

