
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第四章 指纹识别 · Kali Linux 网络扫描秘籍</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="wizardforcel">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-comment/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch5.html" />
    
    
    <link rel="prev" href="ch3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/wizardforcel/kali-linux-network-scanning-cookbook" target="_blank" class="custom-link">Kali Linux 网络扫描秘籍</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Kali Linux 网络扫描秘籍 中文版
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章 起步
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章 探索扫描
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章 端口扫描
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章 指纹识别
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章 漏洞扫描
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章 拒绝服务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章 Web 应用扫描
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章 自动化 Kali 工具
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第四章 指纹识别</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x56DB;&#x7AE0;-&#x6307;&#x7EB9;&#x8BC6;&#x522B;">&#x7B2C;&#x56DB;&#x7AE0; &#x6307;&#x7EB9;&#x8BC6;&#x522B;</h1>
<blockquote>
<p>&#x4F5C;&#x8005;&#xFF1A;Justin Hutchens</p>
<p>&#x8BD1;&#x8005;&#xFF1A;<a href="https://github.com/" target="_blank">&#x98DE;&#x9F99;</a></p>
<p>&#x534F;&#x8BAE;&#xFF1A;<a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">CC BY-NC-SA 4.0</a></p>
</blockquote>
<p>&#x8BC6;&#x522B;&#x76EE;&#x6807;&#x8303;&#x56F4;&#x4E0A;&#x7684;&#x6D3B;&#x52A8;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x679A;&#x4E3E;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x4E4B;&#x540E;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5F00;&#x59CB;&#x6536;&#x96C6;&#x5173;&#x4E8E;&#x5B83;&#x4EEC;&#x548C;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x7684;&#x670D;&#x52A1;&#x7684;&#x4FE1;&#x606F;&#x3002; &#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x8BA8;&#x8BBA;&#x7528;&#x4E8E; Kali Linux &#x7684;&#x6307;&#x7EB9;&#x548C;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#x7684;&#x4E0D;&#x540C;&#x6280;&#x672F;&#x3002; &#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x5C06;&#x5305;&#x62EC;&#x7279;&#x5F81;&#x6293;&#x53D6;&#xFF0C;&#x670D;&#x52A1;&#x63A2;&#x6D4B;&#x8BC6;&#x522B;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#xFF0C;SNMP &#x4FE1;&#x606F;&#x6536;&#x96C6;&#x548C;&#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;&#x3002;</p>
<h2 id="41-netcat-&#x7279;&#x5F81;&#x6293;&#x53D6;">4.1 Netcat &#x7279;&#x5F81;&#x6293;&#x53D6;</h2>
<p>Netcat &#x662F;&#x4E2A;&#x591A;&#x7528;&#x9014;&#x7684;&#x7F51;&#x7EDC;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5728; Kali &#x4E2D;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x4FE1;&#x606F;&#x6536;&#x96C6;&#x548C;&#x626B;&#x63CF;&#x4EFB;&#x52A1;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Netcat &#x83B7;&#x53D6;&#x670D;&#x52A1;&#x7279;&#x5F81;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BC6;&#x522B;&#x548C;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x5728;&#x8BB2;&#x89E3;&#x4E0A;&#x8FF0;&#x7279;&#x5B9A;&#x79D8;&#x7C4D;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x9996;&#x5148;&#x4E86;&#x89E3;&#x4E00;&#x4E9B;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x5269;&#x4F59;&#x90E8;&#x5206;&#x8BA8;&#x8BBA;&#x7684;&#x57FA;&#x672C;&#x539F;&#x5219;&#x3002; &#x672C;&#x7AE0;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x79D8;&#x7C4D;&#x90FD;&#x5C06;&#x4ECB;&#x7ECD;&#x53EF;&#x7528;&#x4E8E;&#x6267;&#x884C;&#x51E0;&#x4E2A;&#x7279;&#x5B9A;&#x4EFB;&#x52A1;&#x7684;&#x5DE5;&#x5177;&#x3002; &#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x5305;&#x62EC;&#x7279;&#x5F81;&#x6293;&#x53D6;&#xFF0C;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#xFF0C;SNMP &#x5206;&#x6790;&#x548C;&#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;&#x3002; &#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x7528;&#x4E8E;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x6536;&#x96C6;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6765;&#x5FEB;&#x901F;&#x6709;&#x6548;&#x5730;&#x653B;&#x51FB;&#x8BE5;&#x7CFB;&#x7EDF;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Netcat &#x6536;&#x96C6;&#x670D;&#x52A1;&#x7279;&#x5F81;&#xFF0C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x8BBE;&#x5907;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C;&#x5F00;&#x653E;&#x4FE1;&#x606F;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528;&#x4E86; Metasploitable2 &#x6765;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<p>&#x5728;&#x5C1D;&#x8BD5;&#x8BC6;&#x522B;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#xFF0C;&#x4EE5;&#x53CA;&#x6295;&#x5165;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x548C;&#x8D44;&#x6E90;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x9996;&#x5148;&#x786E;&#x5B9A;&#x8BE5;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x662F;&#x5426;&#x4F1A;&#x5411;&#x6211;&#x4EEC;&#x66B4;&#x9732;&#x81EA;&#x5DF1;&#x3002;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x5305;&#x62EC;&#x4E0E;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x65F6;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x672C;&#x3002;&#x8FC7;&#x53BB;&#x7528;&#x4E8E;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x662F;&#xFF0C;&#x53D1;&#x73B0;&#x5236;&#x9020;&#x5546;&#xFF0C;&#x8F6F;&#x4EF6;&#x540D;&#x79F0;&#xFF0C;&#x670D;&#x52A1;&#x7C7B;&#x578B;&#xFF0C;&#x751A;&#x81F3;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x4E2D;&#x7684;&#x7248;&#x672C;&#x53F7;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x6E17;&#x900F;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5BF9;&#x4E8E;&#x8BC6;&#x522B;&#x8F6F;&#x4EF6;&#x4E2D;&#x5DF2;&#x77E5;&#x7684;&#x5F31;&#x70B9;&#xFF0C;&#x7F3A;&#x9677;&#x548C;&#x6F0F;&#x6D1E;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x901A;&#x8FC7;&#x4EC5;&#x8FDE;&#x63A5;&#x5230;&#x8FDC;&#x7A0B;&#x7EC8;&#x7AEF;&#x670D;&#x52A1;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x8BFB;&#x53D6;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x4FE1;&#x606F;&#x6536;&#x96C6;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x662F;&#x81EA;&#x52A8;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x4E0D;&#x5FC5;&#x624B;&#x52A8;&#x8FDE;&#x63A5;&#x5230;&#x8FDC;&#x7A0B;&#x4E3B;&#x673A;&#x4E0A;&#x7684;&#x6BCF;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x670D;&#x52A1;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x7684;&#x7279;&#x5F81;&#x6293;&#x53D6;&#x79D8;&#x7C4D;&#x4E2D;&#x8BB2;&#x89E3;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5C06;&#x5B8C;&#x6210;&#x81EA;&#x52A8;&#x5316;&#x6293;&#x53D6;&#x7279;&#x5F81;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6765;&#x8BC6;&#x522B;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x5F00;&#x653E;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x4E0D;&#x613F;&#x610F;&#x66B4;&#x9732;&#x8FD0;&#x884C;&#x5B83;&#x7684;&#x8F6F;&#x4EF6;&#x548C;&#x7248;&#x672C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7CBE;&#x529B;&#x6765;&#x8BC6;&#x522B;&#x670D;&#x52A1;&#x3002; &#x901A;&#x5E38;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x72EC;&#x7279;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x6216;&#x8BF7;&#x6C42;&#x7528;&#x4E8E;&#x7CBE;&#x786E;&#x8BC6;&#x522B;&#x670D;&#x52A1;&#x7684;&#x552F;&#x4E00;&#x54CD;&#x5E94;&#x3002; &#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x54CD;&#x5E94;&#x6216;&#x884C;&#x4E3A;&#x7684;&#x5FAE;&#x5999;&#x53D8;&#x5316;&#x800C;&#x8BC6;&#x522B;&#x7279;&#x5B9A;&#x670D;&#x52A1;&#x7684;&#x7279;&#x5B9A;&#x7248;&#x672C;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x72EC;&#x7279;&#x7684;&#x7B7E;&#x540D;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5BF9;&#x4EFB;&#x4F55;&#x4EBA;&#x6765;&#x8BF4;&#x90FD;&#x5F88;&#x56F0;&#x96BE;&#x3002; &#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x8BB8;&#x591A;&#x5DE5;&#x5177;&#x5DF2;&#x7ECF;&#x521B;&#x5EFA;&#xFF0C;&#x6765;&#x5411;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x53D1;&#x9001;&#x5927;&#x91CF;&#x63A2;&#x6D4B;&#xFF0C;&#x6765;&#x5206;&#x6790;&#x8FD9;&#x4E9B;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x7684;&#x54CD;&#x5E94;&#x548C;&#x884C;&#x4E3A;&#x3002; &#x4E0E;&#x4E4B;&#x76F8;&#x4F3C;&#xFF0C;&#x54CD;&#x5E94;&#x53D8;&#x5316;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8BC6;&#x522B;&#x5728;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x6216;&#x5DE5;&#x4F5C;&#x7AD9;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x5E95;&#x5C42;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002; &#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x5C06;&#x5728;&#x8BB2;&#x89E3;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#x7684;&#x79D8;&#x7C4D;&#x4E2D;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x7B80;&#x5355;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x534F;&#x8BAE;&#xFF08;SNMP&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x4E3A;&#x5404;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x63D0;&#x4F9B;&#x8FDC;&#x7A0B;&#x7BA1;&#x7406;&#x670D;&#x52A1;&#x7684;&#x534F;&#x8BAE;&#x3002; SNMP &#x7684;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#x5C06;&#x56E2;&#x4F53;&#x5B57;&#x7B26;&#x4E32;&#x7528;&#x4E8E;&#x9A8C;&#x8BC1;&#x6765;&#x6267;&#x884C;&#x3002; &#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x56E2;&#x961F;&#x5B57;&#x7B26;&#x4E32;&#x90E8;&#x7F72;&#x8BBE;&#x5907;&#x662F;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#x7684;&#x3002; &#x5F53;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x901A;&#x5E38;&#x53EF;&#x80FD;&#x8FDC;&#x7A0B;&#x6536;&#x96C6;&#x76EE;&#x6807;&#x8BBE;&#x5907;&#x914D;&#x7F6E;&#x7684;&#x5927;&#x91CF;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x4E14;&#x751A;&#x81F3;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x8BBE;&#x5907;&#x3002; &#x5229;&#x7528; SNMP &#x7528;&#x4E8E;&#x4FE1;&#x606F;&#x6536;&#x96C6;&#x7684;&#x6280;&#x672F;&#x4F1A;&#x5728;&#x8BB2;&#x89E3; SNMP &#x5206;&#x6790;&#x7684;&#x79D8;&#x7C4D;&#x4E2D;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x5728;&#x6536;&#x96C6;&#x5173;&#x4E8E;&#x6F5C;&#x5728;&#x76EE;&#x6807;&#x7684;&#x4FE1;&#x606F;&#x65F6;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8FD8;&#x8981;&#x4E86;&#x89E3;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#x6210;&#x529F;&#x4FA6;&#x67E5;&#x6216;&#x653B;&#x51FB;&#x7684;&#x4EFB;&#x4F55;&#x969C;&#x788D;&#x3002; &#x9632;&#x706B;&#x5899;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x6216;&#x8F6F;&#x4EF6;&#xFF0C;&#x7528;&#x4E8E;&#x9009;&#x62E9;&#x6027;&#x9650;&#x5236;&#x53D1;&#x5F80;&#x6216;&#x6765;&#x81EA;&#x7279;&#x5B9A;&#x76EE;&#x6807;&#x7684;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x3002; &#x9632;&#x706B;&#x5899;&#x901A;&#x5E38;&#x914D;&#x7F6E;&#x4E3A;&#x9632;&#x6B62;&#x8FDC;&#x7A0B;&#x8BBF;&#x95EE;&#x7279;&#x5B9A;&#x670D;&#x52A1;&#x3002; &#x9632;&#x706B;&#x5899;&#x7684;&#x5B58;&#x5728;&#x4FEE;&#x6539;&#x4E86;&#x653B;&#x51FB;&#x7CFB;&#x7EDF;&#x548C;&#x76EE;&#x6807;&#x4E4B;&#x95F4;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x5C1D;&#x8BD5;&#x8BC6;&#x522B;&#x7ED5;&#x8FC7;&#x5176;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x8BC6;&#x522B;&#x9632;&#x706B;&#x5899;&#x8BBE;&#x5907;&#x548C;&#x670D;&#x52A1;&#x7684;&#x6280;&#x672F;&#x5C06;&#x5728;&#x8BB2;&#x89E3;&#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;&#x7684;&#x79D8;&#x7C4D;&#x4E2D;&#x8BA8;&#x8BBA;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Netcat &#x6293;&#x53D6;&#x670D;&#x52A1;&#x7279;&#x5F81;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4E0E;&#x5EFA;&#x7ACB;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x5EFA;&#x7ACB;&#x5957;&#x63A5;&#x5B57;&#x8FDE;&#x63A5;&#x3002;&#x4E3A;&#x4E86;&#x5FEB;&#x901F;&#x7406;&#x89E3; Netcat &#x7684;&#x7528;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x7528;&#x4E8E;&#x8BE5;&#x76EE;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8F93;&#x51FA;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>-h</code>&#x9009;&#x9879;&#x6765;&#x5B8C;&#x6210;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nc -h 
[v1.10-40] 
connect to somewhere:  nc [-options] hostname port[s] [ports] ... 
listen for inbound:    nc -l -p port [-options] [hostname] [port] 
options:
    -c shell commands as `-e&apos;; use /bin/sh to exec [dangerous!!]   
    -e filename      program to exec after connect [dangerous!!]    
    -b          allow broadcasts   
    -g gateway      source-routing hop point[s], up to 8  
    -G num          source-routing pointer: 4, 8, 12, ...    
    -h          this cruft
    -i secs          delay interval for lines sent, ports scanned        
    -k                      set keepalive option on socket    
    -l          listen mode, for inbound connects   
    -n          numeric-only IP addresses, no DNS   
    -o file            hex dump of traffic  
    -p port          local port number   
    -r          randomize local and remote ports   
    -q secs          quit after EOF on stdin and delay of secs  
    -s addr            local source address  
    -T tos          set Type Of Service  
    -t          answer TELNET negotiation 
    -u          UDP mode 
    -v          verbose [use twice to be more verbose]   
    -w secs          timeout for connects and final net reads    
    -z          zero-I/O mode [used for scanning]
</code></pre><p>&#x901A;&#x8FC7;&#x67E5;&#x770B;&#x5DE5;&#x5177;&#x63D0;&#x4F9B;&#x7684;&#x591A;&#x4E2A;&#x9009;&#x9879;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x51FA;&#xFF0C;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x9009;&#x9879;&#xFF0C;IP &#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x5230;&#x6240;&#x9700;&#x7AEF;&#x53E3;&#x7684;&#x8FDE;&#x63A5;&#x3002;</p>
<pre><code>root@KaliLinux:~# nc -vn 172.16.36.135 22 
(UNKNOWN) [172.16.36.135] 22 (ssh) open 
SSH-2.0-OpenSSH_4.7p1 Debian-8ubuntu1 
^C
</code></pre><p>&#x5728;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x521B;&#x5EFA;&#x4E86;&#x5230; Metasploitable2 &#x7CFB;&#x7EDF;<code>172.16.36.135</code> &#x7AEF;&#x53E3; 22 &#x7684;&#x94FE;&#x63A5;&#x3002;<code>-v</code>&#x9009;&#x9879;&#x7528;&#x4E8E;&#x63D0;&#x4F9B;&#x8BE6;&#x7EC6;&#x8F93;&#x51FA;&#xFF0C;<code>-n</code>&#x9009;&#x9879;&#x7528;&#x4E8E;&#x4E0D;&#x4F7F;&#x7528; DNS &#x89E3;&#x6790;&#x6765;&#x8FDE;&#x63A5;&#x5230;&#x8FD9;&#x4E2A; IP &#x5730;&#x5740;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x8FDC;&#x7A0B;&#x4E3B;&#x673A;&#x8FD4;&#x56DE;&#x7684;&#x7279;&#x5F81;&#x5C06;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#x4E3A; SSH&#xFF0C;&#x5382;&#x5546;&#x4E3A; OpenSSH&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x6709;&#x7CBE;&#x786E;&#x7684;&#x7248;&#x672C; 4.7&#x3002;Netcat &#x7EF4;&#x62A4;&#x5F00;&#x653E;&#x8FDE;&#x63A5;&#xFF0C;&#x6240;&#x4EE5;&#x8BFB;&#x53D6;&#x7279;&#x5F81;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6309;&#x4E0B;<code>Ctrl + C</code>&#x6765;&#x5F3A;&#x884C;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x3002;</p>
<pre><code>root@KaliLinux:~# nc -vn 172.16.36.135 21 
(UNKNOWN) [172.16.36.135] 21 (ftp) open 
220 (vsFTPd 2.3.4) 
^C
</code></pre><p>&#x901A;&#x8FC7;&#x6267;&#x884C;&#x76F8;&#x540C;&#x4E3B;&#x673A; 21 &#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x76F8;&#x4F3C;&#x626B;&#x63CF;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x83B7;&#x5F97;&#x6240;&#x8FD0;&#x884C; FTP &#x670D;&#x52A1;&#x7684;&#x670D;&#x52A1;&#x548C;&#x7248;&#x672C;&#x4FE1;&#x606F;&#x3002;&#x6BCF;&#x4E2A;&#x60C5;&#x51B5;&#x90FD;&#x66B4;&#x9732;&#x4E86;&#x5927;&#x91CF;&#x5B9E;&#x7528;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4E86;&#x89E3;&#x8FD0;&#x884C;&#x5728;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x670D;&#x52A1;&#x548C;&#x7248;&#x672C;&#x901A;&#x5E38;&#x662F;&#x6F0F;&#x6D1E;&#x7684;&#x5173;&#x952E;&#x6307;&#x793A;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5229;&#x7528;&#x6216;&#x8005;&#x5165;&#x4FB5;&#x7CFB;&#x7EDF;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Netcat &#x80FD;&#x591F;&#x4F4F;&#x533A;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x8BBE;&#x5907;&#x8FDE;&#x63A5;&#x5B83;&#x4EEC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x670D;&#x52A1;&#x7684;&#x914D;&#x7F6E;&#x4F1A;&#x81EA;&#x5DF1;&#x5F00;&#x623F;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x81EA;&#x6211;&#x5F00;&#x623F;&#x670D;&#x52A1;&#x7684;&#x548C;&#x7248;&#x672C;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x5728;&#x8FC7;&#x53BB;&#x5E38;&#x5E38;&#x4F7F;&#x7528;&#xFF0C;&#x6765;&#x786E;&#x4FDD;&#x5BA2;&#x6237;&#x7AEF;&#x4FE9;&#x8FDE;&#x63A5;&#x5230;&#x4E86;&#x5B83;&#x4EEC;&#x60F3;&#x8FDE;&#x63A5;&#x7684;&#x76EE;&#x6807;&#x3002;&#x7531;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x5B89;&#x5168;&#x610F;&#x8BC6;&#x53D8;&#x5F3A;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B9E;&#x8DF5;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x4E0D;&#x666E;&#x904D;&#x3002;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#xFF0C;&#x5B83;&#x4ECD;&#x65E7;&#x5BF9;&#x4E8E;&#x4E0D;&#x826F;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x6216;&#x8005;&#x5386;&#x53F2;&#x9057;&#x7559;&#x670D;&#x52A1;&#x5341;&#x5206;&#x666E;&#x904D;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x4EE5;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x7684;&#x5F62;&#x5F0F;&#x63D0;&#x4F9B;&#x5927;&#x91CF;&#x4FE1;&#x606F;&#x3002;</p>
<h2 id="42-python-&#x5957;&#x63A5;&#x5B57;&#x7279;&#x5F81;&#x6293;&#x53D6;">4.2 Python &#x5957;&#x63A5;&#x5B57;&#x7279;&#x5F81;&#x6293;&#x53D6;</h2>
<p>Python &#x7684;&#x5957;&#x63A5;&#x5B57;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8FDE;&#x63A5;&#x8FD0;&#x884C;&#x5728;&#x8FDC;&#x7A0B;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x997F;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Python &#x5957;&#x63A5;&#x5B57;&#x6765;&#x83B7;&#x53D6;&#x670D;&#x52A1;&#x7279;&#x5F81;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BC6;&#x522B;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x4E0A;&#x548C;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Python &#x5957;&#x63A5;&#x5B57;&#x6536;&#x96C6;&#x670D;&#x52A1;&#x7279;&#x5F81;&#xFF0C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x8BBE;&#x5907;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C;&#x5F00;&#x653E;&#x4FE1;&#x606F;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528;&#x4E86; Metasploitable2 &#x6765;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E00;&#x8282;&#x4E5F;&#x9700;&#x8981;&#x7F16;&#x5199;&#x811A;&#x672C;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668; VIM &#x548C; Nano&#x201D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4F7F;&#x7528; Python &#x4EA4;&#x4E92;&#x5F0F;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4E0E;&#x8FDC;&#x7A0B;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x4EA4;&#x4E92;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; &#x76F4;&#x63A5;&#x8C03;&#x7528; Python &#x89E3;&#x91CA;&#x5668;&#x6765;&#x76F4;&#x63A5;&#x548C;&#x5B83;&#x4EA4;&#x4E92;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5BFC;&#x5165;&#x4EFB;&#x4F55;&#x6253;&#x7B97;&#x4F7F;&#x7528;&#x7684;&#x7279;&#x5B9A;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5BFC;&#x5165;&#x5957;&#x63A5;&#x5B57;&#x6A21;&#x5757;&#x3002;</p>
<pre><code>root@KaliLinux:~# python 
Python 2.7.3 (default, Jan  2 2013, 16:53:07) 
[GCC 4.7.2] on linux2 
Type &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more  information. 
&gt;&gt;&gt; import socket 
&gt;&gt;&gt; bangrab = socket.socket(socket.AF_INET, socket.SOCK_STREAM) 
&gt;&gt;&gt; bangrab.connect((&quot;172.16.36.135&quot;, 21))
&gt;&gt;&gt; bangrab.recv(4096) &apos;220 (vsFTPd 2.3.4)\r\n&apos;
&gt;&gt;&gt; bangrab.close() 
&gt;&gt;&gt; exit()
</code></pre><p>&#x5728;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x540D;<code>bangrab</code>&#x521B;&#x5EFA;&#x4E86;&#x65B0;&#x7684;&#x5957;&#x63A5;&#x5B57;&#x3002;<code>AF_INET</code>&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x8868;&#x793A;&#xFF0C;&#x5957;&#x63A5;&#x5B57;&#x4F7F;&#x7528; IPv4 &#x5730;&#x5740;&#xFF0C;<code>SOCK_STREAM</code>&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x4F7F;&#x7528; TCP &#x6765;&#x4F20;&#x8F93;&#x3002;&#x4E00;&#x65E6;&#x5957;&#x63A5;&#x5B57;&#x521B;&#x5EFA;&#x5B8C;&#x6BD5;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>connect</code>&#x6765;&#x521D;&#x59CB;&#x5316;&#x8FDE;&#x63A5;&#x3002;&#x4F8B;&#x5B50;&#x4E2D;&#x3002;<code>bangrab</code>&#x5957;&#x63A5;&#x5B57;&#x8FDE;&#x63A5; Metasploitable2 &#x8FDC;&#x7A0B;&#x4E3B;&#x673A;<code>172.16.36.135</code>&#x7684; 21 &#x7AEF;&#x53E3;&#x3002;&#x8FDE;&#x63A5;&#x540E;&#xFF0C;<code>recv</code>&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x4ECE;&#x5957;&#x63A5;&#x5B57;&#x6240;&#x8FDE;&#x63A5;&#x7684;&#x670D;&#x52A1;&#x63A5;&#x6536;&#x5185;&#x5BB9;&#x3002;&#x5047;&#x8BBE;&#x6709;&#x53EF;&#x7528;&#x4FE1;&#x606F;&#xFF0C;&#x5B83;&#x4F1A;&#x6253;&#x5370;&#x5B83;&#x4F5C;&#x4E3A;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7531;&#x8FD0;&#x884C;&#x5728; Metasploitable2 &#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684; FTP &#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x7684;&#x7279;&#x5F81;&#x3002;&#x6700;&#x540E;&#xFF0C;<code>close</code>&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5B8C;&#x5168;&#x7ED3;&#x675F;&#x4E0E;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x8FDE;&#x63A5;&#x4E0D;&#x63A5;&#x53D7;&#x8FDE;&#x63A5;&#x7684;&#x670D;&#x52A1;&#xFF0C;Python &#x89E3;&#x91CA;&#x5668;&#x4F1A;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x3002;</p>
<pre><code>root@KaliLinux:~# python 
Python 2.7.3 (default, Jan  2 2013, 16:53:07) 
[GCC 4.7.2] on linux2 
Type &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more  information. 
&gt;&gt;&gt; import socket 
&gt;&gt;&gt; bangrab = socket.socket(socket.AF_INET, socket.SOCK_STREAM) 
&gt;&gt;&gt; bangrab.connect((&quot;172.16.36.135&quot;, 443)) 
Traceback (most recent call last):  
    File &quot;&lt;stdin&gt;&quot;, line 1, in &lt;module&gt;  
    File &quot;/usr/lib/python2.7/socket.py&quot;, line 224, in meth    
        return getattr(self._sock,name)(*args) 
socket.error: [Errno 111] Connection refused 
&gt;&gt;&gt; exit()
</code></pre><p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x8FDE;&#x63A5; Metasploitable2 &#x7CFB;&#x7EDF;&#x4E0A;&#x7684; TCP 443 &#x7AEF;&#x53E3;&#xFF0C;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;&#x8868;&#x793A;&#x8FDE;&#x63A5;&#x88AB;&#x62D2;&#x7EDD;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x8FDC;&#x7A0B;&#x7AEF;&#x53E3;&#x4E0A;&#x6CA1;&#x6709;&#x8FD0;&#x884C;&#x670D;&#x52A1;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x5F53;&#x5B58;&#x5728;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x5728;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x65F6;&#xFF0C;&#x4E5F;&#x4E0D;&#x7B49;&#x4E8E;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x670D;&#x52A1;&#x7684;&#x7279;&#x5F81;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0E; Metasploitable2 &#x7CFB;&#x7EDF;&#x7684; TCP 80 &#x7AEF;&#x53E3;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x6765;&#x770B;&#x5230;&#x3002;</p>
<pre><code>root@KaliLinux:~# python 
Python 2.7.3 (default, Jan  2 2013, 16:53:07) 
[GCC 4.7.2] on linux2 
Type &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more information.

&gt;&gt;&gt; import socket 
&gt;&gt;&gt; bangrab = socket.socket(socket.AF_INET, socket.SOCK_STREAM) 
&gt;&gt;&gt; bangrab.connect((&quot;172.16.36.135&quot;, 80)) 
&gt;&gt;&gt; bangrab.recv(4096)
</code></pre><p>&#x8FD0;&#x884C;&#x5728;&#x8BE5;&#x7CFB;&#x7EDF; 80 &#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x670D;&#x52A1;&#x63A5;&#x53D7;&#x8FDE;&#x63A5;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x7ED9;&#x8FDE;&#x63A5;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x5982;&#x679C;<code>recv</code>&#x51FD;&#x6570;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x7ED9;&#x63A5;&#x53D7;&#x8005;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4F1A;&#x88AB;&#x963B;&#x585E;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Python &#x81EA;&#x52A8;&#x5316;&#x6536;&#x96C6;&#x7279;&#x5F81;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x6765;&#x8BC6;&#x522B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x6293;&#x53D6;&#x5230;&#x7279;&#x5F81;&#xFF0C;&#x5728;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4E4B;&#x524D;&#x3002;<code>select</code>&#x51FD;&#x6570;&#x4E3A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x63D0;&#x4F9B;&#x4E86;&#x4FBF;&#x5229;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<pre><code>root@KaliLinux:~# python 
Python 2.7.3 (default, Jan  2 2013, 16:53:07) 
[GCC 4.7.2] on linux2 
Type &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more  information. 
&gt;&gt;&gt; import socket 
&gt;&gt;&gt; import select 
&gt;&gt;&gt; bangrab = socket.socket(socket.AF_INET, socket.SOCK_STREAM) 
&gt;&gt;&gt; bangrab.connect((&quot;172.16.36.135&quot;, 80)) 
&gt;&gt;&gt; ready = select.select([bangrab],[],[],1) 
&gt;&gt;&gt; if ready[0]: 
...     print bangrab.recv(4096) 
... else: 
...     print &quot;No Banner&quot; 
... No Banner
</code></pre><p><code>select</code>&#x5BF9;&#x8C61;&#x88AB;&#x521B;&#x5EFA;&#xFF0C;&#x5E76;&#x8D4B;&#x7ED9;&#x4E86;&#x53D8;&#x91CF;<code>ready</code>&#x3002;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x88AB;&#x4F20;&#x5165;&#x4E86; 4 &#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5305;&#x62EC;&#x8BFB;&#x53D6;&#x5217;&#x8868;&#xFF0C;&#x5199;&#x5165;&#x5217;&#x8868;&#xFF0C;&#x5F02;&#x5E38;&#x5217;&#x8868;&#xFF0C;&#x548C;&#x5B9A;&#x4E49;&#x8D85;&#x65F6;&#x79D2;&#x6570;&#x7684;&#x6574;&#x6570;&#x503C;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4EC5;&#x4EC5;&#x9700;&#x8981;&#x8BC6;&#x522B;&#x5957;&#x63A5;&#x5B57;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#xFF0C;&#x6240;&#x4EE5;&#x7B2C;&#x4E8C;&#x4E2A;&#x548C;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x90FD;&#x662F;&#x7A7A;&#x7684;&#x3002;&#x8FD4;&#x56DE;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x5BF9;&#x5E94;&#x4E09;&#x4E2A;&#x5217;&#x8868;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x3002;&#x6211;&#x4EEC;&#x4EC5;&#x4EC5;&#x5BF9;<code>bangrab</code>&#x662F;&#x5426;&#x6709;&#x7528;&#x4EFB;&#x4F55;&#x53EF;&#x8BFB;&#x5185;&#x5BB9;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x4E3A;&#x4E86;&#x5224;&#x65AD;&#x662F;&#x5426;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6D4B;&#x8BD5;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x503C;&#x8BAF;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x5957;&#x63A5;&#x5B57;&#x4E2D;&#x63A5;&#x53D7;&#x5185;&#x5BB9;&#x3002;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Python &#x53EF;&#x6267;&#x884C;&#x811A;&#x672C;&#x6765;&#x81EA;&#x52A8;&#x5316;&#xFF1A;</p>
<pre><code>#!/usr/bin/python

import socket 
import select 
import sys

if len(sys.argv) != 4:
    print &quot;Usage - ./banner_grab.py [Target-IP] [First Port] [Last     Port]&quot;   
    print &quot;Example - ./banner_grab.py 10.0.0.5 1 100&quot;   
    print &quot;Example will grab banners for TCP ports 1 through 100 on     10.0.0.5&quot;   
    sys.exit()

ip = sys.argv[1] 
start = int(sys.argv[2]) 
end = int(sys.argv[3])
for port in range(start,end):   
try:      
    bangrab = socket.socket(socket.AF_INET, socket.SOCK_STREAM)      
    bangrab.connect((ip, port))      
    ready = select.select([bangrab],[],[],1)      
    if ready[0]:         
        print &quot;TCP Port &quot; + str(port) + &quot; - &quot; + bangrab.recv(4096)         
        bangrab.close()   
except: 
    pass
</code></pre><p>&#x5728;&#x63D0;&#x4F9B;&#x7684;&#x811A;&#x672C;&#x4E2D;&#xFF0C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x63A5;&#x53D7;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5305;&#x542B;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x7684; IP &#x5730;&#x5740;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x6307;&#x660E;&#x4E86;&#x88AB;&#x626B;&#x63CF;&#x7684;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x6307;&#x660E;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x3002;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x4F1A;&#x4F7F;&#x7528; Python &#x5957;&#x63A5;&#x5B57;&#x6765;&#x8FDE;&#x63A5;&#x6240;&#x6709;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684;&#x8303;&#x56F4;&#x5185;&#x7684;&#x7AEF;&#x53E3;&#x503C;&#x3002;&#x5E76;&#x4E14;&#x4F1A;&#x6536;&#x96C6;&#x548C;&#x6253;&#x5370;&#x6240;&#x6709;&#x8BC6;&#x522B;&#x51FA;&#x7684;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x3002;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x6587;&#x4EF6;&#x6743;&#x9650;&#x4E4B;&#x540E;&#x76F4;&#x63A5;&#x4ECE;&#x6240;&#x5728;&#x76EE;&#x5F55;&#x4E2D;&#x8C03;&#x7528;&#x6765;&#x6267;&#x884C;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# chmod 777 banner_grab.py 
root@KaliLinux:~# ./banner_grab.py 172.16.36.135 1 65535 

TCP Port 21 - 220 (vsFTPd 2.3.4)

TCP Port 22 - SSH-2.0-OpenSSH_4.7p1 Debian-8ubuntu1

TCP Port 23 - ???? ??#??&apos; 
TCP Port 25 - 220 metasploitable.localdomain ESMTP Postfix (Ubuntu)

TCP Port 512 - Where are you?

TCP Port 514 - 
TCP Port 1524 - root@metasploitable:/# 

TCP Port 2121 - 220 ProFTPD 1.3.1 Server (Debian)  
[::ffff:172.16.36.135]

TCP Port 3306 - &gt; 
5.0.51a-3ubuntu5?bo,(${c\,#934JYb^4&apos;fM 
TCP Port 5900 - RFB 003.003

TCP Port 6667 - :irc.Metasploitable.LAN NOTICE AUTH :*** Looking up  your hostname... 
:irc.Metasploitable.LAN NOTICE AUTH :*** Couldn&apos;t resolve your  hostname; using your IP address instead

TCP Port 6697 - :irc.Metasploitable.LAN NOTICE AUTH :*** Looking up  your hostname...
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x4E2D;&#x5F15;&#x5165;&#x7684; Python &#x811A;&#x672C;&#x7684;&#x539F;&#x7406;&#x662F;&#x4F7F;&#x7528;&#x5957;&#x63A5;&#x5B57;&#x5E93;&#x3002;&#x811A;&#x672C;&#x904D;&#x5386;&#x6BCF;&#x4E2A;&#x6307;&#x5B9A;&#x7684;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x4E0E;&#x7279;&#x5B9A;&#x7AEF;&#x53E3;&#x521D;&#x59CB;&#x5316; TCP &#x8FDE;&#x63A5;&#x3002;&#x5982;&#x679C;&#x5EFA;&#x7ACB;&#x4E86;&#x8FDE;&#x63A5;&#x5E76;&#x63A5;&#x53D7;&#x5230;&#x6765;&#x81EA;&#x76EE;&#x6807;&#x670D;&#x52A1;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x7279;&#x5F81;&#x4E4B;&#x540E;&#x4F1A;&#x6253;&#x5370;&#x5728;&#x811A;&#x672C;&#x7684;&#x8F93;&#x51FA;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x8FDE;&#x63A5;&#x4E0D;&#x80FD;&#x4E0E;&#x8FDC;&#x7A0B;&#x7AEF;&#x53E3;&#x5EFA;&#x7ACB;&#xFF0C;&#x811A;&#x672C;&#x4E4B;&#x540E;&#x4F1A;&#x79FB;&#x52A8;&#x5230;&#x5FAA;&#x73AF;&#x6C47;&#x603B;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x3002;&#x4E0E;&#x4E4B;&#x76F8;&#x4F3C;&#xFF0C;&#x5982;&#x679C;&#x5EFA;&#x7ACB;&#x4E86;&#x8FDE;&#x63A5;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x4EFB;&#x4F55;&#x7279;&#x5F81;&#xFF0C;&#x8FDE;&#x63A5;&#x4F1A;&#x88AB;&#x5173;&#x95ED;&#xFF0C;&#x5E76;&#x4E14;&#x811A;&#x672C;&#x4F1A;&#x7EE7;&#x7EED;&#x626B;&#x63CF;&#x5FAA;&#x73AF;&#x5185;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x503C;&#x3002;</p>
<h2 id="43-dmitry-&#x7279;&#x5F81;&#x6293;&#x53D6;">4.3 Dmitry &#x7279;&#x5F81;&#x6293;&#x53D6;</h2>
<p>Dmitry &#x662F;&#x4E2A;&#x7B80;&#x5355;&#x4F46;&#x9AD8;&#x6548;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8FDE;&#x63A5;&#x8FD0;&#x884C;&#x5728;&#x8FDC;&#x7A0B;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x771F;&#x5B9E;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528;Dmitry &#x626B;&#x63CF;&#x6765;&#x83B7;&#x53D6;&#x670D;&#x52A1;&#x7279;&#x5F81;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BC6;&#x522B;&#x548C;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Dmitry &#x6536;&#x96C6;&#x670D;&#x52A1;&#x7279;&#x5F81;&#xFF0C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x8BBE;&#x5907;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C;&#x5F00;&#x653E;&#x4FE1;&#x606F;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528;&#x4E86; Metasploitable2 &#x6765;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x5C31;&#x50CF;&#x5728;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x79D8;&#x7C4D;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837; Dmitry&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5BF9; 150 &#x4E2A;&#x5E38;&#x7528;&#x670D;&#x52A1;&#x7684;&#x7AEF;&#x53E3;&#x6267;&#x884C;&#x5FEB;&#x901F;&#x7684; TCP &#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>-p</code>&#x9009;&#x9879;&#x6765;&#x6267;&#x884C;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# dmitry -p 172.16.36.135 
Deepmagic Information Gathering Tool 
&quot;There be some deep magic going on&quot;

ERROR: Unable to locate Host Name for 172.16.36.135 
Continuing with limited modules 
HostIP:172.16.36.135 HostName:

Gathered TCP Port information for 172.16.36.135 
--------------------------------

 Port     State

21/tcp     open 
22/tcp     open 
23/tcp     open 
25/tcp     open 
53/tcp     open 
80/tcp     open 
111/tcp        open 
139/tcp        open

Portscan Finished: Scanned 150 ports, 141 ports were in state closed
</code></pre><p>&#x8FD9;&#x4E2A;&#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x9009;&#x9879;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x4EE5;&#x4FBF;&#x4F7F;&#x7528; Dmitry &#x6267;&#x884C;&#x7279;&#x5F81;&#x6293;&#x53D6;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5C1D;&#x8BD5;&#x8FDE;&#x63A5;&#x8FD9; 150 &#x4E2A;&#x7AEF;&#x53E3;&#x65F6;&#xFF0C;&#x8BA9; Dmitry &#x6293;&#x53D6;&#x4EFB;&#x4F55;&#x53EF;&#x7528;&#x7684;&#x7279;&#x5F81;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>-b</code>&#x9009;&#x9879;&#x548C;<code>-p</code>&#x9009;&#x9879;&#x6765;&#x5B8C;&#x6210;&#x3002;</p>
<pre><code>root@KaliLinux:~# dmitry -pb 172.16.36.135 
Deepmagic Information Gathering Tool
&quot;There be some deep magic going on&quot;

ERROR: Unable to locate 
Host Name for 172.16.36.135 Continuing with limited modules 
HostIP:172.16.36.135 HostName:

Gathered TCP Port information for 172.16.36.135 
--------------------------------

 Port     State

21/tcp     open 
&gt;&gt; 220 (vsFTPd 2.3.4)

22/tcp     open 
&gt;&gt; SSH-2.0-OpenSSH_4.7p1 Debian-8ubuntu1

23/tcp     open 
&gt;&gt; ???? ??#??&apos; 
25/tcp     open 
&gt;&gt; 220 metasploitable.localdomain ESMTP Postfix (Ubuntu)

53/tcp     open 
80/tcp     open 
111/tcp        open 
139/tcp        open

Portscan Finished: Scanned 150 ports, 141 ports were in state closed
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Dmitry &#x662F;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x547D;&#x4EE4;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x4EE5;&#x5C11;&#x91CF;&#x5F00;&#x9500;&#x6267;&#x884C;&#x7279;&#x5F81;&#x6293;&#x53D6;&#x4EFB;&#x52A1;&#x3002;&#x6BD4;&#x8D77;&#x6307;&#x5B9A;&#x9700;&#x8981;&#x5C1D;&#x8BD5;&#x7279;&#x5F81;&#x6293;&#x53D6;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;Dmitry &#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x5316;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x901A;&#x8FC7;&#x4EC5;&#x4EC5;&#x5728;&#x5C0F;&#x578B;&#x7684;&#x9884;&#x5B9A;&#x4E49;&#x548C;&#x5E38;&#x7528;&#x7AEF;&#x53E3;&#x96C6;&#x5408;&#x4E2D;&#x5C1D;&#x8BD5;&#x7279;&#x5F81;&#x6293;&#x53D6;&#x3002;&#x6765;&#x81EA;&#x8FD0;&#x884C;&#x5728;&#x8FD9;&#x4E9B;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x7684;&#x7279;&#x5F81;&#x4E4B;&#x540E;&#x4F1A;&#x5728;&#x811A;&#x672C;&#x7684;&#x7EC8;&#x7AEF;&#x8F93;&#x51FA;&#x4E2D;&#x663E;&#x793A;&#x3002;</p>
<h2 id="44-nmap-nse-&#x7279;&#x5F81;&#x6293;&#x53D6;">4.4 Nmap NSE &#x7279;&#x5F81;&#x6293;&#x53D6;</h2>
<p>Nmap &#x62E5;&#x6709;&#x96C6;&#x6210;&#x7684; Nmap &#x811A;&#x672C;&#x5F15;&#x64CE;&#xFF08;NSE&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x4ECE;&#x8FD0;&#x884C;&#x5728;&#x8FDC;&#x7A0B;&#x7AEF;&#x53E3;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x4E2D;&#x8BFB;&#x53D6;&#x7279;&#x5F81;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Nmap NSE &#x6765;&#x83B7;&#x53D6;&#x670D;&#x52A1;&#x7279;&#x5F81;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BC6;&#x522B;&#x4E0E;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Nmap NSE &#x6536;&#x96C6;&#x670D;&#x52A1;&#x7279;&#x5F81;&#xFF0C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x8BBE;&#x5907;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C;&#x5F00;&#x653E;&#x4FE1;&#x606F;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528;&#x4E86; Metasploitable2 &#x6765;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>Nmap NSE &#x811A;&#x672C;&#x53EF;&#x4EE5;&#x5728; Nmap &#x4E2D;&#x4F7F;&#x7528;<code>--script</code>&#x9009;&#x9879;&#xFF0C;&#x4E4B;&#x540E;&#x6307;&#x5B9A;&#x811A;&#x672C;&#x540D;&#x79F0;&#x6765;&#x8C03;&#x7528;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x4F1A;&#x4F7F;&#x7528;<code>-sT</code>&#x5168;&#x8FDE;&#x63A5;&#x626B;&#x63CF;&#xFF0C;&#x56E0;&#x4E3A;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x5EFA;&#x7ACB; TCP &#x5168;&#x8FDE;&#x63A5;&#x5728;&#x6536;&#x96C6;&#x3002;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x4F1A;&#x5728;&#x901A;&#x8FC7; Nmap &#x8BF7;&#x6C42;&#x626B;&#x63CF;&#x7684;&#x76F8;&#x540C;&#x7AEF;&#x53E3;&#x4E0A;&#x4F7F;&#x7528;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap -sT 172.16.36.135 -p 22 --script=banner

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-19 04:56 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00036s latency). 
PORT   STATE SERVICE 
22/tcp open  ssh 
|_banner: SSH-2.0-OpenSSH_4.7p1 Debian-8ubuntu1 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 0.07 seconds
</code></pre><p>&#x5728;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x626B;&#x63CF;&#x4E86; Metasploitable2 &#x7CFB;&#x7EDF;&#x7684;&#x7AEF;&#x53E3; 22&#x3002;&#x9664;&#x4E86;&#x8868;&#x660E;&#x7AEF;&#x53E3;&#x6253;&#x5F00;&#x4E4B;&#x5916;&#xFF0C;Nmap &#x4E5F;&#x4F7F;&#x7528;&#x7279;&#x5F81;&#x811A;&#x672C;&#x6765;&#x6536;&#x96C6;&#x4E0E;&#x8BE5;&#x7AEF;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>--notation</code>&#xFF0C;&#x5728;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#x5185;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x673A;&#x5236;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap -sT 172.16.36.135 -p 1-100 --script=banner

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-19 04:56 EST
Nmap scan report for 172.16.36.135 
Host is up (0.0024s latency). 
Not shown: 94 closed ports 
PORT   STATE SERVICE 
21/tcp open  ftp 
|_banner: 220 (vsFTPd 2.3.4) 
22/tcp open  ssh 
|_banner: SSH-2.0-OpenSSH_4.7p1 Debian-8ubuntu1 
23/tcp open  telnet 
|_banner: \xFF\xFD\x18\xFF\xFD \xFF\xFD#\xFF\xFD&apos; 
25/tcp open  smtp 
|_banner: 220 metasploitable.localdomain ESMTP Postfix (Ubuntu) 
53/tcp open  domain 
80/tcp open  http 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 10.26 seconds
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x6267;&#x884C;&#x7279;&#x5F81;&#x6293;&#x53D6;&#x7684;&#x9009;&#x62E9;&#x5C31;&#x662F;&#x4F7F;&#x7528; Nmap NSE &#x811A;&#x672C;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x4EE5;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x6709;&#x6548;&#x7B80;&#x5316;&#x4FE1;&#x606F;&#x6536;&#x96C6;&#x8FC7;&#x7A0B;&#xFF1A;&#x9996;&#x5148;&#xFF0C;&#x7531;&#x4E8E; Nmap &#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E8E;&#x4F60;&#x7684;&#x5DE5;&#x5177;&#x5E93;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x7528;&#x4E8E;&#x76EE;&#x6807;&#x548C;&#x670D;&#x52A1;&#x63A2;&#x7D22;&#xFF1B;&#x5176;&#x6B21;&#xFF0C;&#x56E0;&#x4E3A;&#x7279;&#x5F81;&#x6293;&#x53D6;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x548C;&#x8FD9;&#x4E9B;&#x626B;&#x63CF;&#x4E00;&#x8D77;&#x6267;&#x884C;&#x3002; &#x5E26;&#x6709;&#x9644;&#x52A0;&#x811A;&#x672C;&#x9009;&#x9879;&#x548C;&#x7279;&#x5F81;&#x53C2;&#x6570;&#x7684; TCP &#x8FDE;&#x63A5;&#x626B;&#x63CF;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x670D;&#x52A1;&#x679A;&#x4E3E;&#x548C;&#x7279;&#x5F81;&#x6536;&#x96C6;&#x7684;&#x4EFB;&#x52A1;&#x3002;</p>
<h2 id="45-amap-&#x7279;&#x5F81;&#x6293;&#x53D6;">4.5 Amap &#x7279;&#x5F81;&#x6293;&#x53D6;</h2>
<p>Amap &#x662F;&#x4E2A;&#x5E94;&#x7528;&#x6620;&#x5C04;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x4ECE;&#x8FD0;&#x884C;&#x5728;&#x8FDC;&#x7A0B;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x4E2D;&#x8BFB;&#x53D6;&#x7279;&#x5F81;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Amap &#x6765;&#x83B7;&#x53D6;&#x670D;&#x52A1;&#x7279;&#x5F81;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BC6;&#x522B;&#x548C;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Amap &#x6536;&#x96C6;&#x670D;&#x52A1;&#x7279;&#x5F81;&#xFF0C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x8BBE;&#x5907;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C;&#x5F00;&#x653E;&#x4FE1;&#x606F;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528;&#x4E86; Metasploitable2 &#x6765;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>Amap &#x4E2D;&#x7684;<code>-B</code>&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x4EE5;&#x7279;&#x5F81;&#x6A21;&#x5F0F;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x3002;&#x8FD9;&#x4F1A;&#x4F7F;&#x5176;&#x6536;&#x96C6;&#x7279;&#x5B9A; IP &#x5730;&#x5740;&#x548C;&#x72EC;&#x821E;&#x7AEF;&#x53E3;&#x7684;&#x7279;&#x5F81;&#x3002;Amap &#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x8FDC;&#x7A0B; IP &#x5730;&#x5740;&#x548C;&#x670D;&#x52A1;&#x53F7;&#x7801;&#x6765;&#x6536;&#x96C6;&#x5355;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x7279;&#x5F81;&#x3002;</p>
<pre><code>root@KaliLinux:~# amap -B 172.16.36.135 21 
amap v5.4 (www.thc.org/thc-amap) started at 2013-12-19 05:04:58 -  BANNER mode

Banner on 172.16.36.135:21/tcp : 220 (vsFTPd 2.3.4)\r\n

amap v5.4 finished at 2013-12-19 05:04:58
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;Amap &#x4ECE; Metasploitable2 &#x7CFB;&#x7EDF;<code>172.16.36.135</code>&#x7684; 21 &#x7AEF;&#x53E3;&#x6293;&#x53D6;&#x4E86;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x3002;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x4E5F;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x6765;&#x626B;&#x63CF;&#x7AEF;&#x53E3;&#x7684;&#x5E8F;&#x5217;&#x8303;&#x56F4;&#x3002;&#x4E3A;&#x4E86;&#x5728;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684; TCP &#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x626B;&#x63CF;&#xFF0C;&#x9700;&#x8981;&#x5965;&#x5999;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x3002;&#x5B9A;&#x4E49;&#x4E86;&#x6765;&#x6E90;&#x548C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x7684; TCP &#x5934;&#x90E8;&#x90E8;&#x5206;&#x662F; 16 &#x4F4D;&#x957F;&#xFF0C;&#x6BCF;&#x4E00;&#x4F4D;&#x53EF;&#x4EE5;&#x4E3A;&#x503C; 1 &#x6216;&#x8005; 0&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x5171;&#x6709;<code>2 **16</code>&#x6216; 65536 &#x4E2A; TCP &#x7AEF;&#x53E3;&#x5730;&#x5740;&#x3002;&#x4E3A;&#x4E86;&#x626B;&#x63CF;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x5FC5;&#x987B;&#x63D0;&#x4F9B; 1 &#x5230; 65535 &#x7684; &#x8303;&#x56F4;&#x3002;</p>
<pre><code>root@KaliLinux:~# amap -B 172.16.36.135 1-65535 
amap v5.4 (www.thc.org/thc-amap) started at 2014-01-24 15:54:28 -  BANNER mode

Banner on 172.16.36.135:22/tcp : SSH-2.0-OpenSSH_4.7p1 Debian- 8ubuntu1\n 
Banner on 172.16.36.135:21/tcp : 220 (vsFTPd 2.3.4)\r\n 
Banner on 172.16.36.135:25/tcp : 220 metasploitable.localdomain  ESMTP Postfix (Ubuntu)\r\n 
Banner on 172.16.36.135:23/tcp :  #&apos; 
Banner on 172.16.36.135:512/tcp : Where are you?\n 
Banner on 172.16.36.135:1524/tcp : root@metasploitable/# 
Banner on 172.16.36.135:2121/tcp : 220 ProFTPD 1.3.1 Server  (Debian) [ffff172.16.36.135]\r\n 
Banner on 172.16.36.135:3306/tcp : &gt;\n5.0.51a- 3ubuntu5dJ$t?xdj,fCYxm=)Q=~$5 
Banner on 172.16.36.135:5900/tcp : RFB 003.003\n 
Banner on 172.16.36.135:6667/tcp : irc.Metasploitable.LAN NOTICE  AUTH *** Looking up your hostname...\r\n
Banner on 172.16.36.135:6697/tcp : irc.Metasploitable.LAN NOTICE  AUTH *** Looking up your hostname...\r\n

amap v5.4 finished at 2014-01-24 15:54:35
</code></pre><p>Amap &#x6240;&#x4EA7;&#x751F;&#x7684;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x65E0;&#x7528;&#x548C;&#x5197;&#x4F59;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x8F93;&#x51FA;&#x4E2D;&#x53BB;&#x6389;&#x3002;&#x5C24;&#x5176;&#x662F;&#xFF0C;&#x79FB;&#x9664;&#x626B;&#x63CF;&#x5143;&#x6570;&#x636E;&#xFF08;<code>Banner</code>&#xFF09;&#x4EE5;&#x53CA;&#x5728;&#x6574;&#x4E2A;&#x626B;&#x63CF;&#x4E2D;&#x90FD;&#x76F8;&#x540C;&#x7684; IP &#x5730;&#x5740;&#x4F1A;&#x5341;&#x5206;&#x6709;&#x7528;&#x3002;&#x4E3A;&#x4E86;&#x79FB;&#x9664;&#x626B;&#x63CF;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x7528;<code>grep</code>&#x641C;&#x7D22;&#x8F93;&#x51FA;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x77ED;&#x8BED;&#xFF0C;&#x5B83;&#x5BF9;&#x7279;&#x5B9A;&#x8F93;&#x51FA;&#x9879;&#x76EE;&#x552F;&#x4E00;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x626B;&#x63CF;&#x5143;&#x6570;&#x636E;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;<code>grep</code>&#x641C;&#x7D22;&#x5355;&#x8BCD;<code>on</code>&#x3002;</p>
<pre><code>root@KaliLinux:~# amap -B 172.16.36.135 1-65535 | grep &quot;on&quot; 
Banner on 172.16.36.135:22/tcp : SSH-2.0-OpenSSH_4.7p1 Debian- 8ubuntu1\n 
Banner on 172.16.36.135:23/tcp :  #&apos; 
Banner on 172.16.36.135:21/tcp : 220 (vsFTPd 2.3.4)\r\n 
Banner on 172.16.36.135:25/tcp : 220 metasploitable.localdomain  ESMTP Postfix (Ubuntu)\r\n 
Banner on 172.16.36.135:512/tcp : Where are you?\n 
Banner on 172.16.36.135:1524/tcp : root@metasploitable/# 
Banner on 172.16.36.135:2121/tcp : 220 ProFTPD 1.3.1 Server  (Debian) [ffff172.16.36.135]\r\n 
Banner on 172.16.36.135:3306/tcp : &gt;\n5.0.51a- 3ubuntu5\tr&gt;}{pDAY,|$948[D~q&lt;u[ 
Banner on 172.16.36.135:5900/tcp : RFB 003.003\n 
Banner on 172.16.36.135:6697/tcp : irc.Metasploitable.LAN NOTICE  AUTH *** Looking up your hostname...\r\n 
Banner on 172.16.36.135:6667/tcp : irc.Metasploitable.LAN NOTICE  AUTH *** Looking up your hostname...\r\n
</code></pre><p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5192;&#x53F7;&#x5206;&#x9694;&#x7B26;&#x6765;&#x5206;&#x5272;&#x6BCF;&#x884C;&#x8F93;&#x51FA;&#xFF0C;&#x5E76;&#x53EA;&#x4FDD;&#x7559;&#x5B57;&#x6BB5; 2 &#x5230; 5&#xFF0C;&#x5C06;<code>Banner on</code>&#x77ED;&#x8BED;&#xFF0C;&#x4EE5;&#x53CA;&#x91CD;&#x590D; IP &#x5730;&#x5740;&#x4ECE;&#x8F93;&#x51FA;&#x4E2D;&#x79FB;&#x9664;&#x3002;</p>
<pre><code>root@KaliLinux:~# amap -B 172.16.36.135 1-65535 | grep &quot;on&quot; | cut  -d &quot;:&quot; -f 2-5 
21/tcp : 220 (vsFTPd 2.3.4)\r\n
22/tcp : SSH-2.0-OpenSSH_4.7p1 Debian-8ubuntu1\n 
1524/tcp : root@metasploitable/# 
25/tcp : 220 metasploitable.localdomain ESMTP Postfix (Ubuntu)\r\n
23/tcp :  #&apos; 
512/tcp : Where are you?\n
2121/tcp : 220 ProFTPD 1.3.1 Server (Debian)  [ffff172.16.36.135]\r\n
3306/tcp : &gt;\n5.0.51a-3ubuntu5\nqjAClv0(,v&gt;q?&amp;?J7qW&gt;n 
5900/tcp : RFB 003.003\n 
6667/tcp : irc.Metasploitable.LAN NOTICE AUTH *** Looking up your  hostname...\r\n
6697/tcp : irc.Metasploitable.LAN NOTICE AUTH *** Looking up your  hostname...\r\n
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Amap &#x7528;&#x4E8E;&#x5B8C;&#x6210;&#x7279;&#x5F81;&#x6293;&#x53D6;&#x4EFB;&#x52A1;&#x7684;&#x5E95;&#x5C42;&#x539F;&#x7406;&#x548C;&#x5176;&#x5B83;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x5DE5;&#x5177;&#x4E00;&#x6837;&#x3002;Amap &#x5FAA;&#x73AF;&#x904D;&#x5386;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x5C1D;&#x8BD5;&#x548C;&#x6BCF;&#x4E2A;&#x7AEF;&#x53E3;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x4E4B;&#x540E;&#x63A5;&#x6536;&#x4EFB;&#x4F55;&#x8FD4;&#x56DE;&#x7684;&#x901A;&#x8FC7;&#x4E0E;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x53D1;&#x9001;&#x7684;&#x7279;&#x5F81;&#x3002;</p>
<h2 id="46-nmap-&#x670D;&#x52A1;&#x8BC6;&#x522B;">4.6 Nmap &#x670D;&#x52A1;&#x8BC6;&#x522B;</h2>
<p>&#x867D;&#x7136;&#x7279;&#x5F81;&#x6293;&#x53D6;&#x662F;&#x975E;&#x5E38;&#x6709;&#x5229;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x6E90;&#xFF0C;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x4E2D;&#x7684;&#x7248;&#x672C;&#x53D1;&#x73B0;&#x8D8A;&#x6765;&#x8D8A;&#x4E0D;&#x91CD;&#x8981;&#x3002;Nmap &#x62E5;&#x6709;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#x529F;&#x80FD;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x7B80;&#x5355;&#x7684;&#x7279;&#x5F81;&#x6293;&#x53D6;&#x673A;&#x5236;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Nmap &#x57FA;&#x4E8E;&#x63A2;&#x6D4B;&#x54CD;&#x5E94;&#x7684;&#x5206;&#x6790;&#x6267;&#x884C;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C;&#x53EF;&#x88AB;&#x63A2;&#x6D4B;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528;&#x4E86; Metasploitable2 &#x6765;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E3A;&#x4E86;&#x7406;&#x89E3; Nmap &#x670D;&#x52A1;&#x662F;&#x88AB;&#x529F;&#x80FD;&#x7684;&#x9AD8;&#x6548;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x4E0D;&#x63D0;&#x4F9B;&#x81EA;&#x6211;&#x5F00;&#x653E;&#x7684;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x7684;&#x670D;&#x52A1;&#x3002;&#x901A;&#x8FC7;&#x4F7F;&#x7528; Netcat &#x8FDE;&#x63A5; Metasploitable2 &#x7CFB;&#x7EDF;&#x7684; TCP 80 &#x7AEF;&#x53E3;&#xFF08;&#x8FD9;&#x4E2A;&#x6280;&#x5DE7;&#x5728;&#x8FD9;&#x4E00;&#x7AE0;&#x7684;&#x201C;Netcat &#x7279;&#x5F81;&#x6293;&#x53D6;&#x201D;&#x79D8;&#x7C4D;&#x4E2D;&#x8BA8;&#x8BBA;&#x8FC7;&#x4E86;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4EC5;&#x4EC5;&#x901A;&#x8FC7;&#x5EFA;&#x7ACB; TCP &#x8FDE;&#x63A5;&#xFF0C;&#x4E0D;&#x80FD;&#x5F97;&#x5230;&#x4EFB;&#x4F55;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x3002;</p>
<pre><code>root@KaliLinux:~# nc -nv 172.16.36.135 80 
(UNKNOWN) [172.16.36.135] 80 (http) open 
^C
</code></pre><p>&#x4E4B;&#x540E;&#xFF0C;&#x4E3A;&#x4E86;&#x5728;&#x76F8;&#x540C;&#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C; Nmap &#x626B;&#x63CF;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>-sV</code>&#x9009;&#x9879;&#xFF0C;&#x5E76;&#x4E14;&#x6307;&#x5B9A; IP &#x548C;&#x7AEF;&#x53E3;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap 172.16.36.135 -p 80 -sV

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-19 05:20 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00035s latency). 
PORT   STATE SERVICE VERSION 
80/tcp open  http    Apache httpd 2.2.8 ((Ubuntu) DAV/2) 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Service detection performed. Please report any incorrect results  at http://nmap.org/submit/ . 
Nmap done: 1 IP address (1 host up) scanned in 6.18 seconds
</code></pre><p>&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5728;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;Nmap &#x80FD;&#x591F;&#x8BC6;&#x522B;&#x8BE5;&#x670D;&#x52A1;&#xFF0C;&#x5382;&#x5546;&#xFF0C;&#x4EE5;&#x53CA;&#x4EA7;&#x54C1;&#x7684;&#x7279;&#x5B9A;&#x7248;&#x672C;&#x3002;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#x529F;&#x80FD;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5BF9;&#x7279;&#x5B9A;&#x7AEF;&#x53E3;&#x5217;&#x8868;&#x4F7F;&#x7528;&#x3002;&#x8FD9;&#x5728; Nmap &#x4E2D;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x7AEF;&#x53E3;&#xFF0C;Nmap &#x4F1A;&#x626B;&#x63CF; 1000 &#x4E2A;&#x5E38;&#x7528;&#x7AEF;&#x53E3;&#xFF0C;&#x5E76;&#x4E14;&#x5C1D;&#x8BD5;&#x8BC6;&#x522B;&#x6240;&#x6709;&#x8BC6;&#x522B;&#x51FA;&#x6765;&#x7684;&#x76D1;&#x542C;&#x670D;&#x52A1;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap 172.16.36.135 -sV

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-19 05:20 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00032s latency). 
Not shown: 977 closed ports 
PORT     STATE SERVICE     VERSION 
21/tcp   open  ftp         vsftpd 2.3.4 
22/tcp   open  ssh         OpenSSH 4.7p1 Debian 8ubuntu1 (protocol  2.0) 
23/tcp   open  telnet      Linux telnetd 
25/tcp   open  smtp        Postfix smtpd 
53/tcp   open  domain      ISC BIND 9.4.2 
80/tcp   open  http        Apache httpd 2.2.8 ((Ubuntu) DAV/2) 
111/tcp  open  rpcbind     2 (RPC #100000) 
139/tcp  open  netbios-ssn Samba smbd 3.X (workgroup: WORKGROUP) 
445/tcp  open  netbios-ssn Samba smbd 3.X (workgroup: WORKGROUP) 
512/tcp  open  exec        netkit-rsh rexecd 
513/tcp  open  login? 
514/tcp  open  tcpwrapped
1099/tcp open  rmiregistry GNU Classpath grmiregistry 
1524/tcp open  ingreslock? 
2049/tcp open  nfs         2-4 (RPC #100003) 
2121/tcp open  ftp         ProFTPD 1.3.1 
3306/tcp open  mysql       MySQL 5.0.51a-3ubuntu5 
5432/tcp open  postgresql  PostgreSQL DB 8.3.0 - 8.3.7 
5900/tcp open  vnc         VNC (protocol 3.3) 
6000/tcp open  X11         (access denied) 
6667/tcp open  irc         Unreal ircd 
8009/tcp open  ajp13       Apache Jserv (Protocol v1.3) 
8180/tcp open  http        Apache Tomcat/Coyote JSP engine 1.1 MAC Address: 00:0C:29:3D:84:32 (VMware) 
Service Info: Hosts:  metasploitable.localdomain, localhost,  irc.Metasploitable.LAN; OSs: Unix, Linux; CPE:  cpe:/o:linux:linux_kernel

Service detection performed. Please report any incorrect results  at http://nmap.org/submit/ . 
Nmap done: 1 IP address (1 host up) scanned in 161.49 seconds
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Nmap &#x670D;&#x52A1;&#x8BC6;&#x522B;&#x4F1A;&#x53D1;&#x9001;&#x4E00;&#x7CFB;&#x5217;&#x590D;&#x6742;&#x7684;&#x63A2;&#x6D4B;&#x8BF7;&#x6C42;&#xFF0C;&#x4E4B;&#x540E;&#x5206;&#x6790;&#x8FD9;&#x4E9B;&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x5C1D;&#x8BD5;&#x57FA;&#x4E8E;&#x670D;&#x52A1;&#x7279;&#x5B9A;&#x7684;&#x7B7E;&#x540D;&#x548C;&#x9884;&#x671F;&#x884C;&#x4E3A;&#xFF0C;&#x6765;&#x8BC6;&#x522B;&#x670D;&#x52A1;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230; Nmap &#x670D;&#x52A1;&#x8BC6;&#x522B;&#x8F93;&#x51FA;&#x7684;&#x5E95;&#x90E8;&#xFF0C;Nmap &#x4F9D;&#x8D56;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x4EE5;&#x4FBF;&#x786E;&#x4FDD;&#x670D;&#x52A1;&#x7B7E;&#x540D;&#x4FDD;&#x6301;&#x53EF;&#x9760;&#x3002;</p>
<h2 id="47-amap-&#x670D;&#x52A1;&#x8BC6;&#x522B;">4.7 Amap &#x670D;&#x52A1;&#x8BC6;&#x522B;</h2>
<p>Amap &#x662F; Nmap &#x7684;&#x8FD1;&#x4EB2;&#xFF0C;&#x5C24;&#x5176;&#x4E3A;&#x8BC6;&#x522B;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x800C;&#x8BBE;&#x8BA1;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x63A2;&#x7D22;&#x5982;&#x4F55;&#x4F7F;&#x7528; Amap &#x6765;&#x6267;&#x884C;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Amap &#x6267;&#x884C;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C;&#x53EF;&#x88AB;&#x63A2;&#x6D4B;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528;&#x4E86; Metasploitable2 &#x6765;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x914D;&#x7F6E; Metasploitable2 &#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E3A;&#x4E86;&#x5728;&#x5355;&#x4E00;&#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#xFF0C;&#x4EE5;&#x7279;&#x5B9A;&#x7684; IP &#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x53F7;&#x6765;&#x8FD0;&#x884C; Amap&#x3002;</p>
<pre><code>root@KaliLinux:~# amap 172.16.36.135 80 
amap v5.4 (www.thc.org/thc-amap) started at 2013-12-19 05:26:13 -  APPLICATION MAPPING mode

Protocol on 172.16.36.135:80/tcp matches http
Protocol on 172.16.36.135:80/tcp matches http-apache-2

Unidentified ports: none.

amap v5.4 finished at 2013-12-19 05:26:19
</code></pre><p>Amap &#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7834;&#x6298;&#x53F7;&#x8BB0;&#x6CD5;&#x626B;&#x63CF;&#x7AEF;&#x53E3;&#x53F7;&#x7801;&#x5E8F;&#x5217;&#x3002;&#x4E3A;&#x4E86;&#x8FD9;&#x6837;&#x4F60;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EE5;&#x7279;&#x5B9A; IP &#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#x6765;&#x6267;&#x884C;<code>amap</code>&#xFF0C;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#x7531;&#x8303;&#x56F4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x7834;&#x6298;&#x53F7;&#xFF0C;&#x548C;&#x8303;&#x56F4;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x53F7;&#x6307;&#x5B9A;&#x3002;</p>
<pre><code>root@KaliLinux:~# amap 172.16.36.135 20-30 
amap v5.4 (www.thc.org/thc-amap) started at 2013-12-19 05:28:16 -  APPLICATION MAPPING mode

Protocol on 172.16.36.135:25/tcp matches smtp 
Protocol on 172.16.36.135:21/tcp matches ftp 
Protocol on 172.16.36.135:25/tcp matches nntp 
Protocol on 172.16.36.135:22/tcp matches ssh 
Protocol on 172.16.36.135:22/tcp matches ssh-openssh 
Protocol on 172.16.36.135:23/tcp matches telnet

Unidentified ports: 172.16.36.135:20/tcp 172.16.36.135:24/tcp  172.16.36.135:26/tcp 172.16.36.135:27/tcp 172.16.36.135:28/tcp  172.16.36.135:29/tcp 172.16.36.135:30/tcp (total 7).

amap v5.4 finished at 2013-12-19 05:28:17
</code></pre><p>&#x9664;&#x4E86;&#x8BC6;&#x522B;&#x4EFB;&#x4F55;&#x670D;&#x52A1;&#xFF0C;&#x5B83;&#x4E5F;&#x80FD;&#x591F;&#x5728;&#x8F93;&#x51FA;&#x672B;&#x5C3E;&#x751F;&#x4EA7;&#x5217;&#x8868;&#xFF0C;&#x8868;&#x660E;&#x4EFB;&#x4F55;&#x672A;&#x8BC6;&#x522B;&#x7684;&#x7AEF;&#x53E3;&#x3002;&#x8FD9;&#x4E2A;&#x5217;&#x8868;&#x4E0D;&#x4EC5;&#x4EC5;&#x5305;&#x542B;&#x8FD0;&#x884C;&#x4E0D;&#x80FD;&#x8BC6;&#x522B;&#x7684;&#x670D;&#x52A1;&#x7684;&#x5F00;&#x653E;&#x7AEF;&#x53E3;&#xFF0C;&#x4E5F;&#x5305;&#x542B;&#x6240;&#x6709;&#x626B;&#x63CF;&#x8FC7;&#x7684;&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x8F93;&#x51FA;&#x4EC5;&#x5728;&#x626B;&#x63CF;&#x4E86; 10 &#x4E2A;&#x7AEF;&#x53E3;&#x65F6;&#x6613;&#x4E8E;&#x7BA1;&#x7406;&#xFF0C;&#x5F53;&#x626B;&#x63CF;&#x66F4;&#x591A;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#x4E4B;&#x540E;&#x4F1A;&#x53D8;&#x5F97;&#x5341;&#x5206;&#x9EBB;&#x70E6;&#x3002;&#x4E3A;&#x4E86;&#x53BB;&#x6389;&#x672A;&#x8BC6;&#x522B;&#x7AEF;&#x53E3;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>-q</code>&#x9009;&#x9879;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# amap 172.16.36.135 1-100 -q 
amap v5.4 (www.thc.org/thc-amap) started at 2013-12-19 05:29:27 -  APPLICATION MAPPING mode

Protocol on 172.16.36.135:21/tcp matches ftp 
Protocol on 172.16.36.135:25/tcp matches smtp 
Protocol on 172.16.36.135:22/tcp matches ssh 
Protocol on 172.16.36.135:22/tcp matches ssh-openssh 
Protocol on 172.16.36.135:23/tcp matches telnet 
Protocol on 172.16.36.135:80/tcp matches http 
Protocol on 172.16.36.135:80/tcp matches http-apache-2 
Protocol on 172.16.36.135:25/tcp matches nntp 
Protocol on 172.16.36.135:53/tcp matches dns

amap v5.4 finished at 2013-12-19 05:29:39
</code></pre><p>&#x8981;&#x6CE8;&#x610F;&#xFF0C;Amap &#x4F1A;&#x6307;&#x660E;&#x5E38;&#x89C4;&#x5339;&#x914D;&#x548C;&#x66F4;&#x52A0;&#x7279;&#x5B9A;&#x7684;&#x7B7E;&#x540D;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8FD0;&#x884C;&#x5728;&#x7AEF;&#x53E3; 22 &#x7684;&#x670D;&#x52A1;&#x88AB;&#x8BC6;&#x522B;&#x4E3A;&#x5339;&#x914D; SSH &#x7B7E;&#x540D;&#xFF0C;&#x4E5F;&#x5339;&#x914D;&#x66F4;&#x52A0;&#x5177;&#x4F53;&#x7684; OpenSSH &#x7B7E;&#x540D;&#x3002;&#x5C06;&#x670D;&#x52A1;&#x7B7E;&#x540D;&#x548C;&#x670D;&#x52A1;&#x7279;&#x5F81;&#x5C55;&#x793A;&#x5728;&#x4E00;&#x8D77;&#x5F88;&#x6709;&#x610F;&#x4E49;&#x3002;&#x7279;&#x5F81;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>-b</code>&#x9009;&#x9879;&#xFF0C;&#x9644;&#x52A0;&#x5230;&#x548C;&#x6BCF;&#x4E2A;&#x7AEF;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;&#x540E;&#x9762;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# amap 172.16.36.135 1-100 -qb 
amap v5.4 (www.thc.org/thc-amap) started at 2013-12-19 05:32:11 -  APPLICATION MAPPING mode

Protocol on 172.16.36.135:21/tcp matches ftp - banner: 220 (vsFTPd  2.3.4)\r\n530 Please login with USER and PASS.\r\n 
Protocol on 172.16.36.135:22/tcp matches ssh - banner: SSH-2.0- OpenSSH_4.7p1 Debian-8ubuntu1\n 
Protocol on 172.16.36.135:22/tcp matches ssh-openssh - banner:  SSH-2.0-OpenSSH_4.7p1 Debian-8ubuntu1\n 
Protocol on 172.16.36.135:25/tcp matches smtp - banner: 220  metasploitable.localdomain ESMTP Postfix (Ubuntu)\r\n221 2.7.0  Error I can break rules, too. Goodbye.\r\n 
Protocol on 172.16.36.135:23/tcp matches telnet - banner:  #&apos;
Protocol on 172.16.36.135:80/tcp matches http - banner: HTTP/1.1  200 OK\r\nDate Sat, 26 Oct 2013 014818 GMT\r\nServer Apache/2.2.8  (Ubuntu) DAV/2\r\nX-Powered-By PHP/5.2.4-2ubuntu5.10\r\nContent- Length 891\r\nConnection close\r\nContent-Type  text/html\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;title&gt;Metasploitable2 -  Linux&lt;/title&gt;&lt; 
Protocol on 172.16.36.135:80/tcp matches http-apache-2 - banner:  HTTP/1.1 200 OK\r\nDate Sat, 26 Oct 2013 014818 GMT\r\nServer  Apache/2.2.8 (Ubuntu) DAV/2\r\nX-Powered-By PHP/5.2.4- 2ubuntu5.10\r\nContent-Length 891\r\nConnection close\r\nContent- Type text/html\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;title&gt;Metasploitable2 -  Linux&lt;/title&gt;&lt; 
Protocol on 172.16.36.135:53/tcp matches dns - banner: \f

amap v5.4 finished at 2013-12-19 05:32:23
</code></pre><p>&#x670D;&#x52A1;&#x8BC6;&#x522B;&#x4F1A;&#x626B;&#x63CF;&#x5927;&#x91CF;&#x7AEF;&#x53E3;&#x6216;&#x8005;&#x5728;&#x591A;&#x6709; 65536 &#x4E2A;&#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x590D;&#x6742;&#x7684;&#x626B;&#x63CF;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x4E0A;&#x90FD;&#x63A2;&#x6D4B;&#x4E86;&#x6BCF;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x7B7E;&#x540D;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x3002;&#x4E3A;&#x4E86;&#x589E;&#x52A0;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#x626B;&#x63CF;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>-1</code>&#x53C2;&#x6570;&#xFF0C;&#x5728;&#x5339;&#x914D;&#x5230;&#x7279;&#x5B9A;&#x7279;&#x6027;&#x7B7E;&#x540D;&#x4E4B;&#x540E;&#x53D6;&#x6D88;&#x7279;&#x5B9A;&#x670D;&#x52A1;&#x7684;&#x5206;&#x6790;&#x3002;</p>
<pre><code>root@KaliLinux:~# amap 172.16.36.135 1-100 -q1 
amap v5.4 (www.thc.org/thc-amap) started at 2013-12-19 05:33:16 -  APPLICATION MAPPING mode

Protocol on 172.16.36.135:21/tcp matches ftp 
Protocol on 172.16.36.135:22/tcp matches ssh 
Protocol on 172.16.36.135:25/tcp matches smtp 
Protocol on 172.16.36.135:23/tcp matches telnet 
Protocol on 172.16.36.135:80/tcp matches http 
Protocol on 172.16.36.135:80/tcp matches http-apache-2 
Protocol on 172.16.36.135:53/tcp matches dns

amap v5.4 finished at 2013-12-19 05:33:16
</code></pre><p>Amap &#x670D;&#x52A1;&#x8BC6;&#x522B;&#x7684;&#x5E95;&#x5C42;&#x539F;&#x7406;&#x548C; Nmap &#x76F8;&#x4F3C;&#x3002;&#x5B83;&#x6CE8;&#x5165;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x63A2;&#x6D4B;&#x8BF7;&#x6C42;&#xFF0C;&#x6765;&#x5C1D;&#x8BD5;&#x8BF7;&#x6C42;&#x552F;&#x4E00;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8BC6;&#x522B;&#x8FD0;&#x884C;&#x5728;&#x7279;&#x5B9A;&#x7AEF;&#x53E3;&#x7684;&#x8F6F;&#x4EF6;&#x7684;&#x7248;&#x672C;&#x548C;&#x670D;&#x52A1;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x867D;&#x7136; Amap &#x662F;&#x4E2A;&#x670D;&#x52A1;&#x8BC6;&#x522B;&#x7684;&#x66FF;&#x4EE3;&#x9009;&#x9879;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x50CF; Nmap &#x90A3;&#x6837;&#x4FDD;&#x6301;&#x66F4;&#x65B0;&#x548C;&#x62E5;&#x6709;&#x826F;&#x597D;&#x7EF4;&#x62A4;&#x3002;&#x6240;&#x4EE5;&#xFF0C;Amap &#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x53EF;&#x9760;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<h2 id="48-scapy-&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;">4.8 Scapy &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;</h2>
<p>&#x7531;&#x5F88;&#x591A;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5C1D;&#x8BD5;&#x8BC6;&#x522B;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6216;&#x5176;&#x5B83;&#x8BBE;&#x5907;&#x7684;&#x6307;&#x7EB9;&#x3002;&#x9AD8;&#x6548;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#x529F;&#x80FD;&#x975E;&#x5E38;&#x5065;&#x58EE;&#x5E76;&#x4E14;&#x4F1A;&#x4F7F;&#x7528;&#x5927;&#x91CF;&#x7684;&#x6280;&#x672F;&#x4F5C;&#x4E3A;&#x5206;&#x6790;&#x56E0;&#x7D20;&#x3002;Scapy &#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x72EC;&#x7ACB;&#x5206;&#x6790;&#x4EFB;&#x4F55;&#x6B64;&#x7C7B;&#x56E0;&#x7D20;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x68C0;&#x6D4B;&#x8FD4;&#x56DE;&#x7684; TTL &#x503C;&#xFF0C;&#x4F7F;&#x7528; Scapy &#x6267;&#x884C; OS &#x8BC6;&#x522B;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Scapy &#x6765;&#x8BC6;&#x522B; TTL &#x54CD;&#x5E94;&#x4E2D;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C; Linux/Unix &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x8FD0;&#x884C; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528; Metasploitable2 &#x548C; Windows XP&#x3002;&#x5728;&#x672C;&#x5730;&#x5B9E;&#x9A8C;&#x73AF;&#x5883;&#x4E2D;&#x914D;&#x7F6E;&#x7CFB;&#x7EDF;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x548C;&#x201C;&#x5B89;&#x88C5; Windows Server&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E00;&#x8282;&#x4E5F;&#x9700;&#x8981;&#x7F16;&#x5199;&#x811A;&#x672C;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668; VIM &#x548C; Nano&#x201D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>Windows &#x548C; Linux/Unix &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x62E5;&#x6709;&#x4E0D;&#x540C;&#x7684; TTL &#x9ED8;&#x8BA4;&#x8D77;&#x59CB;&#x503C;&#x3002;&#x8FD9;&#x4E2A;&#x56E0;&#x7D20;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5C1D;&#x8BD5;&#x8BC6;&#x522B;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6307;&#x7EB9;&#x3002;&#x8FD9;&#x4E9B;&#x503C;&#x5982;&#x4E0B;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;</th>
<th>TTL &#x8D77;&#x59CB;&#x503C;</th>
</tr>
</thead>
<tbody>
<tr>
<td>Windows</td>
<td>128</td>
</tr>
<tr>
<td>Linux/Unix</td>
<td>64</td>
</tr>
</tbody>
</table>
<p>&#x4E00;&#x4E9B;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4F1A;&#x7684; TTL &#x9ED8;&#x8BA4;&#x8D77;&#x59CB;&#x503C;&#x4E3A; 225 &#x3002;&#x4F46;&#x662F;&#xFF0C;&#x51FA;&#x4E8E;&#x7B80;&#x5355;&#x6027;&#x8003;&#x8651;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x4F7F;&#x7528;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x503C;&#x4F5C;&#x4E3A;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x7684;&#x524D;&#x63D0;&#x3002;&#x4E3A;&#x4E86;&#x5206;&#x6790;&#x6765;&#x81EA;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684;&#x54CD;&#x5E94;&#x4E2D;&#x7684; TTL&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528; ICMP &#x56DE;&#x54CD;&#x8BF7;&#x6C42;&#x3002;&#x4E3A;&#x4E86;&#x53D1;&#x9001; ICMP&#x8BF7;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x7684;&#x5C42;&#x7EA7;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x9996;&#x5148;&#x6784;&#x5EFA;&#x7684;&#x662F; IP &#x5C42;&#x3002;</p>
<pre><code>root@KaliLinux:~# scapy Welcome to Scapy (2.2.0) &gt;&gt;&gt; linux = &quot;172.16.36.135&quot;

&gt;&gt;&gt; windows = &quot;172.16.36.134&quot; 
&gt;&gt;&gt; i = IP() 
&gt;&gt;&gt; i.display() 
###[ IP ]###  
    version= 4  
    ihl= None  
    tos= 0x0  
    len= None  
    id= 1  
    flags=   
    frag= 0  
    ttl= 64  
    proto= ip  
    chksum= None  
    src= 127.0.0.1  
    dst= 127.0.0.1  
    \options\ 
&gt;&gt;&gt; i.dst = linux 
&gt;&gt;&gt; i.display() 
###[ IP ]###  
    version= 4  
    ihl= None  
    tos= 0x0  
    len= None  
    id= 1  
    flags=   
    frag= 0  
    ttl= 64  
    proto= ip  
    chksum= None  
    src= 172.16.36.180  
    dst= 172.16.36.135  
    \options\
</code></pre><p>&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x7684; IP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C06;<code>IP</code>&#x5BF9;&#x8C61;&#x8D4B;&#x7ED9;<code>i</code>&#x53D8;&#x91CF;&#x3002;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>display</code>&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x786E;&#x8BA4;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x914D;&#x7F6E;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x53D7;&#x5730;&#x5740;&#x90FD;&#x8BBE;&#x4E3A;&#x56DE;&#x9001;&#x5730;&#x5740;<code>127.0.0.1</code>&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x5176;&#x6539;&#x4E3A;&#x76EE;&#x6807;&#x5730;&#x5740;&#x7684;&#x503C;&#xFF0C;&#x5C06;<code>i.dst</code>&#x6539;&#x4E3A;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x626B;&#x63CF;&#x7684;&#x5730;&#x5740;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x518D;&#x6B21;&#x8C03;&#x7528;<code>display</code>&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E0D;&#x4EC5;&#x4EC5;&#x76EE;&#x6807;&#x5730;&#x5740;&#x88AB;&#x66F4;&#x65B0;&#xFF0C;Scapy &#x4E5F;&#x4F1A;&#x5C06;&#x6E90; IP &#x5730;&#x5740;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x4E3A;&#x4F55;&#x9ED8;&#x8BA4;&#x63A5;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x5730;&#x5740;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6210;&#x529F;&#x6784;&#x9020;&#x4E86;&#x8BF7;&#x6C42;&#x7684; IP &#x5C42;&#x3002;&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x4E86;&#x8BF7;&#x6C42;&#x7684; IP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5F00;&#x59CB;&#x6784;&#x5EFA; ICMP &#x5C42;&#x4E86;&#x3002;</p>
<pre><code>&gt;&gt;&gt; ping = ICMP() 
&gt;&gt;&gt; ping.display() 
###[ ICMP ]###  
    type= echo-request  
    code= 0  
    chksum= None  
    id= 0x0  
    seq= 0x0
</code></pre><p>&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x7684; ICMP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x4F7F;&#x7528;&#x548C; IP &#x5C42;&#x76F8;&#x540C;&#x7684;&#x6280;&#x5DE7;&#x3002;&#x5728;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>ICMP</code>&#x5BF9;&#x8C61;&#x8D4B;&#x7ED9;&#x4E86;<code>ping</code>&#x904D;&#x5386;&#x3002;&#x50CF;&#x4E4B;&#x524D;&#x90A3;&#x6837;&#xFF0C;&#x9ED8;&#x8BA4;&#x7684;&#x914D;&#x7F6E;&#x53EF;&#x4EE5;&#x7528;&#x8FC7;&#x8C03;&#x7528;<code>dispaly</code>&#x51FD;&#x6570;&#x6765;&#x786E;&#x8BA4;&#x3002;&#x901A;&#x5E38; ICMP &#x7C7B;&#x578B;&#x5DF2;&#x7ECF;&#x8BBE;&#x4E3A;&#x4E86;<code>echo-request</code>&#x3002;&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86; IP &#x548C; ICMP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x53E0;&#x653E;&#x8FD9;&#x4E9B;&#x5C42;&#x6765;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x3002;</p>
<pre><code>&gt;&gt;&gt; request = (i/ping) 
&gt;&gt;&gt; request.display() 
###[ IP ]###  
    version= 4  
    ihl= None  
    tos= 0x0  
    len= None  
    id= 1  
    flags=   
    frag= 0  
    ttl= 64  
    proto= icmp  
    chksum= None  
    src= 172.16.36.180  
    dst= 172.16.36.135  
    \options\ 
###[ ICMP ]###     
    type= echo-request     
    code= 0     
    chksum= None     
    id= 0x0     
    seq= 0x0
</code></pre><p>IP &#x548C; ICMP &#x5C42;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x659C;&#x6760;&#x5206;&#x9694;&#x904D;&#x5386;&#x6765;&#x53E0;&#x653E;&#x3002;&#x8FD9;&#x4E9B;&#x5C42;&#x53EF;&#x4EE5;&#x8D4B;&#x7ED9;&#x65B0;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x6211;&#x4EEC;&#x6574;&#x4E2A;&#x8BF7;&#x6C42;&#x3002;<code>display</code>&#x51FD;&#x6570;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x6765;&#x67E5;&#x770B;&#x8BF7;&#x6C42;&#x914D;&#x7F6E;&#x3002;&#x4E00;&#x65E6;&#x8BF7;&#x6C42;&#x6784;&#x5EFA;&#x5B8C;&#x6BD5;&#xFF0C;&#x6211;&#x4E48;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;<code>sr1</code>&#x51FD;&#x6570;&#xFF0C;&#x4EE5;&#x4FBF;&#x5206;&#x6790;&#x54CD;&#x5E94;&#x3002;</p>
<pre><code>&gt;&gt;&gt; ans = sr1(request) 
Begin emission: 
....................Finished to send 1 packets. 
....* 
Received 25 packets, got 1 answers, remaining 0 packets 
&gt;&gt;&gt; ans.display() 
###[ IP ]###  
    version= 4L  
    ihl= 5L  
    tos= 0x0  
    len= 28  
    id= 64067  
    flags=   
    frag= 0L  
    ttl= 64  
    proto= icmp  
    chksum= 0xdf41  
    src= 172.16.36.135  
    dst= 172.16.36.180  
    \options\ 
###[ ICMP ]###     
    type= echo-reply     
    code= 0     
    chksum= 0xffff     
    id= 0x0     
    seq= 0x0 
###[ Padding ]###        
    load=  &apos;\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\ x00\x00&apos;
</code></pre><p>&#x76F8;&#x540C;&#x7684;&#x8BF7;&#x6C42;&#x53EF;&#x4EE5;&#x4E0D;&#x901A;&#x8FC7;&#x72EC;&#x7ACB;&#x6784;&#x5EFA;&#x548C;&#x53E0;&#x653E;&#x6BCF;&#x4E00;&#x5C42;&#x6765;&#x6784;&#x5EFA;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5355;&#x884C;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x901A;&#x8FC7;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x5E76;&#x4F20;&#x9012;&#x5408;&#x9002;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code>&gt;&gt;&gt; ans = sr1(IP(dst=linux)/ICMP()) 
.Begin emission: 
...*Finished to send 1 packets.

Received 5 packets, got 1 answers, remaining 0 packets 
&gt;&gt;&gt; ans 
&lt;IP  version=4L ihl=5L tos=0x0 len=28 id=64068 flags= frag=0L  ttl=64 proto=icmp chksum=0xdf40 src=172.16.36.135  dst=172.16.36.180 options=[] |&lt;ICMP  type=echo-reply code=0  chksum=0xffff id=0x0 seq=0x0 |&lt;Padding   load=&apos;\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00 \x00\x00\x00&apos; |&gt;&gt;&gt;
</code></pre><p>&#x8981;&#x6CE8;&#x610F;&#x6765;&#x81EA; Linux &#x7CFB;&#x7EDF;&#x7684;&#x54CD;&#x5E94;&#x7684; TTL &#x503C;&#x4E3A; 64&#x3002;&#x540C;&#x4E00;&#x6D4B;&#x8BD5;&#x53EF;&#x4EE5;&#x5BF9; Windows &#x7CFB;&#x7EDF;&#x7684; IP &#x5730;&#x5740;&#x6267;&#x884C;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x5230;&#x54CD;&#x5E94;&#x4E2D; TTL &#x503C;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<pre><code>&gt;&gt;&gt; ans = sr1(IP(dst=windows)/ICMP()) 
.Begin emission: 
......Finished to send 1 packets. 
....* 
Received 12 packets, got 1 answers, remaining 0 packets 
&gt;&gt;&gt; ans 
&lt;IP  version=4L ihl=5L tos=0x0 len=28 id=24714 flags= frag=0L  ttl=128 proto=icmp chksum=0x38fc src=172.16.36.134  dst=172.16.36.180 options=[] |&lt;ICMP  type=echo-reply code=0  chksum=0xffff id=0x0 seq=0x0 |&lt;Padding   load=&apos;\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00 \x00\x00\x00&apos; |&gt;&gt;&gt;
</code></pre><p>&#x8981;&#x6CE8;&#x610F;&#x7531; Windows &#x7CFB;&#x7EDF;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x7684; TTL &#x4E3A; 128&#x3002;&#x8FD9;&#x4E2A;&#x54CD;&#x5E94;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x5728; Python &#x4E2D;&#x6D4B;&#x8BD5;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# python Python 2.7.3 (default, Jan  2 2013, 16:53:07) 
[GCC 4.7.2] on linux2 
Type &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more  information. 
&gt;&gt;&gt; from scapy.all import *
WARNING: No route found for IPv6 destination :: (no default  route?) 
&gt;&gt;&gt; ans = sr1(IP(dst=&quot;172.16.36.135&quot;)/ICMP()) 
.Begin emission: 
............Finished to send 1 packets. 
....* 
Received 18 packets, got 1 answers, remaining 0 packets 
&gt;&gt;&gt; if int(ans[IP].ttl) &lt;= 64: 
...     print &quot;Host is Linux&quot; 
... else: 
...     print &quot;Host is Windows&quot; 
... Host is Linux 
&gt;&gt;&gt; ans = sr1(IP(dst=&quot;172.16.36.134&quot;)/ICMP()) 
.Begin emission: 
.......Finished to send 1 packets. 
....* 
Received 13 packets, got 1 answers, remaining 0 packets 
&gt;&gt;&gt; if int(ans[IP].ttl) &lt;= 64: 
...     print &quot;Host is Linux&quot; 
... else: 
...     print &quot;Host is Windows&quot; 
... Host is Windows
</code></pre><p>&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x76F8;&#x540C;&#x8BF7;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x6D4B;&#x8BD5; TTL &#x503C;&#x7684;&#x76F8;&#x7B49;&#x6027;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E; 64&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5047;&#x8BBE;&#x8BBE;&#x5907;&#x8FD0;&#x884C; Linux/Unix &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x5982;&#x679C;&#x503C;&#x5927;&#x4E8E; 64&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5047;&#x8BBE;&#x8BBE;&#x5907;&#x53EF;&#x80FD;&#x8FD0;&#x884C; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Python &#x53EF;&#x6267;&#x884C;&#x811A;&#x672C;&#x6765;&#x81EA;&#x52A8;&#x5316;&#xFF1A;</p>
<pre><code class="lang-py"><span class="hljs-comment">#!/usr/bin/python</span>

<span class="hljs-keyword">from</span> scapy.all 
<span class="hljs-keyword">import</span> * <span class="hljs-keyword">import</span> logging 
logging.getLogger(<span class="hljs-string">&quot;scapy.runtime&quot;</span>).setLevel(logging.ERROR) 
<span class="hljs-keyword">import</span> sys

<span class="hljs-keyword">if</span> len(sys.argv) != <span class="hljs-number">2</span>:   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Usage - ./ttl_id.py [IP Address]&quot;</span>   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Example - ./ttl_id.py 10.0.0.5&quot;</span>
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Example will perform ttl analysis to attempt to determine     whether the system is Windows or Linux/Unix&quot;</span>   
    sys.exit()

ip = sys.argv[<span class="hljs-number">1</span>]

ans = sr1(IP(dst=str(ip))/ICMP(),timeout=<span class="hljs-number">1</span>,verbose=<span class="hljs-number">0</span>) 
<span class="hljs-keyword">if</span> ans == <span class="hljs-keyword">None</span>:   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;No response was returned&quot;</span> 
<span class="hljs-keyword">elif</span> int(ans[IP].ttl) &lt;= <span class="hljs-number">64</span>:   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Host is Linux/Unix&quot;</span> 
<span class="hljs-keyword">else</span>:   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Host is Windows&quot;</span>
</code></pre>
<p>&#x8FD9;&#x4E2A; Python &#x811A;&#x672C;&#x63A5;&#x53D7;&#x5355;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x7531;&#x88AB;&#x626B;&#x63CF;&#x7684; IP &#x5730;&#x5740;&#x7EC4;&#x6210;&#x3002;&#x57FA;&#x4E8E;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x4E2D;&#x7684; TTL&#xFF0C;&#x811A;&#x672C;&#x4F1A;&#x731C;&#x6D4B;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;<code>chmod</code>&#x4FEE;&#x6539;&#x6587;&#x4EF6;&#x8BB8;&#x53EF;&#xFF0C;&#x5E76;&#x4E14;&#x76F4;&#x63A5;&#x4ECE;&#x6240;&#x5728;&#x76EE;&#x6807;&#x8C03;&#x7528;&#x6765;&#x6267;&#x884C;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# chmod 777 ttl_id.py 
root@KaliLinux:~# ./ttl_id.py 
Usage - ./ttl_id.py [IP Address] 
Example - ./ttl_id.py 10.0.0.5 
Example will perform ttl analysis to attempt to determine whether the  system is Windows or Linux/Unix 
root@KaliLinux:~# ./ttl_id.py 172.16.36.134 Host is Windows 
root@KaliLinux:~# ./ttl_id.py 172.16.36.135 Host is Linux/Unix
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x7684; TTL &#x8D77;&#x59CB;&#x503C;&#x901A;&#x5E38;&#x4E3A; 128&#xFF0C;&#x7136;&#x800C; Linux/Unix &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E3A; 64&#x3002;&#x901A;&#x8FC7;&#x5047;&#x8BBE;&#x4E0D;&#x9AD8;&#x4E8E; 64 &#x5E94;&#x8BE5;&#x4E3A;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x5047;&#x8BBE; Windows &#x7CFB;&#x7EDF;&#x7684;&#x56DE;&#x590D;&#x4E2D; TTL &#x4E3A; 65 &#x5230; 128&#xFF0C;&#x800C; Linux/Unix &#x7CFB;&#x7EDF;&#x7684;&#x56DE;&#x590D;&#x4E2D; TTL &#x4E3A; 1 &#x5230; 64&#x3002;&#x5F53;&#x626B;&#x63CF;&#x7CFB;&#x7EDF;&#x548C;&#x8FDC;&#x7A0B;&#x76EE;&#x6807;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x8BBE;&#x5907;&#xFF0C;&#x5E76;&#x4E14;&#x8BBE;&#x5907;&#x62E6;&#x622A;&#x8BF7;&#x6C42;&#x5E76;&#x91CD;&#x65B0;&#x5C01;&#x5305;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BC6;&#x522B;&#x65B9;&#x5F0F;&#x5C31;&#x4F1A;&#x5931;&#x6548;&#x3002;</p>
<h2 id="49-nmap-&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;">4.9 Nmap &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;</h2>
<p>&#x867D;&#x7136; TTL &#x5206;&#x6790;&#x6709;&#x52A9;&#x4E8E;&#x8BC6;&#x522B;&#x8FDC;&#x7A0B;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x91C7;&#x7528;&#x66F4;&#x590D;&#x6742;&#x7684;&#x89E3;&#x6CD5;&#x4E5F;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;Nmap &#x62E5;&#x6709;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#x529F;&#x80FD;&#xFF0C;&#x5B83;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x7B80;&#x5355;&#x7684; TTL &#x5206;&#x6790;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C;&#x57FA;&#x4E8E;&#x63A2;&#x6D4B;&#x54CD;&#x5E94;&#x5206;&#x6790;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Nmap &#x6765;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C; Linux/Unix &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x8FD0;&#x884C; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528; Metasploitable2 &#x548C; Windows XP&#x3002;&#x5728;&#x672C;&#x5730;&#x5B9E;&#x9A8C;&#x73AF;&#x5883;&#x4E2D;&#x914D;&#x7F6E;&#x7CFB;&#x7EDF;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x548C;&#x201C;&#x5B89;&#x88C5; Windows Server&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E3A;&#x4E86;&#x6267;&#x884C; Nmap &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#xFF0C;Nmap &#x5E94;&#x8BE5;&#x4F7F;&#x7528;<code>-o</code>&#x9009;&#x9879;&#x5E76;&#x6307;&#x5B9A; IP &#x5730;&#x5740;&#x6765;&#x8C03;&#x7528;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# nmap 172.16.36.134 -O

Starting Nmap 6.25 ( http://nmap.org ) at 2013-12-19 10:59 EST
Nmap scan report for 172.16.36.134 
Host is up (0.00044s latency). 
Not shown: 991 closed ports 
PORT      STATE SERVICE 
22/tcp    open  ssh 
135/tcp   open  msrpc 
139/tcp   open  netbios-ssn 
445/tcp   open  microsoft-ds 
4444/tcp  open  krb524 
8080/tcp  open  http-proxy 
8081/tcp  open  blackice-icecap 
15003/tcp open  unknown 
15004/tcp open  unknown 
MAC Address: 00:0C:29:18:11:FB (VMware) Device type: general purpose 
Running: Microsoft Windows XP|2003
OS CPE: cpe:/o:microsoft:windows_xp::sp2:professional  cpe:/o:microsoft:windows_server_2003 
OS details: Microsoft Windows XP Professional SP2 or Windows  Server 2003 Network Distance: 1 hop

OS detection performed. Please report any incorrect results at  http://nmap.org/submit/ . 
Nmap done: 1 IP address (1 host up) scanned in 15.67 seconds
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x8F93;&#x51FA;&#x4E2D;&#xFF0C;Nmap &#x4F1A;&#x8868;&#x660E;&#x8FD0;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6216;&#x53EF;&#x80FD;&#x63D0;&#x4F9B;&#x4E00;&#x5217;&#x53EF;&#x80FD;&#x8FD0;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;Nmap &#x8868;&#x660E;&#x8FDC;&#x7A0B;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x662F; Windows XP &#x6216;&#x8005; Server 2003&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Nmap &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#x4F1A;&#x53D1;&#x9001;&#x4E00;&#x7CFB;&#x5217;&#x590D;&#x6742;&#x7684;&#x63A2;&#x6D4B;&#x8BF7;&#x6C42;&#xFF0C;&#x4E4B;&#x540E;&#x5206;&#x6790;&#x8FD9;&#x4E9B;&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x6765;&#x5C1D;&#x8BD5;&#x57FA;&#x4E8E; OS &#x7279;&#x5B9A;&#x7684;&#x7B7E;&#x540D;&#x548C;&#x9884;&#x671F;&#x884C;&#x4E3A;&#x8BC6;&#x522B;&#x5E95;&#x5C42;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x662F;&#x88AB;&#x7684;&#x8F93;&#x51FA;&#x5E95;&#x90E8;&#x770B;&#x5230;&#xFF0C;Nmap &#x4F9D;&#x8D56;&#x4E8E;&#x7528;&#x6237;&#x7684;&#x53CD;&#x9988;&#xFF0C;&#x4EE5;&#x4FBF;&#x786E;&#x4FDD;&#x670D;&#x52A1;&#x7B7E;&#x540D;&#x4FDD;&#x6301;&#x53EF;&#x9760;&#x3002;</p>
<h2 id="410-xprobe2-&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;">4.10 xProbe2 &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;</h2>
<p>xProbe2 &#x662F;&#x4E2A;&#x7528;&#x4E8E;&#x8BC6;&#x522B;&#x8FDC;&#x7A0B;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x5DE5;&#x5177;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; xProbe2 &#x57FA;&#x4E8E;&#x63A2;&#x6D4B;&#x54CD;&#x5E94;&#x5206;&#x6790;&#x6765;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; xProbe2 &#x6765;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C; Linux/Unix &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x8FD0;&#x884C; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528; Metasploitable2 &#x548C; Windows XP&#x3002;&#x5728;&#x672C;&#x5730;&#x5B9E;&#x9A8C;&#x73AF;&#x5883;&#x4E2D;&#x914D;&#x7F6E;&#x7CFB;&#x7EDF;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x548C;&#x201C;&#x5B89;&#x88C5; Windows Server&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; xProbe2 &#x5BF9;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x4E0A;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x662F;&#x88AB;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x5355;&#x4E2A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x7ED9;&#x7A0B;&#x5E8F;&#xFF0C;&#x5305;&#x542B;&#x88AB;&#x626B;&#x63CF;&#x7CFB;&#x7EDF;&#x7684; IP &#x5730;&#x5740;&#x3002;</p>
<pre><code>root@KaliLinux:~# xprobe2 172.16.36.135
Xprobe2 v.0.3 Copyright (c) 2002-2005 fyodor@o0o.nu, ofir@sys- security.com, meder@o0o.nu

[+] Target is 172.16.36.135 
[+] Loading modules. 
[+] Following modules are loaded: 
[x] [1] ping:icmp_ping  -  ICMP echo discovery module 
[x] [2] ping:tcp_ping  -  TCP-based ping discovery module 
[x] [3] ping:udp_ping  -  UDP-based ping discovery module 
[x] [4] infogather:ttl_calc  -  TCP and UDP based TTL distance  calculation 
[x] [5] infogather:portscan  -  TCP and UDP PortScanner 
[x] [6] fingerprint:icmp_echo  -  ICMP Echo request fingerprinting  module 
[x] [7] fingerprint:icmp_tstamp  -  ICMP Timestamp request  fingerprinting module 
[x] [8] fingerprint:icmp_amask  -  ICMP Address mask request  fingerprinting module 
[x] [9] fingerprint:icmp_port_unreach  -  ICMP port unreachable  fingerprinting module 
[x] [10] fingerprint:tcp_hshake  -  TCP Handshake fingerprinting  module 
[x] [11] fingerprint:tcp_rst  -  TCP RST fingerprinting module 
[x] [12] fingerprint:smb  -  SMB fingerprinting module 
[x] [13] fingerprint:snmp  -  SNMPv2c fingerprinting module 
[+] 13 modules registered 
[+] Initializing scan engine 
[+] Running scan engine 
[-] ping:tcp_ping module: no closed/open TCP ports known on  172.16.36.135. Module test failed 
[-] ping:udp_ping module: no closed/open UDP ports known on  172.16.36.135. Module test failed
[-] No distance calculation. 172.16.36.135 appears to be dead or no  ports known 
[+] Host: 172.16.36.135 is up (Guess probability: 50%) 
[+] Target: 172.16.36.135 is alive. Round-Trip Time: 0.00112 sec 
[+] Selected safe Round-Trip Time value is: 0.00225 sec 
[-] fingerprint:tcp_hshake Module execution aborted (no open TCP ports known) 
[-] fingerprint:smb need either TCP port 139 or 445 to run 
[-] fingerprint:snmp: need UDP port 161 open 
[+] Primary guess: 
[+] Host 172.16.36.135 Running OS: &quot;Linux Kernel 2.4.22&quot; (Guess  probability: 100%) 
[+] Other guesses: 
[+] Host 172.16.36.135 Running OS: &quot;Linux Kernel 2.4.23&quot; (Guess  probability: 100%) 
[+] Host 172.16.36.135 Running OS: &quot;Linux Kernel 2.4.21&quot; (Guess  probability: 100%) 
[+] Host 172.16.36.135 Running OS: &quot;Linux Kernel 2.4.20&quot; (Guess  probability: 100%) 
[+] Host 172.16.36.135 Running OS: &quot;Linux Kernel 2.4.19&quot; (Guess  probability: 100%) 
[+] Host 172.16.36.135 Running OS: &quot;Linux Kernel 2.4.24&quot; (Guess  probability: 100%) 
[+] Host 172.16.36.135 Running OS: &quot;Linux Kernel 2.4.25&quot; (Guess  probability: 100%) 
[+] Host 172.16.36.135 Running OS: &quot;Linux Kernel 2.4.26&quot; (Guess  probability: 100%) 
[+] Host 172.16.36.135 Running OS: &quot;Linux Kernel 2.4.27&quot; (Guess  probability: 100%) 
[+] Host 172.16.36.135 Running OS: &quot;Linux Kernel 2.4.28&quot; (Guess  probability: 100%) 
[+] Cleaning up scan engine 
[+] Modules deinitialized 
[+] Execution completed.
</code></pre><p>&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x7684;&#x8F93;&#x51FA;&#x6709;&#x4E9B;&#x8BEF;&#x5BFC;&#x6027;&#x3002;&#x8F93;&#x51FA;&#x4E2D;&#x6709;&#x597D;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684; Linux &#x5185;&#x6838;&#xFF0C;&#x8868;&#x660E;&#x7279;&#x5B9A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6982;&#x7387;&#x4E3A; 100%&#x3002;&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x5BF9;&#x7684;&#x3002;xProbe2 &#x5B9E;&#x9645;&#x4E0A;&#x57FA;&#x4E8E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x76F8;&#x5173;&#x7684;&#x7B7E;&#x540D;&#x7684;&#x767E;&#x5206;&#x6BD4;&#xFF0C;&#x8FD9;&#x4E9B;&#x7B7E;&#x540D;&#x5728;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x4E0A;&#x88AB;&#x9A8C;&#x8BC1;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x8F93;&#x51FA;&#x4E2D;&#x770B;&#x51FA;&#xFF0C;&#x7B7E;&#x540D;&#x5BF9;&#x4E8E;&#x5206;&#x8FA8;&#x5C0F;&#x7248;&#x672C;&#x5E76;&#x4E0D;&#x8DB3;&#x591F;&#x7EC6;&#x81F4;&#x3002;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#xFF0C;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x5728;&#x8BC6;&#x522B;&#x76EE;&#x6807;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x90FD;&#x662F;&#x4E2A;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x989D;&#x5916;&#x8D44;&#x6E90;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>xProbe2 &#x670D;&#x52A1;&#x8BC6;&#x522B;&#x7684;&#x5E95;&#x5C42;&#x539F;&#x7406;&#x548C; Nmap &#x76F8;&#x4F3C;&#x3002;xProbe2 &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#x4F1A;&#x53D1;&#x9001;&#x4E00;&#x7CFB;&#x5217;&#x590D;&#x6742;&#x7684;&#x63A2;&#x6D4B;&#x8BF7;&#x6C42;&#xFF0C;&#x4E4B;&#x540E;&#x5206;&#x6790;&#x8FD9;&#x4E9B;&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x6765;&#x5C1D;&#x8BD5;&#x57FA;&#x4E8E; OS &#x7279;&#x5B9A;&#x7684;&#x7B7E;&#x540D;&#x548C;&#x9884;&#x671F;&#x884C;&#x4E3A;&#x8BC6;&#x522B;&#x5E95;&#x5C42;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;</p>
<h2 id="411-p0f-&#x88AB;&#x52A8;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;">4.11 p0f &#x88AB;&#x52A8;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;</h2>
<p>p0f &#x662F;&#x4E2A;&#x7528;&#x4E8E;&#x8BC6;&#x522B;&#x8FDC;&#x7A0B;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x5DE5;&#x5177;&#x3002;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x4E0D;&#x540C;&#x4E8E;&#x5176;&#x5B83;&#x5DE5;&#x5177;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E3A;&#x88AB;&#x52A8;&#x8BC6;&#x522B;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x800C;&#x6784;&#x5EFA;&#xFF0C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x4E0E;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684;&#x76F4;&#x63A5;&#x4EA4;&#x4E92;&#x3002;&#x8FD9;&#x4E2A;&#x79D8;&#x7C4D;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; p0f &#x57FA;&#x4E8E;&#x63A2;&#x6D4B;&#x54CD;&#x5E94;&#x5206;&#x6790;&#x6765;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; xProbe2 &#x6765;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x8FD0;&#x884C; Linux/Unix &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x8FD0;&#x884C; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528; Metasploitable2 &#x548C; Windows XP&#x3002;&#x5728;&#x672C;&#x5730;&#x5B9E;&#x9A8C;&#x73AF;&#x5883;&#x4E2D;&#x914D;&#x7F6E;&#x7CFB;&#x7EDF;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Metasploitable2&#x201D;&#x548C;&#x201C;&#x5B89;&#x88C5; Windows Server&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x5982;&#x679C;&#x4F60;&#x76F4;&#x63A5;&#x4ECE;&#x547D;&#x4EE4;&#x884C;&#x6267;&#x884C; p0f&#xFF0C;&#x4E0D;&#x5E26;&#x4EFB;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x73AF;&#x5883;&#x914D;&#x7F6E;&#xFF0C;&#x4F60;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x5B83;&#x4E0D;&#x4F1A;&#x63D0;&#x4F9B;&#x5F88;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x76F4;&#x63A5;&#x548C;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x7CFB;&#x7EDF;&#x4EA4;&#x4E92;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# p0f 
p0f - passive os fingerprinting utility, version 2.0.8 (C) M. Zalewski &lt;lcamtuf@dione.cc&gt;, W. Stearns &lt;wstearns@pobox.com&gt; 
p0f: listening (SYN) on &apos;eth1&apos;, 262 sigs (14 generic, cksum  0F1F5CA2), rule: &apos;all&apos;.
</code></pre><p>&#x4FE1;&#x606F;&#x7684;&#x7F3A;&#x5931;&#x662F;&#x4E00;&#x4E2A;&#x8BC1;&#x636E;&#xFF0C;&#x8868;&#x793A;&#x4E0D;&#x50CF;&#x5176;&#x4ED6;&#x5DE5;&#x5177;&#x90A3;&#x6837;&#xFF0C;p0f &#x5E76;&#x4E0D;&#x4E3B;&#x52A8;&#x63A2;&#x6D4B;&#x8BBE;&#x5907;&#x6765;&#x5C1D;&#x8BD5;&#x5224;&#x65AD;&#x4ED6;&#x4EEC;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x5B83;&#x53EA;&#x4F1A;&#x5B89;&#x9759;&#x5730;&#x76D1;&#x542C;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x901A;&#x8FC7;&#x5728;&#x5355;&#x72EC;&#x7684;&#x7EC8;&#x7AEF;&#x4E2D;&#x8FD0;&#x884C; Nmap &#x626B;&#x63CF;&#x6765;&#x751F;&#x6210;&#x6D41;&#x91CF;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4F1A;&#x7834;&#x574F;&#x88AB;&#x52A8; OS &#x8BC6;&#x522B;&#x7684;&#x6574;&#x4E2A;&#x76EE;&#x7684;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x60F3;&#x51FA;&#x4E00;&#x4E2A;&#x65B9;&#x5F0F;&#xFF0C;&#x5C06;&#x6D41;&#x91CF;&#x91CD;&#x5B9A;&#x5411;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x672C;&#x5730;&#x754C;&#x9762;&#x6765;&#x5206;&#x6790;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x88AB;&#x52A8;&#x5206;&#x6790;&#x5B83;&#x4EEC;&#x3002;</p>
<p>Ettercap &#x4E3A;&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x6770;&#x51FA;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x6BD2;&#x5316; ARP &#x7F13;&#x5B58;&#x5E76;&#x521B;&#x5EFA; MITM &#x573A;&#x666F;&#x7684;&#x80FD;&#x529B;&#x3002;&#x4E3A;&#x4E86;&#x8BA9;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x6D41;&#x91CF;&#x7ECF;&#x8FC7;&#x6211;&#x4EEC;&#x7684;&#x672C;&#x5730;&#x754C;&#x9762;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5BF9;&#x6BCF;&#x4E2A;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C; ARP &#x6BD2;&#x5316;&#x3002;</p>
<pre><code>root@KaliLinux:~# ettercap -M arp:remote /172.16.36.1/  /172.16.36.135/ -T -w dump

ettercap NG-0.7.4.2 copyright 2001-2005 ALoR &amp; NaGA

Listening on eth1... (Ethernet)

  eth1 -&gt;  00:0C:29:09:C3:79     172.16.36.180     255.255.255.0

SSL dissection needs a valid &apos;redir_command_on&apos; script in the  etter.conf file 
Privileges dropped to UID 65534 GID 65534...

  28 plugins  
  41 protocol dissectors 
  56 ports monitored 
  7587 mac vendor fingerprint
  1766 tcp OS fingerprint 
  2183 known services

Scanning for merged targets (2 hosts)...

* |==================================================&gt;| 100.00 %

2 hosts added to the hosts list...

ARP poisoning victims:

 GROUP 1 : 172.16.36.1 00:50:56:C0:00:08

 GROUP 2 : 172.16.36.135 00:0C:29:3D:84:32 
Starting Unified sniffing...

Text only Interface activated... 
Hit &apos;h&apos; for inline help
</code></pre><p>&#x5728;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;Ettercap &#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x6267;&#x884C;&#x3002;<code>-M</code>&#x9009;&#x9879;&#x5B9A;&#x4E49;&#x4E86;&#x7531;<code>arp:remote</code>&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x8868;&#x660E;&#x4F1A;&#x6267;&#x884C; ARP &#x6BD2;&#x5316;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x55C5;&#x63A2;&#x6765;&#x81EA;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684;&#x6D41;&#x91CF;&#x3002;&#x5F00;&#x59CB;&#x548C;&#x95ED;&#x5408;&#x659C;&#x6760;&#x4E4B;&#x95F4;&#x7684; IP &#x5730;&#x5740;&#x8868;&#x793A;&#x88AB;&#x6BD2;&#x5316;&#x7684;&#x7CFB;&#x7EDF;&#x3002;<code>-T</code>&#x9009;&#x9879;&#x8868;&#x660E;&#x64CD;&#x4F5C;&#x4F1A;&#x6267;&#x884C;&#x5728;&#x6574;&#x4E2A;&#x6587;&#x672C;&#x754C;&#x9762;&#x4E0A;&#xFF0C;<code>-w</code>&#x9009;&#x9879;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x7528;&#x4E8E;&#x8F6C;&#x50A8;&#x6D41;&#x91CF;&#x6355;&#x83B7;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x7B80;&#x5386;&#x4E86; MITM&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x5355;&#x72EC;&#x7684;&#x7EC8;&#x7AEF;&#x4E2D;&#x518D;&#x6B21;&#x6267;&#x884C; p0f&#x3002;&#x5047;&#x8BBE;&#x4E24;&#x4E2A;&#x6BD2;&#x5316;&#x4E3B;&#x673A;&#x6B63;&#x5728;&#x901A;&#x4FE1;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x5982;&#x4E0B;&#x6D41;&#x91CF;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# p0f 
p0f - passive os fingerprinting utility, version 2.0.8 (C) M. Zalewski &lt;lcamtuf@dione.cc&gt;, W. Stearns &lt;wstearns@pobox.com&gt; 
p0f: listening (SYN) on &apos;eth1&apos;, 262 sigs (14 generic, cksum  0F1F5CA2), rule: &apos;all&apos;. 
172.16.36.1:42497 - UNKNOWN [S10:64:1:60:M1460,S,T,N,W7:.:?:?] (up:  700 hrs)
   -&gt; 172.16.36.135:22 (link: ethernet/modem) 
172.16.36.1:48172 - UNKNOWN [S10:64:1:60:M1460,S,T,N,W7:.:?:?] (up:  700 hrs)
   -&gt; 172.16.36.135:22 (link: ethernet/modem) 
172.16.36.135:55829 - Linux 2.6 (newer, 1) (up: 199 hrs)
   -&gt; 172.16.36.1:80 (distance 0, link: ethernet/modem) 
172.16.36.1:42499 - UNKNOWN [S10:64:1:60:M1460,S,T,N,W7:.:?:?] (up:  700 hrs)
   -&gt; 172.16.36.135:22 (link: ethernet/modem) 
^C+++ Exiting on signal 2 +++ 
[+] Average packet ratio: 0.91 per minute.
</code></pre><p>&#x6240;&#x6709;&#x7ECF;&#x8FC7; p0f &#x76D1;&#x542C;&#x5668;&#x7684;&#x5C01;&#x5305;&#x4F1A;&#x6807;&#x6CE8;&#x4E3A; UNKOWN &#x6216;&#x8005;&#x548C;&#x7279;&#x5B9A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7B7E;&#x540D;&#x76F8;&#x5173;&#x3002;&#x4E00;&#x65E6;&#x6267;&#x884C;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x8F93;&#x5165;<code>q</code>&#x5173;&#x95ED; Ettercap &#x6587;&#x672C;&#x754C;&#x9762;&#x3002;</p>
<pre><code>Closing text interface...

ARP poisoner deactivated. 
RE-ARPing the victims... 
Unified sniffing was stopped.
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>ARP &#x6BD2;&#x5316;&#x6D89;&#x53CA;&#x4F7F;&#x7528;&#x65E0;&#x6765;&#x7531;&#x7684; ARP &#x54CD;&#x5E94;&#x6765;&#x6B3A;&#x9A97;&#x53D7;&#x5BB3;&#x8005;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F7F;&#x5176;&#x5C06;&#x76EE;&#x6807; IP &#x5730;&#x5740;&#x4E0E; MITM &#x7CFB;&#x7EDF;&#x7684; MAC &#x5730;&#x5740;&#x5173;&#x8054;&#x3002;MITM &#x7CFB;&#x7EDF;&#x5C31;&#x4F1A;&#x6536;&#x5230;&#x88AB;&#x6BD2;&#x5316;&#x7CFB;&#x7EDF;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x5176;&#x8F6C;&#x53D1;&#x7ED9;&#x76EE;&#x6807;&#x63A5;&#x53D7;&#x8005;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x8BA9; MITM &#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x55C5;&#x63A2;&#x6240;&#x6709;&#x6D41;&#x91CF;&#x3002;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x6D41;&#x91CF;&#x4E2D;&#x7684;&#x7279;&#x5B9A;&#x884C;&#x4E3A;&#x548C;&#x7B7E;&#x540D;&#xFF0C;p0f &#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x8BBE;&#x5907;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x76F4;&#x63A5;&#x63A2;&#x6D4B;&#x54CD;&#x5E94;&#x3002;</p>
<h2 id="412-onesixtyone-snmp-&#x5206;&#x6790;">4.12 Onesixtyone SNMP &#x5206;&#x6790;</h2>
<p>Onesixtyone &#x662F;&#x4E2A; SNMP &#x5206;&#x6790;&#x5DE5;&#x5177;&#xFF0C;&#x5728; UDP &#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C; SNMP &#x64CD;&#x4F5C;&#x3002;&#x5B83;&#x662F;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684; snmp &#x626B;&#x63CF;&#x5668;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x6307;&#x5B9A;&#x7684; IP &#x5730;&#x5740;&#xFF0C;&#x4EC5;&#x4EC5;&#x8BF7;&#x6C42;&#x7CFB;&#x7EDF;&#x63CF;&#x8FF0;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Onesixtyone &#x6765;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x5F00;&#x542F; SNMP &#x5E76;&#x53EF;&#x4EE5;&#x63A2;&#x6D4B;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528; Windows XP&#x3002;&#x914D;&#x7F6E; Windows &#x7CFB;&#x7EDF;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Windows Server&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x51C6;&#x786E;&#x8BC6;&#x522B;&#x76EE;&#x6807;&#x8BBE;&#x5907;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6307;&#x7EB9;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Onesixtyone&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x76EE;&#x6807; IP &#x5730;&#x5740;&#x548C;&#x56E2;&#x4F53;&#x5B57;&#x7B26;&#x4E32;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x5165;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# onesixtyone 172.16.36.134 public 
Scanning 1 hosts, 1 communities 
172.16.36.134 [public] Hardware: x86 Family 6 Model 58 Stepping 9  AT/AT COMPATIBLE - Software: Windows 2000 Version 5.1 (Build 2600  Uniprocessor Free)
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x56E2;&#x4F53;&#x5B57;&#x7B26;&#x4E32;<code>public</code>&#x7528;&#x4E8E;&#x67E5;&#x8BE2;<code>172.16.36.134</code>&#x8BBE;&#x5907;&#x7684;&#x7CFB;&#x7EDF;&#x63CF;&#x8FF0;&#x3002;&#x8FD9;&#x662F;&#x591A;&#x79CD;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x5E38;&#x89C1;&#x5B57;&#x7B26;&#x4E32;&#x4E4B;&#x4E00;&#x3002;&#x6B63;&#x5982;&#x8F93;&#x51FA;&#x4E2D;&#x663E;&#x5F0F;&#xFF0C;&#x8FDC;&#x7A0B;&#x4E3B;&#x673A;&#x4F7F;&#x7528;&#x8868;&#x793A;&#x81EA;&#x8EAB;&#x7684;&#x63CF;&#x8FF0;&#x5B57;&#x7B26;&#x4E32;&#x56DE;&#x590D;&#x4E86;&#x67E5;&#x8BE2;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>SNMP &#x662F;&#x4E2A;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#xFF0C;&#x4EE5;&#x53CA;&#x8BBE;&#x5907;&#x95F4;&#x8D21;&#x732E;&#x4FE1;&#x606F;&#x7684;&#x534F;&#x8BAE;&#x3002;&#x8FD9;&#x4E2A;&#x534F;&#x8BAE;&#x7684;&#x7528;&#x6CD5;&#x901A;&#x5E38;&#x5728;&#x4F01;&#x4E1A;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x4E2D;&#x5341;&#x5206;&#x5FC5;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x5E38;&#x5E38;&#x5FD8;&#x8BB0;&#x4FEE;&#x6539;&#x9ED8;&#x8BA4;&#x7684;&#x56E2;&#x4F53;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5B83;&#x7528;&#x4E8E;&#x5728; SNMP &#x8BBE;&#x5907;&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#x4FE1;&#x606F;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9002;&#x5F53;&#x731C;&#x6D4B;&#x8BBE;&#x5907;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x9ED8;&#x8BA4;&#x7684;&#x56E2;&#x4F53;&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x6536;&#x96C6;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x4FE1;&#x606F;&#x3002;</p>
<h2 id="413-snmpwalk-snmp-&#x5206;&#x6790;">4.13 SNMPwalk SNMP &#x5206;&#x6790;</h2>
<p>SNMPwalk &#x662F;&#x4E2A;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7684; SNMP &#x626B;&#x63CF;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x731C;&#x6D4B; SNMP &#x56E2;&#x4F53;&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x6536;&#x96C6;&#x6765;&#x81EA;&#x8BBE;&#x5907;&#x7684;&#x5927;&#x91CF;&#x4FE1;&#x606F;&#x3002;SNMPwalk &#x5FAA;&#x73AF;&#x904D;&#x5386;&#x4E00;&#x7CFB;&#x5217;&#x8BF7;&#x6C42;&#x6765;&#x6536;&#x96C6;&#x6765;&#x81EA;&#x8BBE;&#x5907;&#x7684;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; SNMPwalk &#x6765;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x62E5;&#x6709;&#x5F00;&#x542F; SNMP &#x5E76;&#x53EF;&#x4EE5;&#x63A2;&#x6D4B;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x63D0;&#x4F9B;&#x7684;&#x4F8B;&#x5B50;&#x4F7F;&#x7528; Windows XP&#x3002;&#x914D;&#x7F6E; Windows &#x7CFB;&#x7EDF;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x8003;&#x7B2C;&#x4E00;&#x7AE0;&#x7684;&#x201C;&#x5B89;&#x88C5; Windows Server&#x201D;&#x79D8;&#x7C4D;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E3A;&#x4E86;&#x6267;&#x884C; SNMPwalk&#xFF0C;&#x5E94;&#x8BE5;&#x5C06;&#x4E00;&#x7CFB;&#x5217;&#x53C2;&#x6570;&#x4F20;&#x7ED9;&#x5DE5;&#x5177;&#xFF0C;&#x5305;&#x62EC;&#x88AB;&#x5206;&#x6790;&#x7CFB;&#x7EDF;&#x7684; IP &#x5730;&#x5740;&#xFF0C;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x56E2;&#x4F53;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4EE5;&#x53CA;&#x7CFB;&#x7EDF;&#x6240;&#x4F7F;&#x7528;&#x7684; SNMP &#x7248;&#x672C;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# snmpwalk 172.16.36.134 -c public -v 2c 
iso.3.6.1.2.1.1.1.0 = STRING: &quot;Hardware: x86 Family 6 Model 58  Stepping 9 AT/AT COMPATIBLE - Software: Windows 2000 Version 5.1  (Build 2600 Uniprocessor Free)&quot; 
iso.3.6.1.2.1.1.2.0 = OID: 
iso.3.6.1.4.1.311.1.1.3.1.1 
iso.3.6.1.2.1.1.3.0 = Timeticks: (56225) 0:09:22.25 
iso.3.6.1.2.1.1.4.0 = &quot;&quot; 
iso.3.6.1.2.1.1.5.0 = STRING: &quot;DEMO-72E8F41CA4&quot; 
iso.3.6.1.2.1.1.6.0 = &quot;&quot;
iso.3.6.1.2.1.1.7.0 = INTEGER: 76 
iso.3.6.1.2.1.2.1.0 = INTEGER: 2
iso.3.6.1.2.1.2.2.1.1.1 = INTEGER: 1 
iso.3.6.1.2.1.2.2.1.1.2 = INTEGER: 2 
iso.3.6.1.2.1.2.2.1.2.1 = Hex-STRING: 4D 53 20 54 43 50 20 4C 6F 6F  70 62 61 63 6B 20 69 6E 74 65 72 66 61 63 65 00 
iso.3.6.1.2.1.2.2.1.2.2 = Hex-STRING: 41 4D 44 20 50 43 4E 45 54 20  46 61 6D 69 6C 79
</code></pre><p>&#x4E3A;&#x4E86;&#x5BF9;&#x5F00;&#x542F; SNMP &#x7684; Windows XP &#x7CFB;&#x7EDF;&#x4F7F;&#x7528; SNMPwalk&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x7684;&#x56E2;&#x4F53;&#x5B57;&#x7B26;&#x4E32;<code>public</code>&#xFF0C;&#x4EE5;&#x53CA;&#x7248;&#x672C;<code>2c</code>&#x3002;&#x8FD9;&#x4F1A;&#x751F;&#x6210;&#x5927;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x5728;&#x5C55;&#x793A;&#x4E2D;&#x5DF2;&#x7ECF;&#x622A;&#x65AD;&#x3002;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x901A;&#x5E38;&#x6240;&#x6709;&#x88AB;&#x8BC6;&#x522B;&#x7684;&#x4FE1;&#x606F;&#x90FD;&#x5728;&#x6240;&#x67E5;&#x8BE2;&#x7684; IOD &#x503C;&#x540E;&#x9762;&#x3002;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x7BA1;&#x9053;&#x8FDE;&#x63A5;&#x5230;<code>cut</code>&#x51FD;&#x6570;&#x6765;&#x79FB;&#x9664;&#x6807;&#x8BC6;&#x7B26;&#x3002;</p>
<pre><code>root@KaliLinux:~# snmpwalk 172.16.36.134 -c public -v 2c | cut -d &quot;=&quot;  -f 2 
STRING: &quot;Hardware: x86 Family 6 Model 58 Stepping 9 AT/AT COMPATIBLE  - Software: Windows 2000 Version 5.1 (Build 2600 Uniprocessor Free)&quot; 
OID: iso.3.6.1.4.1.311.1.1.3.1.1 
Timeticks: (75376) 0:12:33.76 
&quot;&quot; 
STRING: &quot;DEMO-72E8F41CA4&quot;
</code></pre><p>&#x8981;&#x6CE8;&#x610F;&#xFF0C; SNMPwalk &#x7684;&#x8F93;&#x51FA;&#x4E2D;&#x4E0D;&#x4EC5;&#x4EC5;&#x63D0;&#x4F9B;&#x4E86;&#x7CFB;&#x7EDF;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x5728;&#x8F93;&#x51FA;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x660E;&#x663E;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x53E6;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x5219;&#x662F;&#x6A21;&#x7CCA;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x901A;&#x8FC7;&#x5F7B;&#x5E95;&#x5206;&#x6790;&#x5B83;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6536;&#x96C6;&#x5230;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684;&#x5927;&#x91CF;&#x4FE1;&#x606F;&#xFF1A;</p>
<pre><code>Hex-STRING: 00 50 56 FF 2A 8E  
Hex-STRING: 00 0C 29 09 C3 79  
Hex-STRING: 00 50 56 F0 EE E8  
IpAddress: 172.16.36.2 
IpAddress: 172.16.36.180 
IpAddress: 172.16.36.254
</code></pre><p>&#x5728;&#x8F93;&#x51FA;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x503C;&#x548C; IP &#x5730;&#x5740;&#x7684;&#x5217;&#x8868;&#x3002;&#x901A;&#x8FC7;&#x53C2;&#x8003;&#x5DF2;&#x77E5;&#x7CFB;&#x7EDF;&#x7684;&#x7F51;&#x7EDC;&#x63A5;&#x53E3;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x4E9B;&#x662F; ARP &#x7F13;&#x5B58;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5B83;&#x8868;&#x660E;&#x4E86;&#x50A8;&#x5B58;&#x5728;&#x8BBE;&#x5907;&#x4E2D;&#x7684; IP &#x548C; MAC &#x5730;&#x5740;&#x7684;&#x5173;&#x8054;&#x3002;</p>
<pre><code>STRING: &quot;FreeSSHDService.exe&quot; 
STRING: &quot;vmtoolsd.exe&quot; 
STRING: &quot;java.exe&quot; 
STRING: &quot;postgres.exe&quot; 
STRING: &quot;java.exe&quot;
STRING: &quot;java.exe&quot; 
STRING: &quot;TPAutoConnSvc.exe&quot; 
STRING: &quot;snmp.exe&quot; 
STRING: &quot;snmptrap.exe&quot; 
STRING: &quot;TPAutoConnect.exe&quot; 
STRING: &quot;alg.exe&quot; 
STRING: &quot;cmd.exe&quot; 
STRING: &quot;postgres.exe&quot; 
STRING: &quot;freeSSHd 1.2.0&quot; 
STRING: &quot;CesarFTP 0.99g&quot; 
STRING: &quot;VMware Tools&quot; 
STRING: &quot;Python 2.7.1&quot; 
STRING: &quot;WebFldrs XP&quot; 
STRING: &quot;VMware Tools&quot;
</code></pre><p>&#x6B64;&#x5916;&#xFF0C;&#x8FD0;&#x884C;&#x8FDB;&#x7A0B;&#x548C;&#x5B89;&#x88C5;&#x7684;&#x5E94;&#x7528;&#x7684;&#x5217;&#x8868;&#x53EF;&#x4EE5;&#x5728;&#x8F93;&#x51FA;&#x4E2D;&#x627E;&#x5230;&#x3002;&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#x5728;&#x679A;&#x4E3E;&#x8FD0;&#x884C;&#x5728;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x4EE5;&#x53CA;&#x8BC6;&#x522B;&#x6F5C;&#x5728;&#x7684;&#x53EF;&#x5229;&#x7528;&#x6F0F;&#x6D1E;&#x65F6;&#x5341;&#x5206;&#x6709;&#x7528;&#x3002;</p>
<h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x4E0D;&#x50CF; Onesixtyone&#xFF0C;SNMPwalk &#x4E0D;&#x4EC5;&#x4EC5;&#x80FD;&#x591F;&#x8BC6;&#x522B;&#x9ED8;&#x8BA4; SNMP &#x56E2;&#x4F53;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x914D;&#x7F6E;&#x6765;&#x6536;&#x96C6;&#x5927;&#x91CF;&#x6765;&#x81EA;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4E00;&#x5E8F;&#x5217; SNMP GETNEXT &#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x8BF7;&#x6C42;&#x6765;&#x7206;&#x7834;&#x7CFB;&#x7EDF;&#x7684;&#x6240;&#x6709;&#x53EF;&#x7528;&#x4FE1;&#x606F;&#x6765;&#x5B8C;&#x6210;&#x3002;</p>
<h2 id="414-scapy-&#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;">4.14 Scapy &#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;</h2>
<p>&#x901A;&#x8FC7;&#x8BC4;&#x4F30;&#x4ECE;&#x5C01;&#x5305;&#x6CE8;&#x5165;&#x8FD4;&#x56DE;&#x54CD;&#x5E94;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x8FDC;&#x7A0B;&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x88AB;&#x9632;&#x706B;&#x5899;&#x8BBE;&#x5907;&#x8FC7;&#x6EE4;&#x3002;&#x4E3A;&#x4E86;&#x5BF9;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x6709;&#x4E2A;&#x5F7B;&#x5E95;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Scapy &#x5728;&#x5C01;&#x5305;&#x7EA7;&#x522B;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Scapy &#x6765;&#x6267;&#x884C;&#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x8FC7;&#x6EE4;&#x673A;&#x5236;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x72EC;&#x7ACB;&#x9632;&#x706B;&#x5899;&#x8BBE;&#x5907;&#xFF0C;&#x6216;&#x8005;&#x57FA;&#x4E8E;&#x4E3B;&#x673A;&#x7684;&#x8FC7;&#x6EE4;&#xFF0C;&#x4F8B;&#x5982; Windows &#x9632;&#x706B;&#x5899;&#x6765;&#x5B8C;&#x6210;&#x3002;&#x901A;&#x8FC7;&#x64CD;&#x4F5C;&#x9632;&#x706B;&#x5899;&#x8BBE;&#x5907;&#x7684;&#x8FC7;&#x6EE4;&#x8BBE;&#x7F6E;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x4FEE;&#x6539;&#x88AB;&#x6CE8;&#x5165;&#x5C01;&#x5305;&#x7684;&#x54CD;&#x5E94;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E3A;&#x4E86;&#x9AD8;&#x6548;&#x5224;&#x65AD;&#x662F;&#x5426; TCP &#x7AEF;&#x53E3;&#x88AB;&#x8FC7;&#x6EE4;&#xFF0C;&#x9700;&#x8981;&#x5411;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x53D1;&#x9001; TCP SYN &#x548C; ACK &#x5C01;&#x5305;&#x3002;&#x57FA;&#x4E8E;&#x7528;&#x4E8E;&#x54CD;&#x5E94;&#x8FD9;&#x4E9B;&#x6CE8;&#x5165;&#x7684;&#x5C01;&#x5305;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x591A;&#x8651;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x5C01;&#x5305;&#x7684;&#x6CE8;&#x5165;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x56DB;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x54CD;&#x5E94;&#x7EC4;&#x5408;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x8BA8;&#x8BBA;&#x6BCF;&#x4E00;&#x79CD;&#x573A;&#x666F;&#xFF0C;&#x5B83;&#x4EEC;&#x5BF9;&#x4E8E;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x7684;&#x8FC7;&#x6EE4;&#x6765;&#x8BF4;&#x8868;&#x793A;&#x4EC0;&#x4E48;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x6D4B;&#x8BD5;&#x5B83;&#x4EEC;&#x3002;&#x8FD9;&#x56DB;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x54CD;&#x5E94;&#x7EC4;&#x5408;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>SYN &#x8BF7;&#x6C42;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#xFF0C;ACK &#x8BF7;&#x6C42;&#x6536;&#x5230; RST &#x54CD;&#x5E94;&#x3002;</li>
<li>SYN &#x8BF7;&#x6C42;&#x6536;&#x5230; SYN+ACK &#x6216;&#x8005; SYN+RST &#x54CD;&#x5E94;&#xFF0C;ACK &#x8BF7;&#x6C42;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#x3002;</li>
<li>SYN &#x8BF7;&#x6C42;&#x6536;&#x5230; SYN+ACK &#x6216;&#x8005; SYN+RST &#x54CD;&#x5E94;&#xFF0C;ACK &#x8BF7;&#x6C42;&#x6536;&#x5230; RST &#x54CD;&#x5E94;&#x3002;</li>
<li>SYN &#x548C; ACK &#x8BF7;&#x6C42;&#x90FD;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#x3002;</li>
</ul>
<table>
<thead>
<tr>
<th></th>
<th>SYN</th>
<th>ACK</th>
<th></th>
</tr>
</thead>
<tbody>
<tr>
<td>1</td>
<td>&#x65E0;&#x54CD;&#x5E94;</td>
<td>RST</td>
<td>&#x72B6;&#x6001;&#x8FC7;&#x6EE4;&#xFF0C;&#x7981;&#x6B62;&#x8FDE;&#x5165;</td>
</tr>
<tr>
<td>2</td>
<td>SYN + ACK/RST</td>
<td>&#x65E0;&#x54CD;&#x5E94;</td>
<td>&#x72B6;&#x6001;&#x8FC7;&#x6EE4;&#xFF0C;&#x7981;&#x6B62;&#x8FDE;&#x51FA;</td>
</tr>
<tr>
<td>3</td>
<td>SYN + ACK/RST</td>
<td>RST</td>
<td>&#x65E0;&#x8FC7;&#x6EE4;&#xFF0C;SYN &#x6536;&#x5230; ACK &#x5219;&#x5F00;&#x653E;&#xFF0C;&#x53CD;&#x4E4B;&#x5173;&#x95ED;</td>
</tr>
<tr>
<td>4</td>
<td>&#x65E0;&#x54CD;&#x5E94;</td>
<td>&#x65E0;&#x54CD;&#x5E94;</td>
<td>&#x65E0;&#x72B6;&#x6001;&#x8FC7;&#x6EE4;</td>
</tr>
</tbody>
</table>
<p>&#x5728;&#x7B2C;&#x4E00;&#x79CD;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x8003;&#x8651; SYN &#x8BF7;&#x6C42;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#xFF0C;ACK &#x8BF7;&#x6C42;&#x6536;&#x5230; RST &#x54CD;&#x5E94;&#x7684;&#x914D;&#x7F6E;&#x3002;&#x4E3A;&#x4E86;&#x6D4B;&#x8BD5;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x5E94;&#x8BE5;&#x53D1;&#x9001; TCP ACK &#x5C01;&#x5305;&#x7ED9;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x3002;&#x4E3A;&#x4E86;&#x53D1;&#x9001; TCP ACK &#x5C01;&#x5305;&#x7ED9;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x5FC5;&#x987B;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x7684;&#x5C42;&#x7EA7;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x6784;&#x5EFA; IP &#x5C42;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# scapy Welcome to Scapy (2.2.0) 
&gt;&gt;&gt; i = IP() 
&gt;&gt;&gt; i.display() 
###[ IP ]###
    version= 4
    ihl= None
    tos= 0x0
    len= None
    id= 1
    flags=
    frag= 0
    ttl= 64
    proto= ip
    chksum= None
    src= 127.0.0.1
    dst= 127.0.0.1
    \options\ 
&gt;&gt;&gt; i.dst = &quot;172.16.36.135&quot;
&gt;&gt;&gt; i.display() 
###[ IP ]###
    version= 4
    ihl= None
    tos= 0x0
    len= None
    id= 1
    flags=
    frag= 0
    ttl= 64
    proto= ip
    chksum= None
    src= 172.16.36.180
    dst= 172.16.36.135
    \options\
</code></pre><p>&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x7684; IP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;<code>IP</code>&#x5BF9;&#x8C61;&#x8D4B;&#x7ED9;&#x53D8;&#x91CF;<code>i</code>&#x3002;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>display</code>&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x914D;&#x7F6E;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x53D7;&#x5730;&#x5740;&#x90FD;&#x8BBE;&#x4E3A;&#x56DE;&#x9001;&#x5730;&#x5740;&#xFF0C;<code>127.0.0.1</code>&#x3002;&#x8FD9;&#x4E9B;&#x503C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x76EE;&#x6807;&#x5730;&#x5740;&#x6765;&#x4FEE;&#x6539;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BBE;&#x7F6E;<code>i.dst</code>&#x4E3A;&#x60F3;&#x8981;&#x626B;&#x63CF;&#x7684;&#x5730;&#x5740;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x3002;&#x901A;&#x8FC7;&#x518D;&#x6B21;&#x8C03;&#x7528;<code>dislay</code>&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E0D;&#x4EC5;&#x4EC5;&#x66F4;&#x65B0;&#x7684;&#x76EE;&#x6807;&#x5730;&#x5740;&#xFF0C;&#x4E5F;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x4E86;&#x548C;&#x9ED8;&#x8BA4;&#x63A5;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x6E90; IP &#x5730;&#x5740;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x4E86;&#x8BF7;&#x6C42;&#x7684; IP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6784;&#x5EFA; TCP &#x5C42;&#x4E86;&#x3002;</p>
<pre><code>&gt;&gt;&gt; t = TCP() 
&gt;&gt;&gt; t.display() 
###[ TCP ]###
    sport= ftp_data
    dport= http
    seq= 0
    ack= 0
    dataofs= None
    reserved= 0
    flags= S
    window= 8192
    chksum= None
    urgptr= 0
    options= {} 
&gt;&gt;&gt; t.dport = 22
&gt;&gt;&gt; t.flags = &apos;A&apos; 
&gt;&gt;&gt; t.display() 
###[ TCP ]###
    sport= ftp_data
    dport= ssh
    seq= 0
    ack= 0
    dataofs= None
    reserved= 0
    flags= A
    window= 8192
    chksum= None
    urgptr= 0
    options= {}
</code></pre><p>&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x8BF7;&#x6C42;&#x7684; TCP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x548C; IP &#x5C42;&#x76F8;&#x540C;&#x7684;&#x6280;&#x5DE7;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x7ACB;&#x5373;&#x4E2D;&#xFF0C;<code>TCP</code>&#x5BF9;&#x8C61;&#x8D4B;&#x7ED9;&#x4E86;<code>t</code>&#x53D8;&#x91CF;&#x3002;&#x50CF;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x9ED8;&#x8BA4;&#x7684;&#x914D;&#x7F6E;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;<code>display</code>&#x51FD;&#x6570;&#x6765;&#x786E;&#x5B9A;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x4E3A; HTTP &#x7AEF;&#x53E3; 80&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x9996;&#x6B21;&#x626B;&#x63CF;&#xFF0C;&#x6211;&#x4EEC;&#x5C06; TCP &#x8BBE;&#x7F6E;&#x4FDD;&#x7559;&#x9ED8;&#x8BA4;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86; TCP &#x548C; IP &#x5C42;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x5B83;&#x4EEC;&#x53E0;&#x653E;&#x6765;&#x6784;&#x9020;&#x8BF7;&#x6C42;&#x3002;</p>
<pre><code>&gt;&gt;&gt; request = (i/t) 
&gt;&gt;&gt; request.display() 
###[ IP ]###
    version= 4
    ihl= None
    tos= 0x0
    len= None
    id= 1
    flags=
     frag= 0
    ttl= 64
    proto= tcp
    chksum= None
    src= 172.16.36.180
    dst= 172.16.36.135
    \options\
###[ TCP ]###
    sport= ftp_data
    dport= ssh
    seq= 0
    ack= 0
    dataofs= None
    reserved= 0
    flags= A
    window= 8192
    chksum= None
    urgptr= 0
    options= {}
</code></pre><p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x659C;&#x6760;&#x5206;&#x79BB;&#x53D8;&#x91CF;&#x6765;&#x53E0;&#x653E; IP &#x548C; TCP &#x5C42;&#x3002;&#x8FD9;&#x4E9B;&#x5C42;&#x9762;&#x4E4B;&#x540E;&#x8D4B;&#x7ED9;&#x4E86;&#x65B0;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x6574;&#x4E2A;&#x8BF7;&#x6C42;&#x3002;&#x6211;&#x4EEC;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x8C03;&#x7528;<code>dispaly</code>&#x51FD;&#x6570;&#x6765;&#x67E5;&#x770B;&#x8BF7;&#x6C42;&#x7684;&#x914D;&#x7F6E;&#x3002;&#x4E00;&#x65E6;&#x6784;&#x5EFA;&#x4E86;&#x8BF7;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;<code>sr1</code>&#x51FD;&#x6570;&#x6765;&#x5206;&#x6790;&#x54CD;&#x5E94;&#xFF1A;</p>
<pre><code>&gt;&gt;&gt; response = sr1(request,timeout=1) 
..Begin emission: 
.........Finished to send 1 packets. 
....* 
Received 16 packets, got 1 answers, remaining 0 packets 
&gt;&gt;&gt; response.display() 
###[ IP ]###
    version= 4L
    ihl= 5L
    tos= 0x0
    len= 40
    id= 0
    flags= DF
    frag= 0L
    ttl= 63
    proto= tcp
    chksum= 0x9974
    src= 172.16.36.135
    dst= 172.16.36.180
    \options\
###[ TCP ]###
    sport= ssh
    dport= ftp_data
    seq= 0
    ack= 0
    dataofs= 5L
    reserved= 0L
    flags= R
    window= 0
    chksum= 0xe5b
    urgptr= 0
    options= {} 
###[ Padding ]###
    load= &apos;\x00\x00\x00\x00\x00\x00&apos;
</code></pre><p>&#x76F8;&#x540C;&#x7684;&#x8BF7;&#x6C42;&#x53EF;&#x4EE5;&#x4E0D;&#x901A;&#x8FC7;&#x6784;&#x5EFA;&#x548C;&#x5806;&#x53E0;&#x6BCF;&#x4E00;&#x5C42;&#x6765;&#x6267;&#x884C;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5355;&#x72EC;&#x7684;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#xFF0C;&#x901A;&#x8FC7;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x5E76;&#x4F20;&#x9012;&#x5408;&#x9002;&#x7684;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code>&gt;&gt;&gt; response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;A&apos;),timeout=1) 
..Begin emission: 
........Finished to send 1 packets. 
....* 
Received 15 packets, got 1 answers, remaining 0 packets 
&gt;&gt;&gt; response 
&lt;IP  version=4L ihl=5L tos=0x0 len=40 id=0 flags=DF frag=0L ttl=63  proto=tcp chksum=0x9974 src=172.16.36.135 dst=172.16.36.180  options=[] |&lt;TCP  sport=ssh dport=ftp_data seq=0 ack=0 dataofs=5L  reserved=0L flags=R window=0 chksum=0xe5b urgptr=0 |&lt;Padding   load=&apos;\x00\x00\x00\x00\x00\x00&apos; |&gt;&gt;&gt;
</code></pre><p>&#x8981;&#x6CE8;&#x610F;&#x5728;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6CE8;&#x5165;&#x7684; ACK &#x5C01;&#x5305;&#x7684;&#x54CD;&#x5E94;&#x662F; RST &#x5C01;&#x5305;&#x3002;&#x6D4B;&#x8BD5;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x4EE5;&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x6CE8;&#x5165; SYN &#x5C01;&#x5305;&#x3002;</p>
<pre><code>&gt;&gt;&gt; response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;S&apos;),timeout=1,verbose =1) 
Begin emission: 
Finished to send 1 packets.

Received 9 packets, got 0 answers, remaining 1 packets
</code></pre><p>&#x4EE5;&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x53D1;&#x9001; SYN &#x8BF7;&#x6C42;&#x4E4B;&#x540E;&#xFF0C;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x4EFB;&#x4F55;&#x54CD;&#x5E94;&#xFF0C;&#x5E76;&#x4E14;&#x51FD;&#x6570;&#x5728;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x8FBE;&#x5230;&#x53EA;&#x6709;&#x65AD;&#x5F00;&#x4E86;&#x8FDE;&#x63A5;&#x3002;&#x8FD9;&#x4E2A;&#x54CD;&#x5E94;&#x7EC4;&#x5408;&#x8868;&#x660E;&#x53D1;&#x751F;&#x4E86;&#x72B6;&#x6001;&#x5305;&#x8FC7;&#x6EE4;&#x3002;&#x5957;&#x63A5;&#x5B57;&#x901A;&#x8FC7;&#x4E22;&#x6389; SYN &#x8BF7;&#x6C42;&#x62D2;&#x7EDD;&#x4E86;&#x6240;&#x6709;&#x5165;&#x5883;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x8FC7;&#x6EE4; ACK &#x5C01;&#x5305;&#x6765;&#x786E;&#x4FDD;&#x4ECD;&#x65E7;&#x5B58;&#x5728;&#x51FA;&#x5883;&#x8FDE;&#x63A5;&#x548C;&#x6301;&#x7EED;&#x4E2D;&#x7684;&#x901A;&#x4FE1;&#x3002;&#x8FD9;&#x4E2A;&#x54CD;&#x5E94;&#x7EC4;&#x5408;&#x53EF;&#x4EE5;&#x5728; Python &#x4E2D;&#x6D4B;&#x8BD5;&#x6765;&#x786E;&#x8BA4;&#x72B6;&#x6001;&#x8FC7;&#x6EE4;&#x7684;&#x7AEF;&#x53E3;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# python 
Python 2.7.3 (default, Jan  2 2013, 16:53:07) 
[GCC 4.7.2] on linux2 
Type &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more  information. 
&gt;&gt;&gt; from scapy.all import * 
&gt;&gt;&gt; ACK_response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;A&apos;),timeout=1,verbose =0) 
&gt;&gt;&gt; SYN_response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;S&apos;),timeout=1,verbose =0) 
&gt;&gt;&gt; if ((ACK_response == None) or (SYN_response == None)) and not  ((ACK_response ==None) and (SYN_response == None)): 
...     print &quot;Stateful filtering in place&quot; 
... Stateful filtering in place 
&gt;&gt;&gt; exit()
</code></pre><p>&#x5728;&#x4F7F;&#x7528; Scapy &#x751F;&#x6210;&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#x4E4B;&#x540E;&#xFF0C;&#x6D4B;&#x8BD5;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8BC4;&#x4F30;&#x8FD9;&#x4E9B;&#x54CD;&#x5E94;&#xFF0C;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426; ACK &#x6216;&#x8005; SYN&#xFF08;&#x4F46;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#xFF09;&#x8BF7;&#x6C42;&#x63A5;&#x53D7;&#x5230;&#x4E86;&#x54CD;&#x5E94;&#x3002;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x5BF9;&#x4E8E;&#x8BC6;&#x522B;&#x8BE5;&#x573A;&#x666F;&#x4EE5;&#x53CA;&#x4E0B;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#x5341;&#x5206;&#x9AD8;&#x6548;&#xFF0C;&#x5176;&#x4E2D; SYN &#x6CE8;&#x5165;&#x800C;&#x4E0D;&#x662F; ACK &#x6CE8;&#x5165;&#x63A5;&#x53D7;&#x5230;&#x4E86;&#x54CD;&#x5E94;&#x3002;</p>
<p>SYN &#x6CE8;&#x5165;&#x6536;&#x5230;&#x4E86; SYN+ACK &#x6216;&#x8005; RST+ACK &#x54CD;&#x5E94;&#xFF0C;&#x4F46;&#x662F; ACK &#x6CE8;&#x5165;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x54CD;&#x5E94;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x4E5F;&#x8868;&#x660E;&#x5B58;&#x5728;&#x72B6;&#x6001;&#x8FC7;&#x6EE4;&#x3002;&#x5269;&#x4F59;&#x7684;&#x6D4B;&#x8BD5;&#x4E5F;&#x4E00;&#x6837;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5411;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x53D1;&#x9001; ACK &#x5C01;&#x5305;&#x3002;</p>
<pre><code>&gt;&gt;&gt; response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;A&apos;),timeout=1,verbose =1) 
Begin emission: 
Finished to send 1 packets.

Received 16 packets, got 0 answers, remaining 1 packets
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x4E2D;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x54E5;&#x6CE8;&#x5165;&#x8BF7;&#x6C42;&#x4E4B;&#x4E00;&#x6536;&#x5230;&#x54CD;&#x5E94;&#xFF0C;&#x6D4B;&#x8BD5;&#x5C31;&#x8868;&#x660E;&#x5B58;&#x5728;&#x72B6;&#x6001;&#x8FC7;&#x6EE4;&#x3002;</p>
<pre><code>root@KaliLinux:~# python 
Python 2.7.3 (default, Jan  2 2013, 16:53:07) 
[GCC 4.7.2] on linux2 
Type &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more  information. 
&gt;&gt;&gt; from scapy.all import * 
&gt;&gt;&gt; ACK_response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;A&apos;),timeout=1,verbose =0) 
&gt;&gt;&gt; SYN_response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;S&apos;),timeout=1,verbose =0) 
&gt;&gt;&gt; if ((ACK_response == None) or (SYN_response == None)) and not  ((ACK_response ==None) and (SYN_response == None)): 
...     print &quot;Stateful filtering in place&quot; 
... Stateful filtering in place 
&gt;&gt;&gt; exit()
</code></pre><p>&#x54CD;&#x5E94;&#x7684;&#x7EC4;&#x5408;&#x8868;&#x660E;&#xFF0C;&#x72B6;&#x6001;&#x8FC7;&#x6EE4;&#x6267;&#x884C;&#x5728; ACK &#x5C01;&#x5305;&#x4E0A;&#xFF0C;&#x4EFB;&#x4F55;&#x6765;&#x81EA;&#x5916;&#x90E8;&#x7684;&#x7B26;&#x5408;&#x4E0A;&#x4E0B;&#x6587;&#x7684; ACK &#x5C01;&#x5305;&#x90FD;&#x4F1A;&#x88AB;&#x4E22;&#x5F03;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5165;&#x5883;&#x8FDE;&#x63A5;&#x5C1D;&#x8BD5;&#x7684;&#x54CD;&#x5E94;&#x8868;&#x660E;&#xFF0C;&#x7AEF;&#x53E3;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x8FC7;&#x6EE4;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x573A;&#x666F;&#x5C31;&#x662F; SYN &#x548C; ACK &#x6CE8;&#x5165;&#x90FD;&#x6536;&#x5230;&#x4E86;&#x9884;&#x671F;&#x54CD;&#x5E94;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F62;&#x5F0F;&#x7684;&#x8FC7;&#x6EE4;&#x3002;&#x4E3A;&#x4E86;&#x5BF9;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6267;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x6267;&#x884C; ACK &#x6CE8;&#x5165;&#xFF0C;&#x4E4B;&#x540E;&#x5206;&#x6790;&#x54CD;&#x5E94;&#xFF1A;</p>
<pre><code>&gt;&gt;&gt; response =
sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;A&apos;),timeout=1,verbose=1)
Begin emission: 
Finished to send 1 packets.
Received 5 packets, got 1 answers, remaining 0 packets 
&gt;&gt;&gt; response.display() 
###[ IP ]###
    version= 4L
    ihl= 5L
    tos= 0x0
    len= 40
    id= 0
    flags= DF
    frag= 0L
    ttl= 64
    proto= tcp
    chksum= 0x9974
    src= 172.16.36.135
    dst= 172.16.36.180
    \options\
###[ TCP ]###
    sport= ssh
    dport= ftp_data
    seq= 0
    ack= 0
    dataofs= 5L
    reserved= 0L
    flags= R
    window= 0
    chksum= 0xe5b
    urgptr= 0
    options= {} 
###[ Padding ]###
    load= &apos;\x00\x00\x00\x00\x00\x00&apos;
</code></pre><p>&#x5728;&#x5C01;&#x5305;&#x672A;&#x88AB;&#x8FC7;&#x6EE4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6765;&#x8DEF;&#x4E0D;&#x660E;&#x7684; ACK &#x5C01;&#x5305;&#x53D1;&#x9001;&#x7ED9;&#x4E86;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#xFF0C;&#x5E76;&#x5E94;&#x8BE5;&#x4EA7;&#x751F;&#x8FD4;&#x56DE;&#x7684; RST &#x5C01;&#x5305;&#x3002;&#x8FD9;&#x4E2A; RST &#x5C01;&#x5305;&#x8868;&#x660E;&#xFF0C;ACK &#x5C01;&#x5305;&#x4E0D;&#x7B26;&#x5408;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x5E76;&#x4E14;&#x6253;&#x7B97;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x3002;&#x53D1;&#x9001;&#x4E86; ACK &#x6CE8;&#x5165;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5411;&#x76F8;&#x540C;&#x7AEF;&#x53E3;&#x53D1;&#x9001; SYN &#x6CE8;&#x5165;&#x3002;</p>
<pre><code>&gt;&gt;&gt; response =
sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;S&apos;),timeout=1,verbose =1) 
Begin emission: 
Finished to send 1 packets.
Received 4 packets, got 1 answers, remaining 0 packets 
&gt;&gt;&gt; response.display() 
###[ IP ]###
    version= 4L
    ihl= 5L
    tos= 0x0
    len= 44
    id= 0
    flags= DF
    frag= 0L
    ttl= 64
    proto= tcp
    chksum= 0x9970
    src= 172.16.36.135
    dst= 172.16.36.180
    \options\ 
###[ TCP ]###
    sport= ssh
    dport= ftp_data
    seq= 1147718450
    ack= 1
    dataofs= 6L
    reserved= 0L
    flags= SA
    window= 5840
    chksum= 0xd024
    urgptr= 0
    options= [(&apos;MSS&apos;, 1460)] 
###[ Padding ]###
    load= &apos;\x00\x00&apos; 
&gt;&gt;&gt; response[TCP].flags 
18L 
&gt;&gt;&gt; int(response[TCP].flags) 
18
</code></pre><p>&#x5728;&#x7AEF;&#x53E3;&#x672A;&#x8FC7;&#x6EE4;&#x5E76;&#x6253;&#x5F00;&#x7684;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x4F1A;&#x8FD4;&#x56DE; SYN+ACK &#x54CD;&#x5E94;&#x3002;&#x8981;&#x6CE8;&#x610F; TCP<code>flags</code>&#x5C5E;&#x6027;&#x7684;&#x5B9E;&#x9645;&#x503C;&#x662F;&#x4E2A;<code>long</code>&#x53D8;&#x91CF;&#xFF0C;&#x503C;&#x4E3A; 18&#x3002;&#x8FD9;&#x4E2A;&#x503C;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x4F7F;&#x7528;<code>int</code>&#x51FD;&#x6570;&#x6765;&#x8F6C;&#x6362;&#x6210;<code>int</code>&#x53D8;&#x91CF;&#x3002;&#x8FD9;&#x4E2A; 18 &#x7684;&#x503C;&#x662F; TCP &#x6807;&#x8BC6;&#x4F4D;&#x5E8F;&#x5217;&#x7684;&#x5341;&#x8FDB;&#x5236;&#x503C;&#x3002;SYN &#x6807;&#x5FD7;&#x7684;&#x5341;&#x8FDB;&#x5236;&#x503C;&#x4E3A; 2&#xFF0C;&#x800C; ACK &#x6807;&#x8BC6;&#x7684;&#x5341;&#x8FDB;&#x5236;&#x503C;&#x4E3A; 16&#x3002;&#x5047;&#x8BBE;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x72B6;&#x6001;&#x8FC7;&#x6EE4;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BC4;&#x4F30; TCP<code>flags</code>&#x503C;&#x7684;&#x6574;&#x6570;&#x8F6C;&#x6362;&#xFF0C;&#x5728; Python &#x4E2D;&#x6D4B;&#x8BD5;&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x672A;&#x8FC7;&#x6EE4;&#x5E76;&#x6253;&#x5F00;&#x3002;</p>
<pre><code>root@KaliLinux:~# python Python 2.7.3 (default, Jan  2 2013, 16:53:07) 
[GCC 4.7.2] on linux2
Type &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more  information. 
&gt;&gt;&gt; from scapy.all import * 
&gt;&gt;&gt; ACK_response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;A&apos;),timeout=1,verbose =0) 
&gt;&gt;&gt; SYN_response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;S&apos;),timeout=1,verbose =0) 
&gt;&gt;&gt; if ((ACK_response == None) or (SYN_response == None)) and not  ((ACK_response ==None) and (SYN_response == None)): 
...     print &quot;Stateful filtering in place&quot; 
... elif int(SYN_response[TCP].flags) == 18: 
...     print &quot;Port is unfiltered and open&quot; 
... elif int(SYN_response[TCP].flags) == 20: 
...     print &quot;Port is unfiltered and closed&quot; 
... Port is unfiltered and open 
&gt;&gt;&gt; exit()
</code></pre><p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x76F8;&#x4F3C;&#x7684;&#x6D4B;&#x8BD5;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x7AEF;&#x53E3;&#x672A;&#x8FC7;&#x6EE4;&#x5E76;&#x5173;&#x95ED;&#x3002;&#x672A;&#x8FC7;&#x6EE4;&#x7684;&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x4F1A;&#x6FC0;&#x6D3B; RST &#x548C; ACK &#x6807;&#x8BC6;&#x3002;&#x50CF;&#x4E4B;&#x524D;&#x90A3;&#x6837;&#xFF0C;ACK &#x6807;&#x8BC6;&#x4E3A;&#x6574;&#x6570; 16&#xFF0C;RST &#x6807;&#x8BC6;&#x4E3A; &#x6574;&#x6570; 4&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x672A;&#x8FC7;&#x6EE4;&#x7684;&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x7684; TCP<code>flags</code>&#x503C;&#x7684;&#x6574;&#x6570;&#x8F6C;&#x6362;&#x5E94;&#x8BE5;&#x662F; 20&#xFF1A;</p>
<pre><code>root@KaliLinux:~# python Python 2.7.3 (default, Jan  2 2013, 16:53:07) 
[GCC 4.7.2] on linux2 
Type &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more  information. 
&gt;&gt;&gt; from scapy.all import * 
&gt;&gt;&gt; ACK_response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=4444,flags=&apos;A&apos;),timeout=1,verbo se=0) 
&gt;&gt;&gt; SYN_response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=4444,flags=&apos;S&apos;),timeout=1,verbo se=0) 
&gt;&gt;&gt; if ((ACK_response == None) or (SYN_response == None)) and not  ((ACK_response ==None) and (SYN_response == None)): 
...     print &quot;Stateful filtering in place&quot; 
... elif int(SYN_response[TCP].flags) == 18: 
...     print &quot;Port is unfiltered and open&quot;
... elif int(SYN_response[TCP].flags) == 20: 
...     print &quot;Port is unfiltered and closed&quot; 
... Port is unfiltered and closed 
&gt;&gt;&gt; exit()
</code></pre><p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x6700;&#x540E;&#x4E00;&#x79CD;&#x573A;&#x666F;&#xFF0C;&#x5176;&#x4E2D; SYN &#x6216;&#x8005; ACK &#x6CE8;&#x5165;&#x90FD;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x54CD;&#x5E94;&#x3002;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;<code>sr1</code>&#x7684;&#x5B9E;&#x4F8B;&#x90FD;&#x4F1A;&#x5728;&#x8D85;&#x65F6;&#x7684;&#x65F6;&#x5019;&#x65AD;&#x5F00;&#x3002;</p>
<pre><code>&gt;&gt;&gt; response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;A&apos;),timeout=1,verbose =1) 
Begin emission: 
Finished to send 1 packets.
Received 36 packets, got 0 answers, remaining 1 packets 
&gt;&gt;&gt; response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=22,flags=&apos;S&apos;),timeout=1,verbose =1) 
Begin emission: 
Finished to send 1 packets.
Received 18 packets, got 0 answers, remaining 1 packets
</code></pre><p>&#x6BCF;&#x4E2A;&#x6CE8;&#x5165;&#x5C01;&#x5305;&#x90FD;&#x7F3A;&#x5C11;&#x54CD;&#x5E94;&#xFF0C;&#x8868;&#x660E;&#x7AEF;&#x53E3;&#x5B58;&#x5728;&#x65E0;&#x72B6;&#x6001;&#x8FC7;&#x6EE4;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x4E22;&#x5F03;&#x6240;&#x6709;&#x5165;&#x5883;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x65E0;&#x8BBA;&#x72B6;&#x6001;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x6216;&#x8005;&#x8FD9;&#x8868;&#x660E;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x60F3;&#x6CD5;&#x53EF;&#x80FD;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x6D4B;&#x8BD5;&#x5E8F;&#x5217;&#x7684;&#x672B;&#x5C3E;&#x5411;<code>else</code>&#x6DFB;&#x52A0;&#x6267;&#x884C;&#x6D41;&#xFF0C;&#x5728; Python &#x4E2D;&#x6D4B;&#x8BD5;&#x5B83;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4EFB;&#x4F55;&#x6CE8;&#x5165;&#x90FD;&#x6CA1;&#x6709;&#x63A5;&#x53D7;&#x5230;&#x54CD;&#x5E94;&#xFF0C;<code>else</code>&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x4F1A;&#x6267;&#x884C;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;<code>else</code>&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x4F1A;&#x5728;&#x6CA1;&#x6709;&#x63A5;&#x6536;&#x5230;&#x54CD;&#x5E94;&#x7684;&#x65F6;&#x5019;&#x6267;&#x884C;&#x3002;</p>
<pre><code>root@KaliLinux:~# python Python 2.7.3 (default, Jan  2 2013, 16:53:07) 
[GCC 4.7.2] on linux2 
Type &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more  information. 
&gt;&gt;&gt; from scapy.all import * 
&gt;&gt;&gt; ACK_response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=4444,flags=&apos;A&apos;),timeout=1,verbo se=0)
&gt;&gt;&gt; SYN_response =  sr1(IP(dst=&quot;172.16.36.135&quot;)/TCP(dport=4444,flags=&apos;S&apos;),timeout=1,verbo se=0) 
&gt;&gt;&gt; if ((ACK_response == None) or (SYN_response == None)) and not  ((ACK_response ==None) and (SYN_response == None)): 
...     print &quot;Stateful filtering in place&quot; 
... elif int(SYN_response[TCP].flags) == 18: 
...     print &quot;Port is unfiltered and open&quot; 
... elif int(SYN_response[TCP].flags) == 20: 
...     print &quot;Port is unfiltered and closed&quot; 
... else: 
...     print &quot;Port is either unstatefully filtered or host is down&quot; 
...
Traceback (most recent call last):  
    File &quot;&lt;stdin&gt;&quot;, line 3, in &lt;module&gt; 
TypeError: &apos;NoneType&apos; object has no attribute &apos;__getitem__&apos;
</code></pre><p>&#x8FD9;&#x610F;&#x5473;&#x7740;&#x7406;&#x8BBA;&#x4E0A;&#x53EF;&#x4EE5;&#x751F;&#x6548;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x5DE5;&#x4F5C;&#x3002;&#x64CD;&#x4F5C;&#x503C;&#x4E3A;&#x7A7A;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x65F6;&#x5019;&#xFF0C;Python &#x5B9E;&#x9645;&#x4E0A;&#x4F1A;&#x4EA7;&#x751F;&#x9519;&#x8BEF;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x9996;&#x5148;&#x5C31;&#x9700;&#x8981;&#x68C0;&#x6D4B;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x4EFB;&#x4F55;&#x56DE;&#x590D;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<pre><code>&gt;&gt;&gt; if (ACK_response == None) and (SYN_response == None): 
...     print &quot;Port is either unstatefully filtered or host is down&quot; 
... Port is either unstatefully filtered or host is down
</code></pre><p>&#x8FD9;&#x4E2A;&#x5B8C;&#x6210;&#x7684;&#x6D4B;&#x8BD5;&#x5E8F;&#x5217;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x96C6;&#x6210;&#x5230;&#x5355;&#x4E2A;&#x529F;&#x80FD;&#x6027;&#x811A;&#x672C;&#x4E2D;&#x3002;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x63A5;&#x53D7;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5305;&#x62EC;&#x76EE;&#x6807; IP &#x5730;&#x5740;&#x548C;&#x88AB;&#x6D4B;&#x8BD5;&#x7684;&#x7AEF;&#x53E3;&#x3002;&#x4E4B;&#x540E;&#x6CE8;&#x5165; ACK &#x548C; SYN &#x5C01;&#x5305;&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x5728;&#x54CD;&#x5E94;&#xFF0C;&#x54CD;&#x5E94;&#x4F1A;&#x50A8;&#x5B58;&#x7528;&#x4E8E;&#x8BC4;&#x4F30;&#x3002;&#x4E4B;&#x540E;&#x6267;&#x884C;&#x56DB;&#x4E2A;&#x6D4B;&#x8BD5;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x7AEF;&#x53E3;&#x4E0A;&#x5B58;&#x5728;&#x8FC7;&#x6EE4;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x4F1A;&#x6267;&#x884C;&#x6D4B;&#x8BD5;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x6CA1;&#x6709;&#x53D7;&#x5230;&#x4EFB;&#x4F55;&#x54CD;&#x5E94;&#x3002;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x8F93;&#x51FA;&#x4F1A;&#x8868;&#x793A;&#x8FDC;&#x7A0B;&#x4E3B;&#x673A;&#x5D29;&#x6E83;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x7AEF;&#x53E3;&#x5B58;&#x5728;&#x65E0;&#x72B6;&#x6001;&#x8FC7;&#x6EE4;&#xFF0C;&#x5E76;&#x4E22;&#x5F03;&#x6240;&#x6709;&#x6D41;&#x91CF;&#x3002;&#x5982;&#x679C;&#x63A5;&#x6536;&#x5230;&#x4E86;&#x4EFB;&#x4F55;&#x8BF7;&#x6C42;&#xFF0C;&#x4F1A;&#x6267;&#x884C;&#x6D4B;&#x8BD5;&#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x63A5;&#x53D7;&#x5230;&#x4E86;&#x67D0;&#x4E2A;&#x6CE8;&#x5165;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#x3002;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x8F93;&#x51FA;&#x4F1A;&#x8868;&#x660E;&#x7AEF;&#x53E3;&#x5B58;&#x5728;&#x72B6;&#x6001;&#x8FC7;&#x6EE4;&#x3002;&#x6700;&#x540E;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x6CE8;&#x5165;&#x90FD;&#x63A5;&#x53D7;&#x5230;&#x4E86;&#x54CD;&#x5E94;&#xFF0C;&#x7AEF;&#x53E3;&#x4F1A;&#x88AB;&#x8BC6;&#x522B;&#x4E3A;&#x7269;&#x8FC7;&#x6EE4;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x8BC4;&#x4F30; TCP &#x6807;&#x5FD7;&#x4F4D;&#x6765;&#x5224;&#x65AD;&#x7AEF;&#x53E3;&#x5F00;&#x653E;&#x8FD8;&#x662F;&#x5173;&#x95ED;&#x3002;</p>
<pre><code class="lang-py"><span class="hljs-comment">#!/usr/bin/python</span>

<span class="hljs-keyword">import</span> sys <span class="hljs-keyword">import</span> logging 
logging.getLogger(<span class="hljs-string">&quot;scapy.runtime&quot;</span>).setLevel(logging.ERROR)

<span class="hljs-keyword">from</span> scapy.all <span class="hljs-keyword">import</span> *

<span class="hljs-keyword">if</span> len(sys.argv) != <span class="hljs-number">3</span>:   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Usage - ./ACK_FW_detect.py [Target-IP] [Target Port]&quot;</span>   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Example - ./ACK_FW_detect.py 10.0.0.5 443&quot;</span>   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Example will determine if filtering exists on port 443 of     host 10.0.0.5&quot;</span>   
    sys.exit()

ip = sys.argv[<span class="hljs-number">1</span>] 
port = int(sys.argv[<span class="hljs-number">2</span>])

ACK_response =  sr1(IP(dst=ip)/TCP(dport=port,flags=<span class="hljs-string">&apos;A&apos;</span>),timeout=<span class="hljs-number">1</span>,verbose=<span class="hljs-number">0</span>) 
SYN_response =  sr1(IP(dst=ip)/TCP(dport=port,flags=<span class="hljs-string">&apos;S&apos;</span>),timeout=<span class="hljs-number">1</span>,verbose=<span class="hljs-number">0</span>) 
<span class="hljs-keyword">if</span> (ACK_response == <span class="hljs-keyword">None</span>) <span class="hljs-keyword">and</span> (SYN_response == <span class="hljs-keyword">None</span>):   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Port is either unstatefully filtered or host is down&quot;</span> 
<span class="hljs-keyword">elif</span> ((ACK_response == <span class="hljs-keyword">None</span>) <span class="hljs-keyword">or</span> (SYN_response == <span class="hljs-keyword">None</span>)) <span class="hljs-keyword">and</span> <span class="hljs-keyword">not</span>  ((ACK_response ==<span class="hljs-keyword">None</span>) <span class="hljs-keyword">and</span> (SYN_response == <span class="hljs-keyword">None</span>)):   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Stateful filtering in place&quot;</span> 
<span class="hljs-keyword">elif</span> int(SYN_response[TCP].flags) == <span class="hljs-number">18</span>:   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Port is unfiltered and open&quot;</span> 
<span class="hljs-keyword">elif</span> int(SYN_response[TCP].flags) == <span class="hljs-number">20</span>:   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Port is unfiltered and closed&quot;</span> 
<span class="hljs-keyword">else</span>:   
    <span class="hljs-keyword">print</span> <span class="hljs-string">&quot;Unable to determine if the port is filtered&quot;</span>
</code></pre>
<p>&#x5728;&#x672C;&#x5730;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x521B;&#x5EFA;&#x811A;&#x672C;&#x4E4B;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x6587;&#x4EF6;&#x8BB8;&#x53EF;&#x6765;&#x5141;&#x8BB8;&#x811A;&#x672C;&#x6267;&#x884C;&#x3002;<code>chmod</code>&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x66F4;&#x65B0;&#x8FD9;&#x4E9B;&#x8BB8;&#x53EF;&#xFF0C;&#x811A;&#x672C;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x5E76;&#x4F20;&#x5165;&#x9884;&#x671F;&#x53C2;&#x6570;&#x6765;&#x6267;&#x884C;&#xFF1A;</p>
<pre><code>root@KaliLinux:~# chmod 777 ACK_FW_detect.py 
root@KaliLinux:~# ./ACK_FW_detect.py 
Usage - ./ACK_FW_detect.py [Target-IP] [Target Port] 
Example - ./ACK_FW_detect.py 10.0.0.5 443 
Example will determine if filtering exists on port 443 of host  10.0.0.5 
root@KaliLinux:~# ./ACK_FW_detect.py 172.16.36.135 80 Port is unfiltered and open 
root@KaliLinux:~# ./ACK_FW_detect.py 172.16.36.134 22 Host is either unstatefully filtered or is down
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>SYN &#x548C; ACK TCP &#x6807;&#x5FD7;&#x5728;&#x6709;&#x72B6;&#x6001;&#x7684;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x4E2D;&#x8D77;&#x5230;&#x5173;&#x952E;&#x4F5C;&#x7528;&#x3002;SYN &#x8BF7;&#x6C42;&#x5141;&#x8BB8;&#x5EFA;&#x7ACB;&#x65B0;&#x7684; TCP &#x4F1A;&#x8BDD;&#xFF0C;&#x800C; ACK &#x54CD;&#x5E94;&#x7528;&#x4E8E;&#x5728;&#x5173;&#x95ED;&#x4E4B;&#x524D;&#x7EF4;&#x6301;&#x4F1A;&#x8BDD;&#x3002;&#x7AEF;&#x53E3;&#x54CD;&#x5E94;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x5C01;&#x5305;&#x4E4B;&#x4E00;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x54CD;&#x5E94;&#x53E6;&#x4E00;&#x79CD;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x8FC7;&#x6EE4;&#xFF0C;&#x5B83;&#x57FA;&#x4E8E;&#x4F1A;&#x8BDD;&#x72B6;&#x6001;&#x6765;&#x9650;&#x5236;&#x6D41;&#x91CF;&#x3002;&#x901A;&#x8FC7;&#x8BC6;&#x522B;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x591F;&#x63A8;&#x65AD;&#x51FA;&#x7AEF;&#x53E3;&#x4E0A;&#x5B58;&#x5728;&#x72B6;&#x6001;&#x8FC7;&#x6EE4;&#x3002;</p>
<h2 id="415-nmap-&#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;">4.15 Nmap &#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;</h2>
<p>Nmap &#x62E5;&#x6709;&#x7B80;&#x5316;&#x7684;&#x9632;&#x706B;&#x5899;&#x8FC7;&#x6EE4;&#x8BC6;&#x522B;&#x529F;&#x80FD;&#xFF0C;&#x57FA;&#x4E8E; ACK &#x63A2;&#x6D4B;&#x54CD;&#x5E94;&#x6765;&#x8BC6;&#x522B;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x8FC7;&#x6EE4;&#x3002;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#x5355;&#x4E00;&#x7AEF;&#x53E3;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x7AEF;&#x53E3;&#x5E8F;&#x5217;&#x6765;&#x5224;&#x65AD;&#x8FC7;&#x6EE4;&#x72B6;&#x6001;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Nmap &#x6765;&#x6267;&#x884C;&#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x8FC7;&#x6EE4;&#x673A;&#x5236;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x72EC;&#x7ACB;&#x9632;&#x706B;&#x5899;&#x8BBE;&#x5907;&#xFF0C;&#x6216;&#x8005;&#x57FA;&#x4E8E;&#x4E3B;&#x673A;&#x7684;&#x8FC7;&#x6EE4;&#xFF0C;&#x4F8B;&#x5982; Windows &#x9632;&#x706B;&#x5899;&#x6765;&#x5B8C;&#x6210;&#x3002;&#x901A;&#x8FC7;&#x64CD;&#x4F5C;&#x9632;&#x706B;&#x5899;&#x8BBE;&#x5907;&#x7684;&#x8FC7;&#x6EE4;&#x8BBE;&#x7F6E;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x4FEE;&#x6539;&#x88AB;&#x6CE8;&#x5165;&#x5C01;&#x5305;&#x7684;&#x54CD;&#x5E94;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Nmap &#x6267;&#x884C;&#x9632;&#x706B;&#x5899; ACK &#x626B;&#x63CF;&#xFF0C;Nmap &#x5E94;&#x8BE5;&#x4EE5;&#x6307;&#x5B9A;&#x7684; IP &#x5730;&#x5740;&#xFF0C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x548C;<code>-sA</code>&#x9009;&#x9879;&#x8C03;&#x7528;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap -sA 172.16.36.135 -p 22

Starting Nmap 6.25 ( http://nmap.org ) at 2014-01-24 11:21 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00032s latency). 
PORT   STATE      SERVICE 
22/tcp unfiltered ssh 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 0.05 seconds 
root@KaliLinux:~# nmap -sA 83.166.169.228 -p 22

Starting Nmap 6.25 ( http://nmap.org ) at 2014-01-24 11:25 EST
Nmap scan report for packtpub.com (83.166.169.228) 
Host is up (0.14s latency). 
PORT   STATE    SERVICE 
22/tcp filtered ssh

Nmap done: 1 IP address (1 host up) scanned in 2.23 seconds
</code></pre><p>&#x901A;&#x8FC7;&#x5728;&#x672C;&#x5730;&#x7F51;&#x7EDC;&#x4E2D;&#x7684; Metasploitable2 &#x7CFB;&#x7EDF;&#x4E0A;&#x6267;&#x884C;&#x626B;&#x63CF;&#xFF0C;&#x6D41;&#x91CF;&#x5E76;&#x4E0D;&#x7ECF;&#x8FC7;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x54CD;&#x5E94;&#x8868;&#x660E; TCP 22 &#x7AEF;&#x53E3;&#x662F;&#x672A;&#x8FC7;&#x6EE4;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x5BF9;<code>packtpub. com</code>&#x7684;&#x8FDC;&#x7A0B; IP &#x5730;&#x5740;&#x6267;&#x884C;&#x76F8;&#x540C;&#x626B;&#x63CF;&#xFF0C;&#x7AEF;&#x53E3; 22 &#x662F;&#x8FC7;&#x6EE4;&#x5668;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x6267;&#x884C;&#x76F8;&#x540C;&#x626B;&#x63CF;&#xFF0C;&#x800C;&#x4E0D;&#x6307;&#x5B9A;&#x7AEF;&#x53E3;&#xFF0C;&#x7AEF;&#x53E3;&#x8FC7;&#x6EE4;&#x8BC4;&#x4F30;&#x53EF;&#x4EE5;&#x5728; Nmap &#x7684; 1000 &#x4E2A;&#x5E38;&#x7528;&#x7AEF;&#x53E3;&#x4E0A;&#x5B8C;&#x6210;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap -sA 172.16.36.135

Starting Nmap 6.25 ( http://nmap.org ) at 2014-01-24 11:21 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00041s latency). All 1000 scanned ports on 172.16.36.135 are unfiltered 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 0.10 seconds
</code></pre><p>&#x5BF9;&#x672C;&#x5730;&#x7F51;&#x7EDC;&#x4E0A;&#x7684; Metasploit2 &#x7CFB;&#x7EDF;&#x6267;&#x884C;&#x626B;&#x63CF;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x5B83;&#x6CA1;&#x6709;&#x88AB;&#x4EFB;&#x4F55;&#x9632;&#x706B;&#x5899;&#x4FDD;&#x62A4;&#xFF0C;&#x7ED3;&#x679C;&#x8868;&#x660E;&#x6240;&#x6709;&#x7AEF;&#x53E3;&#x90FD;&#x662F;&#x672A;&#x8FC7;&#x6EE4;&#x7684;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;<code>packtpub.com</code>&#x57DF;&#x5185;&#x6267;&#x884C;&#x76F8;&#x540C;&#x626B;&#x63CF;&#xFF0C;&#x6240;&#x6709;&#x7AEF;&#x53E3;&#x90FD;&#x8BC6;&#x522B;&#x4E3A;&#x5B58;&#x5728;&#x8FC7;&#x6EE4;&#xFF0C;&#x9664;&#x4E86; TCP &#x7AEF;&#x53E3; 80&#xFF0C;&#x8FD9;&#x662F; Web &#x5E94;&#x7528;&#x90E8;&#x7F72;&#x7684;&#x5730;&#x65B9;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x5728;&#x626B;&#x63CF;&#x7AEF;&#x53E3;&#x8303;&#x56F4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8F93;&#x51FA;&#x53EA;&#x5305;&#x542B;&#x672A;&#x8FC7;&#x6EE4;&#x7684;&#x7AEF;&#x53E3;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap -sA 83.166.169.228

Starting Nmap 6.25 ( http://nmap.org ) at 2014-01-24 11:25 EST 
Nmap scan report for packtpub.com (83.166.169.228) 
Host is up (0.15s latency). 
Not shown: 999 filtered ports 
PORT   STATE      SERVICE 
80/tcp unfiltered http

Nmap done: 1 IP address (1 host up) scanned in 13.02 seconds
</code></pre><p>&#x4E3A;&#x4E86;&#x5728;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684; TCP &#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x626B;&#x63CF;&#xFF0C;&#x9700;&#x8981;&#x5965;&#x5999;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x3002;&#x5B9A;&#x4E49;&#x4E86;&#x6765;&#x6E90;&#x548C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#x5730;&#x5740;&#x7684; TCP &#x5934;&#x90E8;&#x90E8;&#x5206;&#x662F; 16 &#x4F4D;&#x957F;&#xFF0C;&#x6BCF;&#x4E00;&#x4F4D;&#x53EF;&#x4EE5;&#x4E3A;&#x503C; 1 &#x6216;&#x8005; 0&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x5171;&#x6709;<code>2 **16</code>&#x6216; 65536 &#x4E2A; TCP &#x7AEF;&#x53E3;&#x5730;&#x5740;&#x3002;&#x4E3A;&#x4E86;&#x626B;&#x63CF;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x5FC5;&#x987B;&#x63D0;&#x4F9B; 1 &#x5230; 65535 &#x7684; &#x8303;&#x56F4;&#x3002;</p>
<pre><code>root@KaliLinux:~# nmap -sA 172.16.36.135 -p 1-65535

Starting Nmap 6.25 ( http://nmap.org ) at 2014-01-24 11:21 EST 
Nmap scan report for 172.16.36.135 
Host is up (0.00041s latency).
All 65535 scanned ports on 172.16.36.135 are unfiltered 
MAC Address: 00:0C:29:3D:84:32 (VMware)

Nmap done: 1 IP address (1 host up) scanned in 1.77 seconds
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>&#x9664;&#x4E86; Nmap &#x63D0;&#x4F9B;&#x7684;&#x8BB8;&#x591A;&#x529F;&#x80FD;&#xFF0C;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8BC6;&#x522B;&#x9632;&#x706B;&#x5899;&#x8FC7;&#x6EE4;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740; Nmap &#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x5728; Scapy &#x79D8;&#x7C4D;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x76F8;&#x540C;&#x6280;&#x5DE7;&#xFF0C;&#x6765;&#x6267;&#x884C;&#x8FD9;&#x79CD;&#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;&#x3002;SYN &#x548C; &#x6765;&#x8DEF;&#x4E0D;&#x660E;&#x7684; ACK &#x7684;&#x7EC4;&#x5408;&#x4F1A;&#x53D1;&#x9001;&#x7ED9;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#xFF0C;&#x54CD;&#x5E94;&#x7528;&#x4E8E;&#x5206;&#x6790;&#x6765;&#x5224;&#x65AD;&#x8FC7;&#x6EE4;&#x72B6;&#x6001;&#x3002;</p>
<h2 id="418-metasploit-&#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;">4.18 Metasploit &#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;</h2>
<p>Metasploit &#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x626B;&#x63CF;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x591A;&#x7EBF;&#x7A0B;&#x7F51;&#x7EDC;&#x7AEF;&#x53E3;&#x5206;&#x6790;&#xFF0C;&#x57FA;&#x4E8E; SYN/ACK &#x63A2;&#x6D4B;&#x54CD;&#x5E94;&#x5206;&#x6790;&#xFF0C;&#x6765;&#x5224;&#x65AD;&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x88AB;&#x8FC7;&#x6EE4;&#x3002;</p>
<h3 id="&#x51C6;&#x5907;">&#x51C6;&#x5907;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Metasploit &#x6765;&#x6267;&#x884C;&#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x8FC7;&#x6EE4;&#x673A;&#x5236;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x72EC;&#x7ACB;&#x9632;&#x706B;&#x5899;&#x8BBE;&#x5907;&#xFF0C;&#x6216;&#x8005;&#x57FA;&#x4E8E;&#x4E3B;&#x673A;&#x7684;&#x8FC7;&#x6EE4;&#xFF0C;&#x4F8B;&#x5982; Windows &#x9632;&#x706B;&#x5899;&#x6765;&#x5B8C;&#x6210;&#x3002;&#x901A;&#x8FC7;&#x64CD;&#x4F5C;&#x9632;&#x706B;&#x5899;&#x8BBE;&#x5907;&#x7684;&#x8FC7;&#x6EE4;&#x8BBE;&#x7F6E;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x4FEE;&#x6539;&#x88AB;&#x6CE8;&#x5165;&#x5C01;&#x5305;&#x7684;&#x54CD;&#x5E94;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;">&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;</h3>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7528; Metasploit ACK &#x626B;&#x63CF;&#x6A21;&#x5757;&#x6765;&#x6267;&#x884C;&#x9632;&#x706B;&#x5899;&#x548C;&#x8FC7;&#x6EE4;&#x8BC6;&#x522B;&#xFF0C;&#x4F60;&#x9996;&#x5148;&#x5FC5;&#x987B;&#x4ECE; Kali &#x7684;&#x7EC8;&#x7AEF;&#x4E2D;&#x542F;&#x52A8; MSF &#x63A7;&#x5236;&#x53F0;&#xFF0C;&#x4E4B;&#x540E;&#x4F7F;&#x7528;<code>use</code>&#x547D;&#x4EE4;&#x9009;&#x9879;&#x6240;&#x9700;&#x7684;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#x3002;</p>
<pre><code>root@KaliLinux:~# msfconsole 
# cowsay++ 
 ____________ 
&lt; metasploit &gt; 
 -----------       
       \   ,__,        
        \  (oo)____           
           (__)    )\              
              ||--|| *


Using notepad to track pentests? Have Metasploit Pro report on hosts, services, sessions and evidence -- type &apos;go_pro&apos; to launch it now.

       =[ metasploit v4.6.0-dev [core:4.6 api:1.0] 
+ -- --=[ 1053 exploits - 590 auxiliary - 174 post 
+ -- --=[ 275 payloads - 28 encoders - 8 nops

msf &gt; use auxiliary/scanner/portscan/ack 
msf  auxiliary(ack) &gt; show options

Module options (auxiliary/scanner/portscan/ack):

   Name       Current Setting  Required  Description   
   ----       ---------------  --------  ----------   
   BATCHSIZE  256              yes       The number of hosts to scan  per set   
   INTERFACE                   no        The name of the interface   
   PORTS      1-10000          yes       Ports to scan (e.g. 22- 25,80,110-900)   
   RHOSTS                      yes       The target address range or  CIDR identifier   
   SNAPLEN    65535            yes       The number of bytes to capture   
   THREADS    1                yes       The number of concurrent threads   
   TIMEOUT    500              yes       The reply read timeout in  milliseconds
</code></pre><p>&#x4E00;&#x65E6;&#x9009;&#x62E9;&#x4E86;&#x6A21;&#x5757;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>show options</code>&#x547D;&#x4EE4;&#x6765;&#x786E;&#x8BA4;&#x6216;&#x66F4;&#x6539;&#x626B;&#x63CF;&#x914D;&#x7F6E;&#x3002;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x4F1A;&#x5C55;&#x793A;&#x56DB;&#x4E2A;&#x5217;&#x7684;&#x8868;&#x683C;&#xFF0C;&#x5305;&#x62EC;<code>name</code>&#x3001;<code>current settings</code>&#x3001;<code>required</code>&#x548C;<code>description</code>&#x3002;<code>name</code>&#x5217;&#x6807;&#x51FA;&#x4E86;&#x6BCF;&#x4E2A;&#x53EF;&#x914D;&#x7F6E;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x3002;<code>current settings</code>&#x5217;&#x5217;&#x51FA;&#x4E86;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x53D8;&#x91CF;&#x7684;&#x73B0;&#x6709;&#x914D;&#x7F6E;&#x3002;<code>required</code>&#x5217;&#x6807;&#x51FA;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x53D8;&#x91CF;&#xFF0C;&#x503C;&#x662F;&#x5426;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x3002;<code>description</code>&#x5217;&#x63CF;&#x8FF0;&#x4E86;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>set</code>&#x547D;&#x4EE4;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x65B0;&#x7684;&#x503C;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x6765;&#x4FEE;&#x6539;&#x3002;</p>
<pre><code>msf  auxiliary(ack) &gt; set PORTS 1-100 
PORTS =&gt; 1-100 
msf  auxiliary(ack) &gt; set RHOSTS 172.16.36.135 
RHOSTS =&gt; 172.16.36.135 
msf  auxiliary(ack) &gt; set THREADS 25 
THREADS =&gt; 25 
msf  auxiliary(ack) &gt; show options

Module options (auxiliary/scanner/portscan/ack):

   Name       Current Setting  Required  Description   
   ----       ---------------  --------  ----------   
   BATCHSIZE  256              yes       The number of hosts to scan  per set   
   INTERFACE                   no        The name of the interface   
   PORTS      1-100            yes       Ports to scan (e.g. 22- 25,80,110-900)   
   RHOSTS     172.16.36.135    yes       The target address range or  CIDR identifier   
   SNAPLEN    65535            yes       The number of bytes to capture   
   THREADS    25               yes       The number of concurrent threads   
   TIMEOUT    500              yes       The reply read timeout in  milliseconds
</code></pre><p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>RHOSTS</code>&#x503C;&#x4FEE;&#x6539;&#x4E3A;&#x6211;&#x4EEC;&#x6253;&#x7B97;&#x626B;&#x63CF;&#x7684;&#x8FDC;&#x7A0B;&#x7CFB;&#x7EDF;&#x7684; IP &#x5730;&#x5740;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x4FEE;&#x6539;&#x4E3A; 20&#x3002;<code>THREADS</code>&#x7684;&#x503C;&#x5B9A;&#x4E49;&#x4E86;&#x5728;&#x540E;&#x53F0;&#x6267;&#x884C;&#x7684;&#x5F53;&#x524D;&#x4EFB;&#x52A1;&#x6570;&#x91CF;&#x3002;&#x786E;&#x5B9A;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x6D89;&#x53CA;&#x5230;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x5E73;&#x8861;&#xFF0C;&#x65E2;&#x80FD;&#x63D0;&#x5347;&#x4EFB;&#x52A1;&#x901F;&#x5EA6;&#xFF0C;&#x53C8;&#x4E0D;&#x4F1A;&#x8FC7;&#x5EA6;&#x6D88;&#x8017;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x3002;&#x5BF9;&#x4E8E;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#xFF0C;20 &#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x8DB3;&#x591F;&#x5FEB;&#xFF0C;&#x5E76;&#x4E14;&#x76F8;&#x5F53;&#x5408;&#x7406;&#x3002;&#x4FEE;&#x6539;&#x4E86;&#x5FC5;&#x8981;&#x7684;&#x53D8;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x4F7F;&#x7528;<code>show options</code>&#x547D;&#x4EE4;&#x6765;&#x9A8C;&#x8BC1;&#x3002;&#x4E00;&#x65E6;&#x6240;&#x9700;&#x914D;&#x7F6E;&#x9A8C;&#x8BC1;&#x5B8C;&#x6BD5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x626B;&#x63CF;&#x4E86;&#x3002;</p>
<pre><code>msf  auxiliary(ack) &gt; run

[*] Scanned 1 of 1 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x552F;&#x4E00;&#x63D0;&#x4F9B;&#x7684;&#x8F93;&#x51FA;&#x5C31;&#x662F;&#x6709;&#x5173;&#x626B;&#x63CF;&#x7684;&#x6E90;&#x4FE1;&#x606F;&#xFF0C;&#x5B83;&#x663E;&#x793A;&#x4E86;&#x88AB;&#x626B;&#x63CF;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x4EE5;&#x53CA;&#x6A21;&#x5757;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x3002;&#x8F93;&#x51FA;&#x7684;&#x7F3A;&#x4E4F;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x548C; SYN &#x4EE5;&#x53CA; ACK &#x6CE8;&#x5165;&#x76F8;&#x5173;&#x7684;&#x54CD;&#x5E94;&#x4ECE;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x76F4;&#x63A5;&#x5230;&#x8FBE;&#x53E6;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#xFF0C;&#x56E0;&#x4E3A; Metasploitable2 &#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x9632;&#x706B;&#x5899;&#x3002;&#x4F5C;&#x4E3A;&#x66FF;&#x4EE3;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;<code>packtpub.com</code>&#x57DF;&#x4E0A;&#x6267;&#x884C;&#x76F8;&#x540C;&#x626B;&#x63CF;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;<code>RHOSTS</code>&#x503C;&#x4FEE;&#x6539;&#x4E3A;&#x548C;&#x5B83;&#x76F8;&#x5173;&#x7684; IP &#x5730;&#x5740;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x6536;&#x5230;&#x4E0D;&#x7528;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x4E3B;&#x673A;&#x653E;&#x5728;&#x9632;&#x706B;&#x5899;&#x80CC;&#x540E;&#xFF0C;&#x548C;&#x672A;&#x8FC7;&#x6EE4;&#x7AEF;&#x53E3;&#x76F8;&#x5173;&#x7684;&#x54CD;&#x5E94;&#x4E2D;&#x7684;&#x53D8;&#x5316;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>msf  auxiliary(ack) &gt; set RHOSTS 83.166.169.228 
RHOSTS =&gt; 83.166.169.228 
msf  auxiliary(ack) &gt; show options

Module options (auxiliary/scanner/portscan/ack):

   Name       Current Setting  Required  Description   
   ----       ---------------  --------  ----------   
   BATCHSIZE  256              yes       The number of hosts to scan  per set   
   INTERFACE                   no        The name of the interface   
   PORTS      1-100            yes       Ports to scan (e.g. 22- 25,80,110-900)   
   RHOSTS     83.166.169.228   yes       The target address range or  CIDR identifier   
   SNAPLEN    65535            yes       The number of bytes to capture   
   THREADS    25               yes       The number of concurrent threads   
   TIMEOUT    500              yes       The reply read timeout in  milliseconds

msf  auxiliary(ack) &gt; run

[*]  TCP UNFILTERED 83.166.169.228:80 
[*] Scanned 1 of 1 hosts (100% complete) 
[*] Auxiliary module execution completed
</code></pre><h3 id="&#x5DE5;&#x4F5C;&#x539F;&#x7406;">&#x5DE5;&#x4F5C;&#x539F;&#x7406;</h3>
<p>Metasploit &#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x6A21;&#x5757;&#xFF0C;&#x53EF;&#x4EE5;&#x4EE5;&#x591A;&#x79CD;&#x6280;&#x5DE7;&#x6267;&#x884C;&#x9632;&#x706B;&#x5899;&#x8BC6;&#x522B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6280;&#x5DE7;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x8FC7;&#x3002;&#x4F46;&#x662F;&#xFF0C;Metasploit &#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#x6765;&#x5206;&#x6790;&#x9632;&#x706B;&#x5899;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5176;&#x5B83;&#x4FE1;&#x606F;&#x7684;&#x6536;&#x96C6;&#x751A;&#x81F3;&#x662F;&#x5229;&#x7528;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch3.html" class="navigation navigation-prev " aria-label="Previous page: 第三章 端口扫描">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch5.html" class="navigation navigation-next " aria-label="Next page: 第五章 漏洞扫描">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第四章 指纹识别","level":"1.5","depth":1,"next":{"title":"第五章 漏洞扫描","level":"1.6","depth":1,"path":"ch5.md","ref":"ch5.md","articles":[]},"previous":{"title":"第三章 端口扫描","level":"1.4","depth":1,"path":"ch3.md","ref":"ch3.md","articles":[]},"dir":"ltr"},"config":{"plugins":["comment"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"comment":{"highlightCommented":true},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"wizardforcel","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Kali Linux 网络扫描秘籍","language":"zh","links":{"sidebar":{"Kali Linux 网络扫描秘籍":"https://www.gitbook.com/book/wizardforcel/kali-linux-network-scanning-cookbook"},"gitbook":true},"gitbook":"*","description":"Kali Linux Network Scanning Cookbook 中文版"},"file":{"path":"ch4.md","mtime":"2016-11-25T09:44:31.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2016-11-26T04:32:05.478Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-comment/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

